MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cydevicerv_trm.inc
;
; FILENAME: cydevicerv_trm.inc
; 
; PSoC Creator 1.0 Production
;
; DESCRIPTION:
; This file provides all of the address values for the entire PSoC device.
;
;-------------------------------------------------------------------------------
; Copyright 2008-2010, Cypress Semiconductor Corporation.  All rights reserved.
; You may use this file only in accordance with the license, terms, conditions, 
; disclaimers, and limitations in the end user license agreement accompanying 
; the software package with which this file was provided.
;-------------------------------------------------------------------------------

    IF :LNOT::DEF:CYDEV_FLASH_BASE
CYDEV_FLASH_BASE EQU 0x00000000
    ENDIF
    IF :LNOT::DEF:CYDEV_FLASH_SIZE
CYDEV_FLASH_SIZE EQU 0x00040000
    ENDIF
    IF :LNOT::DEF:CYREG_FLASH_DATA_MBASE
CYREG_FLASH_DATA_MBASE EQU 0x00000000
    ENDIF
    IF :LNOT::DEF:CYREG_FLASH_DATA_MSIZE
CYREG_FLASH_DATA_MSIZE EQU 0x00040000
    ENDIF
    IF :LNOT::DEF:CYDEV_SRAM_BASE
CYDEV_SRAM_BASE EQU 0x1fff8000
    ENDIF
    IF :LNOT::DEF:CYDEV_SRAM_SIZE
CYDEV_SRAM_SIZE EQU 0x00010000
    ENDIF
    IF :LNOT::DEF:CYREG_SRAM_CODE64K_MBASE
CYREG_SRAM_CODE64K_MBASE EQU 0x1fff8000
    ENDIF
    IF :LNOT::DEF:CYREG_SRAM_CODE64K_MSIZE
CYREG_SRAM_CODE64K_MSIZE EQU 0x00004000
    ENDIF
    IF :LNOT::DEF:CYREG_SRAM_CODE32K_MBASE
CYREG_SRAM_CODE32K_MBASE EQU 0x1fffc000
    ENDIF
    IF :LNOT::DEF:CYREG_SRAM_CODE32K_MSIZE
CYREG_SRAM_CODE32K_MSIZE EQU 0x00002000
    ENDIF
    IF :LNOT::DEF:CYREG_SRAM_CODE16K_MBASE
CYREG_SRAM_CODE16K_MBASE EQU 0x1fffe000
    ENDIF
    IF :LNOT::DEF:CYREG_SRAM_CODE16K_MSIZE
CYREG_SRAM_CODE16K_MSIZE EQU 0x00001000
    ENDIF
    IF :LNOT::DEF:CYREG_SRAM_CODE_MBASE
CYREG_SRAM_CODE_MBASE EQU 0x1fff8000
    ENDIF
    IF :LNOT::DEF:CYREG_SRAM_CODE_MSIZE
CYREG_SRAM_CODE_MSIZE EQU 0x00008000
    ENDIF
    IF :LNOT::DEF:CYREG_SRAM_DATA_MBASE
CYREG_SRAM_DATA_MBASE EQU 0x20000000
    ENDIF
    IF :LNOT::DEF:CYREG_SRAM_DATA_MSIZE
CYREG_SRAM_DATA_MSIZE EQU 0x00008000
    ENDIF
    IF :LNOT::DEF:CYREG_SRAM_DATA16K_MBASE
CYREG_SRAM_DATA16K_MBASE EQU 0x20001000
    ENDIF
    IF :LNOT::DEF:CYREG_SRAM_DATA16K_MSIZE
CYREG_SRAM_DATA16K_MSIZE EQU 0x00001000
    ENDIF
    IF :LNOT::DEF:CYREG_SRAM_DATA32K_MBASE
CYREG_SRAM_DATA32K_MBASE EQU 0x20002000
    ENDIF
    IF :LNOT::DEF:CYREG_SRAM_DATA32K_MSIZE
CYREG_SRAM_DATA32K_MSIZE EQU 0x00002000
    ENDIF
    IF :LNOT::DEF:CYREG_SRAM_DATA64K_MBASE
CYREG_SRAM_DATA64K_MBASE EQU 0x20004000
    ENDIF
    IF :LNOT::DEF:CYREG_SRAM_DATA64K_MSIZE
CYREG_SRAM_DATA64K_MSIZE EQU 0x00004000
    ENDIF
    IF :LNOT::DEF:CYDEV_CLKDIST_BASE
CYDEV_CLKDIST_BASE EQU 0x40004000
    ENDIF
    IF :LNOT::DEF:CYDEV_CLKDIST_SIZE
CYDEV_CLKDIST_SIZE EQU 0x00000110
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_CR
CYREG_CLKDIST_CR EQU 0x40004000
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_LD
CYREG_CLKDIST_LD EQU 0x40004001
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_WRK0
CYREG_CLKDIST_WRK0 EQU 0x40004002
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_WRK1
CYREG_CLKDIST_WRK1 EQU 0x40004003
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_MSTR0
CYREG_CLKDIST_MSTR0 EQU 0x40004004
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_MSTR1
CYREG_CLKDIST_MSTR1 EQU 0x40004005
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_BCFG0
CYREG_CLKDIST_BCFG0 EQU 0x40004006
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_BCFG1
CYREG_CLKDIST_BCFG1 EQU 0x40004007
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_BCFG2
CYREG_CLKDIST_BCFG2 EQU 0x40004008
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_UCFG
CYREG_CLKDIST_UCFG EQU 0x40004009
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_DLY0
CYREG_CLKDIST_DLY0 EQU 0x4000400a
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_DLY1
CYREG_CLKDIST_DLY1 EQU 0x4000400b
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_DMASK
CYREG_CLKDIST_DMASK EQU 0x40004010
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_AMASK
CYREG_CLKDIST_AMASK EQU 0x40004014
    ENDIF
    IF :LNOT::DEF:CYDEV_CLKDIST_DCFG0_BASE
CYDEV_CLKDIST_DCFG0_BASE EQU 0x40004080
    ENDIF
    IF :LNOT::DEF:CYDEV_CLKDIST_DCFG0_SIZE
CYDEV_CLKDIST_DCFG0_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_DCFG0_CFG0
CYREG_CLKDIST_DCFG0_CFG0 EQU 0x40004080
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_DCFG0_CFG1
CYREG_CLKDIST_DCFG0_CFG1 EQU 0x40004081
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_DCFG0_CFG2
CYREG_CLKDIST_DCFG0_CFG2 EQU 0x40004082
    ENDIF
    IF :LNOT::DEF:CYDEV_CLKDIST_DCFG1_BASE
CYDEV_CLKDIST_DCFG1_BASE EQU 0x40004084
    ENDIF
    IF :LNOT::DEF:CYDEV_CLKDIST_DCFG1_SIZE
CYDEV_CLKDIST_DCFG1_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_DCFG1_CFG0
CYREG_CLKDIST_DCFG1_CFG0 EQU 0x40004084
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_DCFG1_CFG1
CYREG_CLKDIST_DCFG1_CFG1 EQU 0x40004085
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_DCFG1_CFG2
CYREG_CLKDIST_DCFG1_CFG2 EQU 0x40004086
    ENDIF
    IF :LNOT::DEF:CYDEV_CLKDIST_DCFG2_BASE
CYDEV_CLKDIST_DCFG2_BASE EQU 0x40004088
    ENDIF
    IF :LNOT::DEF:CYDEV_CLKDIST_DCFG2_SIZE
CYDEV_CLKDIST_DCFG2_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_DCFG2_CFG0
CYREG_CLKDIST_DCFG2_CFG0 EQU 0x40004088
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_DCFG2_CFG1
CYREG_CLKDIST_DCFG2_CFG1 EQU 0x40004089
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_DCFG2_CFG2
CYREG_CLKDIST_DCFG2_CFG2 EQU 0x4000408a
    ENDIF
    IF :LNOT::DEF:CYDEV_CLKDIST_DCFG3_BASE
CYDEV_CLKDIST_DCFG3_BASE EQU 0x4000408c
    ENDIF
    IF :LNOT::DEF:CYDEV_CLKDIST_DCFG3_SIZE
CYDEV_CLKDIST_DCFG3_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_DCFG3_CFG0
CYREG_CLKDIST_DCFG3_CFG0 EQU 0x4000408c
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_DCFG3_CFG1
CYREG_CLKDIST_DCFG3_CFG1 EQU 0x4000408d
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_DCFG3_CFG2
CYREG_CLKDIST_DCFG3_CFG2 EQU 0x4000408e
    ENDIF
    IF :LNOT::DEF:CYDEV_CLKDIST_DCFG4_BASE
CYDEV_CLKDIST_DCFG4_BASE EQU 0x40004090
    ENDIF
    IF :LNOT::DEF:CYDEV_CLKDIST_DCFG4_SIZE
CYDEV_CLKDIST_DCFG4_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_DCFG4_CFG0
CYREG_CLKDIST_DCFG4_CFG0 EQU 0x40004090
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_DCFG4_CFG1
CYREG_CLKDIST_DCFG4_CFG1 EQU 0x40004091
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_DCFG4_CFG2
CYREG_CLKDIST_DCFG4_CFG2 EQU 0x40004092
    ENDIF
    IF :LNOT::DEF:CYDEV_CLKDIST_DCFG5_BASE
CYDEV_CLKDIST_DCFG5_BASE EQU 0x40004094
    ENDIF
    IF :LNOT::DEF:CYDEV_CLKDIST_DCFG5_SIZE
CYDEV_CLKDIST_DCFG5_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_DCFG5_CFG0
CYREG_CLKDIST_DCFG5_CFG0 EQU 0x40004094
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_DCFG5_CFG1
CYREG_CLKDIST_DCFG5_CFG1 EQU 0x40004095
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_DCFG5_CFG2
CYREG_CLKDIST_DCFG5_CFG2 EQU 0x40004096
    ENDIF
    IF :LNOT::DEF:CYDEV_CLKDIST_DCFG6_BASE
CYDEV_CLKDIST_DCFG6_BASE EQU 0x40004098
    ENDIF
    IF :LNOT::DEF:CYDEV_CLKDIST_DCFG6_SIZE
CYDEV_CLKDIST_DCFG6_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_DCFG6_CFG0
CYREG_CLKDIST_DCFG6_CFG0 EQU 0x40004098
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_DCFG6_CFG1
CYREG_CLKDIST_DCFG6_CFG1 EQU 0x40004099
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_DCFG6_CFG2
CYREG_CLKDIST_DCFG6_CFG2 EQU 0x4000409a
    ENDIF
    IF :LNOT::DEF:CYDEV_CLKDIST_DCFG7_BASE
CYDEV_CLKDIST_DCFG7_BASE EQU 0x4000409c
    ENDIF
    IF :LNOT::DEF:CYDEV_CLKDIST_DCFG7_SIZE
CYDEV_CLKDIST_DCFG7_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_DCFG7_CFG0
CYREG_CLKDIST_DCFG7_CFG0 EQU 0x4000409c
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_DCFG7_CFG1
CYREG_CLKDIST_DCFG7_CFG1 EQU 0x4000409d
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_DCFG7_CFG2
CYREG_CLKDIST_DCFG7_CFG2 EQU 0x4000409e
    ENDIF
    IF :LNOT::DEF:CYDEV_CLKDIST_ACFG0_BASE
CYDEV_CLKDIST_ACFG0_BASE EQU 0x40004100
    ENDIF
    IF :LNOT::DEF:CYDEV_CLKDIST_ACFG0_SIZE
CYDEV_CLKDIST_ACFG0_SIZE EQU 0x00000004
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_ACFG0_CFG0
CYREG_CLKDIST_ACFG0_CFG0 EQU 0x40004100
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_ACFG0_CFG1
CYREG_CLKDIST_ACFG0_CFG1 EQU 0x40004101
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_ACFG0_CFG2
CYREG_CLKDIST_ACFG0_CFG2 EQU 0x40004102
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_ACFG0_CFG3
CYREG_CLKDIST_ACFG0_CFG3 EQU 0x40004103
    ENDIF
    IF :LNOT::DEF:CYDEV_CLKDIST_ACFG1_BASE
CYDEV_CLKDIST_ACFG1_BASE EQU 0x40004104
    ENDIF
    IF :LNOT::DEF:CYDEV_CLKDIST_ACFG1_SIZE
CYDEV_CLKDIST_ACFG1_SIZE EQU 0x00000004
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_ACFG1_CFG0
CYREG_CLKDIST_ACFG1_CFG0 EQU 0x40004104
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_ACFG1_CFG1
CYREG_CLKDIST_ACFG1_CFG1 EQU 0x40004105
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_ACFG1_CFG2
CYREG_CLKDIST_ACFG1_CFG2 EQU 0x40004106
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_ACFG1_CFG3
CYREG_CLKDIST_ACFG1_CFG3 EQU 0x40004107
    ENDIF
    IF :LNOT::DEF:CYDEV_CLKDIST_ACFG2_BASE
CYDEV_CLKDIST_ACFG2_BASE EQU 0x40004108
    ENDIF
    IF :LNOT::DEF:CYDEV_CLKDIST_ACFG2_SIZE
CYDEV_CLKDIST_ACFG2_SIZE EQU 0x00000004
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_ACFG2_CFG0
CYREG_CLKDIST_ACFG2_CFG0 EQU 0x40004108
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_ACFG2_CFG1
CYREG_CLKDIST_ACFG2_CFG1 EQU 0x40004109
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_ACFG2_CFG2
CYREG_CLKDIST_ACFG2_CFG2 EQU 0x4000410a
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_ACFG2_CFG3
CYREG_CLKDIST_ACFG2_CFG3 EQU 0x4000410b
    ENDIF
    IF :LNOT::DEF:CYDEV_CLKDIST_ACFG3_BASE
CYDEV_CLKDIST_ACFG3_BASE EQU 0x4000410c
    ENDIF
    IF :LNOT::DEF:CYDEV_CLKDIST_ACFG3_SIZE
CYDEV_CLKDIST_ACFG3_SIZE EQU 0x00000004
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_ACFG3_CFG0
CYREG_CLKDIST_ACFG3_CFG0 EQU 0x4000410c
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_ACFG3_CFG1
CYREG_CLKDIST_ACFG3_CFG1 EQU 0x4000410d
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_ACFG3_CFG2
CYREG_CLKDIST_ACFG3_CFG2 EQU 0x4000410e
    ENDIF
    IF :LNOT::DEF:CYREG_CLKDIST_ACFG3_CFG3
CYREG_CLKDIST_ACFG3_CFG3 EQU 0x4000410f
    ENDIF
    IF :LNOT::DEF:CYDEV_FASTCLK_BASE
CYDEV_FASTCLK_BASE EQU 0x40004200
    ENDIF
    IF :LNOT::DEF:CYDEV_FASTCLK_SIZE
CYDEV_FASTCLK_SIZE EQU 0x00000026
    ENDIF
    IF :LNOT::DEF:CYDEV_FASTCLK_IMO_BASE
CYDEV_FASTCLK_IMO_BASE EQU 0x40004200
    ENDIF
    IF :LNOT::DEF:CYDEV_FASTCLK_IMO_SIZE
CYDEV_FASTCLK_IMO_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_FASTCLK_IMO_CR
CYREG_FASTCLK_IMO_CR EQU 0x40004200
    ENDIF
    IF :LNOT::DEF:CYDEV_FASTCLK_XMHZ_BASE
CYDEV_FASTCLK_XMHZ_BASE EQU 0x40004210
    ENDIF
    IF :LNOT::DEF:CYDEV_FASTCLK_XMHZ_SIZE
CYDEV_FASTCLK_XMHZ_SIZE EQU 0x00000004
    ENDIF
    IF :LNOT::DEF:CYREG_FASTCLK_XMHZ_CSR
CYREG_FASTCLK_XMHZ_CSR EQU 0x40004210
    ENDIF
    IF :LNOT::DEF:CYREG_FASTCLK_XMHZ_TST
CYREG_FASTCLK_XMHZ_TST EQU 0x40004211
    ENDIF
    IF :LNOT::DEF:CYREG_FASTCLK_XMHZ_CFG0
CYREG_FASTCLK_XMHZ_CFG0 EQU 0x40004212
    ENDIF
    IF :LNOT::DEF:CYREG_FASTCLK_XMHZ_CFG1
CYREG_FASTCLK_XMHZ_CFG1 EQU 0x40004213
    ENDIF
    IF :LNOT::DEF:CYDEV_FASTCLK_PLL_BASE
CYDEV_FASTCLK_PLL_BASE EQU 0x40004220
    ENDIF
    IF :LNOT::DEF:CYDEV_FASTCLK_PLL_SIZE
CYDEV_FASTCLK_PLL_SIZE EQU 0x00000006
    ENDIF
    IF :LNOT::DEF:CYREG_FASTCLK_PLL_CFG0
CYREG_FASTCLK_PLL_CFG0 EQU 0x40004220
    ENDIF
    IF :LNOT::DEF:CYREG_FASTCLK_PLL_CFG1
CYREG_FASTCLK_PLL_CFG1 EQU 0x40004221
    ENDIF
    IF :LNOT::DEF:CYREG_FASTCLK_PLL_P
CYREG_FASTCLK_PLL_P EQU 0x40004222
    ENDIF
    IF :LNOT::DEF:CYREG_FASTCLK_PLL_Q
CYREG_FASTCLK_PLL_Q EQU 0x40004223
    ENDIF
    IF :LNOT::DEF:CYREG_FASTCLK_PLL_TST
CYREG_FASTCLK_PLL_TST EQU 0x40004224
    ENDIF
    IF :LNOT::DEF:CYREG_FASTCLK_PLL_SR
CYREG_FASTCLK_PLL_SR EQU 0x40004225
    ENDIF
    IF :LNOT::DEF:CYDEV_SLOWCLK_BASE
CYDEV_SLOWCLK_BASE EQU 0x40004300
    ENDIF
    IF :LNOT::DEF:CYDEV_SLOWCLK_SIZE
CYDEV_SLOWCLK_SIZE EQU 0x0000000b
    ENDIF
    IF :LNOT::DEF:CYDEV_SLOWCLK_ILO_BASE
CYDEV_SLOWCLK_ILO_BASE EQU 0x40004300
    ENDIF
    IF :LNOT::DEF:CYDEV_SLOWCLK_ILO_SIZE
CYDEV_SLOWCLK_ILO_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYREG_SLOWCLK_ILO_CR0
CYREG_SLOWCLK_ILO_CR0 EQU 0x40004300
    ENDIF
    IF :LNOT::DEF:CYREG_SLOWCLK_ILO_CR1
CYREG_SLOWCLK_ILO_CR1 EQU 0x40004301
    ENDIF
    IF :LNOT::DEF:CYDEV_SLOWCLK_X32_BASE
CYDEV_SLOWCLK_X32_BASE EQU 0x40004308
    ENDIF
    IF :LNOT::DEF:CYDEV_SLOWCLK_X32_SIZE
CYDEV_SLOWCLK_X32_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYREG_SLOWCLK_X32_CR
CYREG_SLOWCLK_X32_CR EQU 0x40004308
    ENDIF
    IF :LNOT::DEF:CYREG_SLOWCLK_X32_CFG
CYREG_SLOWCLK_X32_CFG EQU 0x40004309
    ENDIF
    IF :LNOT::DEF:CYREG_SLOWCLK_X32_TST
CYREG_SLOWCLK_X32_TST EQU 0x4000430a
    ENDIF
    IF :LNOT::DEF:CYDEV_BOOST_BASE
CYDEV_BOOST_BASE EQU 0x40004320
    ENDIF
    IF :LNOT::DEF:CYDEV_BOOST_SIZE
CYDEV_BOOST_SIZE EQU 0x00000005
    ENDIF
    IF :LNOT::DEF:CYREG_BOOST_CR0
CYREG_BOOST_CR0 EQU 0x40004320
    ENDIF
    IF :LNOT::DEF:CYREG_BOOST_CR1
CYREG_BOOST_CR1 EQU 0x40004321
    ENDIF
    IF :LNOT::DEF:CYREG_BOOST_CR2
CYREG_BOOST_CR2 EQU 0x40004322
    ENDIF
    IF :LNOT::DEF:CYREG_BOOST_CR3
CYREG_BOOST_CR3 EQU 0x40004323
    ENDIF
    IF :LNOT::DEF:CYREG_BOOST_SR
CYREG_BOOST_SR EQU 0x40004324
    ENDIF
    IF :LNOT::DEF:CYDEV_PWRSYS_BASE
CYDEV_PWRSYS_BASE EQU 0x40004330
    ENDIF
    IF :LNOT::DEF:CYDEV_PWRSYS_SIZE
CYDEV_PWRSYS_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYREG_PWRSYS_CR0
CYREG_PWRSYS_CR0 EQU 0x40004330
    ENDIF
    IF :LNOT::DEF:CYREG_PWRSYS_CR1
CYREG_PWRSYS_CR1 EQU 0x40004331
    ENDIF
    IF :LNOT::DEF:CYDEV_PM_BASE
CYDEV_PM_BASE EQU 0x40004380
    ENDIF
    IF :LNOT::DEF:CYDEV_PM_SIZE
CYDEV_PM_SIZE EQU 0x00000057
    ENDIF
    IF :LNOT::DEF:CYREG_PM_TW_CFG0
CYREG_PM_TW_CFG0 EQU 0x40004380
    ENDIF
    IF :LNOT::DEF:CYREG_PM_TW_CFG1
CYREG_PM_TW_CFG1 EQU 0x40004381
    ENDIF
    IF :LNOT::DEF:CYREG_PM_TW_CFG2
CYREG_PM_TW_CFG2 EQU 0x40004382
    ENDIF
    IF :LNOT::DEF:CYREG_PM_WDT_CFG
CYREG_PM_WDT_CFG EQU 0x40004383
    ENDIF
    IF :LNOT::DEF:CYREG_PM_WDT_CR
CYREG_PM_WDT_CR EQU 0x40004384
    ENDIF
    IF :LNOT::DEF:CYREG_PM_INT_SR
CYREG_PM_INT_SR EQU 0x40004390
    ENDIF
    IF :LNOT::DEF:CYREG_PM_MODE_CFG0
CYREG_PM_MODE_CFG0 EQU 0x40004391
    ENDIF
    IF :LNOT::DEF:CYREG_PM_MODE_CFG1
CYREG_PM_MODE_CFG1 EQU 0x40004392
    ENDIF
    IF :LNOT::DEF:CYREG_PM_MODE_CSR
CYREG_PM_MODE_CSR EQU 0x40004393
    ENDIF
    IF :LNOT::DEF:CYREG_PM_WAKEUP_CFG0
CYREG_PM_WAKEUP_CFG0 EQU 0x40004398
    ENDIF
    IF :LNOT::DEF:CYREG_PM_WAKEUP_CFG1
CYREG_PM_WAKEUP_CFG1 EQU 0x40004399
    ENDIF
    IF :LNOT::DEF:CYDEV_PM_ACT_BASE
CYDEV_PM_ACT_BASE EQU 0x400043a0
    ENDIF
    IF :LNOT::DEF:CYDEV_PM_ACT_SIZE
CYDEV_PM_ACT_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYREG_PM_ACT_CFG0
CYREG_PM_ACT_CFG0 EQU 0x400043a0
    ENDIF
    IF :LNOT::DEF:CYREG_PM_ACT_CFG1
CYREG_PM_ACT_CFG1 EQU 0x400043a1
    ENDIF
    IF :LNOT::DEF:CYREG_PM_ACT_CFG2
CYREG_PM_ACT_CFG2 EQU 0x400043a2
    ENDIF
    IF :LNOT::DEF:CYREG_PM_ACT_CFG3
CYREG_PM_ACT_CFG3 EQU 0x400043a3
    ENDIF
    IF :LNOT::DEF:CYREG_PM_ACT_CFG4
CYREG_PM_ACT_CFG4 EQU 0x400043a4
    ENDIF
    IF :LNOT::DEF:CYREG_PM_ACT_CFG5
CYREG_PM_ACT_CFG5 EQU 0x400043a5
    ENDIF
    IF :LNOT::DEF:CYREG_PM_ACT_CFG6
CYREG_PM_ACT_CFG6 EQU 0x400043a6
    ENDIF
    IF :LNOT::DEF:CYREG_PM_ACT_CFG7
CYREG_PM_ACT_CFG7 EQU 0x400043a7
    ENDIF
    IF :LNOT::DEF:CYREG_PM_ACT_CFG8
CYREG_PM_ACT_CFG8 EQU 0x400043a8
    ENDIF
    IF :LNOT::DEF:CYREG_PM_ACT_CFG9
CYREG_PM_ACT_CFG9 EQU 0x400043a9
    ENDIF
    IF :LNOT::DEF:CYREG_PM_ACT_CFG10
CYREG_PM_ACT_CFG10 EQU 0x400043aa
    ENDIF
    IF :LNOT::DEF:CYREG_PM_ACT_CFG11
CYREG_PM_ACT_CFG11 EQU 0x400043ab
    ENDIF
    IF :LNOT::DEF:CYDEV_PM_STBY_BASE
CYDEV_PM_STBY_BASE EQU 0x400043b0
    ENDIF
    IF :LNOT::DEF:CYDEV_PM_STBY_SIZE
CYDEV_PM_STBY_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYREG_PM_STBY_CFG0
CYREG_PM_STBY_CFG0 EQU 0x400043b0
    ENDIF
    IF :LNOT::DEF:CYREG_PM_STBY_CFG1
CYREG_PM_STBY_CFG1 EQU 0x400043b1
    ENDIF
    IF :LNOT::DEF:CYREG_PM_STBY_CFG2
CYREG_PM_STBY_CFG2 EQU 0x400043b2
    ENDIF
    IF :LNOT::DEF:CYREG_PM_STBY_CFG3
CYREG_PM_STBY_CFG3 EQU 0x400043b3
    ENDIF
    IF :LNOT::DEF:CYREG_PM_STBY_CFG4
CYREG_PM_STBY_CFG4 EQU 0x400043b4
    ENDIF
    IF :LNOT::DEF:CYREG_PM_STBY_CFG5
CYREG_PM_STBY_CFG5 EQU 0x400043b5
    ENDIF
    IF :LNOT::DEF:CYREG_PM_STBY_CFG6
CYREG_PM_STBY_CFG6 EQU 0x400043b6
    ENDIF
    IF :LNOT::DEF:CYREG_PM_STBY_CFG7
CYREG_PM_STBY_CFG7 EQU 0x400043b7
    ENDIF
    IF :LNOT::DEF:CYREG_PM_STBY_CFG8
CYREG_PM_STBY_CFG8 EQU 0x400043b8
    ENDIF
    IF :LNOT::DEF:CYREG_PM_STBY_CFG9
CYREG_PM_STBY_CFG9 EQU 0x400043b9
    ENDIF
    IF :LNOT::DEF:CYREG_PM_STBY_CFG10
CYREG_PM_STBY_CFG10 EQU 0x400043ba
    ENDIF
    IF :LNOT::DEF:CYREG_PM_STBY_CFG11
CYREG_PM_STBY_CFG11 EQU 0x400043bb
    ENDIF
    IF :LNOT::DEF:CYDEV_PM_AVAIL_BASE
CYDEV_PM_AVAIL_BASE EQU 0x400043c0
    ENDIF
    IF :LNOT::DEF:CYDEV_PM_AVAIL_SIZE
CYDEV_PM_AVAIL_SIZE EQU 0x00000017
    ENDIF
    IF :LNOT::DEF:CYREG_PM_AVAIL_CR0
CYREG_PM_AVAIL_CR0 EQU 0x400043c0
    ENDIF
    IF :LNOT::DEF:CYREG_PM_AVAIL_CR1
CYREG_PM_AVAIL_CR1 EQU 0x400043c1
    ENDIF
    IF :LNOT::DEF:CYREG_PM_AVAIL_CR2
CYREG_PM_AVAIL_CR2 EQU 0x400043c2
    ENDIF
    IF :LNOT::DEF:CYREG_PM_AVAIL_CR3
CYREG_PM_AVAIL_CR3 EQU 0x400043c3
    ENDIF
    IF :LNOT::DEF:CYREG_PM_AVAIL_CR4
CYREG_PM_AVAIL_CR4 EQU 0x400043c4
    ENDIF
    IF :LNOT::DEF:CYREG_PM_AVAIL_CR5
CYREG_PM_AVAIL_CR5 EQU 0x400043c5
    ENDIF
    IF :LNOT::DEF:CYREG_PM_AVAIL_CR6
CYREG_PM_AVAIL_CR6 EQU 0x400043c6
    ENDIF
    IF :LNOT::DEF:CYREG_PM_AVAIL_SR0
CYREG_PM_AVAIL_SR0 EQU 0x400043d0
    ENDIF
    IF :LNOT::DEF:CYREG_PM_AVAIL_SR1
CYREG_PM_AVAIL_SR1 EQU 0x400043d1
    ENDIF
    IF :LNOT::DEF:CYREG_PM_AVAIL_SR2
CYREG_PM_AVAIL_SR2 EQU 0x400043d2
    ENDIF
    IF :LNOT::DEF:CYREG_PM_AVAIL_SR3
CYREG_PM_AVAIL_SR3 EQU 0x400043d3
    ENDIF
    IF :LNOT::DEF:CYREG_PM_AVAIL_SR4
CYREG_PM_AVAIL_SR4 EQU 0x400043d4
    ENDIF
    IF :LNOT::DEF:CYREG_PM_AVAIL_SR5
CYREG_PM_AVAIL_SR5 EQU 0x400043d5
    ENDIF
    IF :LNOT::DEF:CYREG_PM_AVAIL_SR6
CYREG_PM_AVAIL_SR6 EQU 0x400043d6
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_BASE
CYDEV_PICU_BASE EQU 0x40004500
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_SIZE
CYDEV_PICU_SIZE EQU 0x000000a0
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_INTTYPE_BASE
CYDEV_PICU_INTTYPE_BASE EQU 0x40004500
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_INTTYPE_SIZE
CYDEV_PICU_INTTYPE_SIZE EQU 0x00000080
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_INTTYPE_PICU0_BASE
CYDEV_PICU_INTTYPE_PICU0_BASE EQU 0x40004500
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_INTTYPE_PICU0_SIZE
CYDEV_PICU_INTTYPE_PICU0_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PICU0_INTTYPE0
CYREG_PICU0_INTTYPE0 EQU 0x40004500
    ENDIF
    IF :LNOT::DEF:CYREG_PICU0_INTTYPE1
CYREG_PICU0_INTTYPE1 EQU 0x40004501
    ENDIF
    IF :LNOT::DEF:CYREG_PICU0_INTTYPE2
CYREG_PICU0_INTTYPE2 EQU 0x40004502
    ENDIF
    IF :LNOT::DEF:CYREG_PICU0_INTTYPE3
CYREG_PICU0_INTTYPE3 EQU 0x40004503
    ENDIF
    IF :LNOT::DEF:CYREG_PICU0_INTTYPE4
CYREG_PICU0_INTTYPE4 EQU 0x40004504
    ENDIF
    IF :LNOT::DEF:CYREG_PICU0_INTTYPE5
CYREG_PICU0_INTTYPE5 EQU 0x40004505
    ENDIF
    IF :LNOT::DEF:CYREG_PICU0_INTTYPE6
CYREG_PICU0_INTTYPE6 EQU 0x40004506
    ENDIF
    IF :LNOT::DEF:CYREG_PICU0_INTTYPE7
CYREG_PICU0_INTTYPE7 EQU 0x40004507
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_INTTYPE_PICU1_BASE
CYDEV_PICU_INTTYPE_PICU1_BASE EQU 0x40004508
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_INTTYPE_PICU1_SIZE
CYDEV_PICU_INTTYPE_PICU1_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PICU1_INTTYPE0
CYREG_PICU1_INTTYPE0 EQU 0x40004508
    ENDIF
    IF :LNOT::DEF:CYREG_PICU1_INTTYPE1
CYREG_PICU1_INTTYPE1 EQU 0x40004509
    ENDIF
    IF :LNOT::DEF:CYREG_PICU1_INTTYPE2
CYREG_PICU1_INTTYPE2 EQU 0x4000450a
    ENDIF
    IF :LNOT::DEF:CYREG_PICU1_INTTYPE3
CYREG_PICU1_INTTYPE3 EQU 0x4000450b
    ENDIF
    IF :LNOT::DEF:CYREG_PICU1_INTTYPE4
CYREG_PICU1_INTTYPE4 EQU 0x4000450c
    ENDIF
    IF :LNOT::DEF:CYREG_PICU1_INTTYPE5
CYREG_PICU1_INTTYPE5 EQU 0x4000450d
    ENDIF
    IF :LNOT::DEF:CYREG_PICU1_INTTYPE6
CYREG_PICU1_INTTYPE6 EQU 0x4000450e
    ENDIF
    IF :LNOT::DEF:CYREG_PICU1_INTTYPE7
CYREG_PICU1_INTTYPE7 EQU 0x4000450f
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_INTTYPE_PICU2_BASE
CYDEV_PICU_INTTYPE_PICU2_BASE EQU 0x40004510
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_INTTYPE_PICU2_SIZE
CYDEV_PICU_INTTYPE_PICU2_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PICU2_INTTYPE0
CYREG_PICU2_INTTYPE0 EQU 0x40004510
    ENDIF
    IF :LNOT::DEF:CYREG_PICU2_INTTYPE1
CYREG_PICU2_INTTYPE1 EQU 0x40004511
    ENDIF
    IF :LNOT::DEF:CYREG_PICU2_INTTYPE2
CYREG_PICU2_INTTYPE2 EQU 0x40004512
    ENDIF
    IF :LNOT::DEF:CYREG_PICU2_INTTYPE3
CYREG_PICU2_INTTYPE3 EQU 0x40004513
    ENDIF
    IF :LNOT::DEF:CYREG_PICU2_INTTYPE4
CYREG_PICU2_INTTYPE4 EQU 0x40004514
    ENDIF
    IF :LNOT::DEF:CYREG_PICU2_INTTYPE5
CYREG_PICU2_INTTYPE5 EQU 0x40004515
    ENDIF
    IF :LNOT::DEF:CYREG_PICU2_INTTYPE6
CYREG_PICU2_INTTYPE6 EQU 0x40004516
    ENDIF
    IF :LNOT::DEF:CYREG_PICU2_INTTYPE7
CYREG_PICU2_INTTYPE7 EQU 0x40004517
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_INTTYPE_PICU3_BASE
CYDEV_PICU_INTTYPE_PICU3_BASE EQU 0x40004518
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_INTTYPE_PICU3_SIZE
CYDEV_PICU_INTTYPE_PICU3_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PICU3_INTTYPE0
CYREG_PICU3_INTTYPE0 EQU 0x40004518
    ENDIF
    IF :LNOT::DEF:CYREG_PICU3_INTTYPE1
CYREG_PICU3_INTTYPE1 EQU 0x40004519
    ENDIF
    IF :LNOT::DEF:CYREG_PICU3_INTTYPE2
CYREG_PICU3_INTTYPE2 EQU 0x4000451a
    ENDIF
    IF :LNOT::DEF:CYREG_PICU3_INTTYPE3
CYREG_PICU3_INTTYPE3 EQU 0x4000451b
    ENDIF
    IF :LNOT::DEF:CYREG_PICU3_INTTYPE4
CYREG_PICU3_INTTYPE4 EQU 0x4000451c
    ENDIF
    IF :LNOT::DEF:CYREG_PICU3_INTTYPE5
CYREG_PICU3_INTTYPE5 EQU 0x4000451d
    ENDIF
    IF :LNOT::DEF:CYREG_PICU3_INTTYPE6
CYREG_PICU3_INTTYPE6 EQU 0x4000451e
    ENDIF
    IF :LNOT::DEF:CYREG_PICU3_INTTYPE7
CYREG_PICU3_INTTYPE7 EQU 0x4000451f
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_INTTYPE_PICU4_BASE
CYDEV_PICU_INTTYPE_PICU4_BASE EQU 0x40004520
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_INTTYPE_PICU4_SIZE
CYDEV_PICU_INTTYPE_PICU4_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PICU4_INTTYPE0
CYREG_PICU4_INTTYPE0 EQU 0x40004520
    ENDIF
    IF :LNOT::DEF:CYREG_PICU4_INTTYPE1
CYREG_PICU4_INTTYPE1 EQU 0x40004521
    ENDIF
    IF :LNOT::DEF:CYREG_PICU4_INTTYPE2
CYREG_PICU4_INTTYPE2 EQU 0x40004522
    ENDIF
    IF :LNOT::DEF:CYREG_PICU4_INTTYPE3
CYREG_PICU4_INTTYPE3 EQU 0x40004523
    ENDIF
    IF :LNOT::DEF:CYREG_PICU4_INTTYPE4
CYREG_PICU4_INTTYPE4 EQU 0x40004524
    ENDIF
    IF :LNOT::DEF:CYREG_PICU4_INTTYPE5
CYREG_PICU4_INTTYPE5 EQU 0x40004525
    ENDIF
    IF :LNOT::DEF:CYREG_PICU4_INTTYPE6
CYREG_PICU4_INTTYPE6 EQU 0x40004526
    ENDIF
    IF :LNOT::DEF:CYREG_PICU4_INTTYPE7
CYREG_PICU4_INTTYPE7 EQU 0x40004527
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_INTTYPE_PICU5_BASE
CYDEV_PICU_INTTYPE_PICU5_BASE EQU 0x40004528
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_INTTYPE_PICU5_SIZE
CYDEV_PICU_INTTYPE_PICU5_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PICU5_INTTYPE0
CYREG_PICU5_INTTYPE0 EQU 0x40004528
    ENDIF
    IF :LNOT::DEF:CYREG_PICU5_INTTYPE1
CYREG_PICU5_INTTYPE1 EQU 0x40004529
    ENDIF
    IF :LNOT::DEF:CYREG_PICU5_INTTYPE2
CYREG_PICU5_INTTYPE2 EQU 0x4000452a
    ENDIF
    IF :LNOT::DEF:CYREG_PICU5_INTTYPE3
CYREG_PICU5_INTTYPE3 EQU 0x4000452b
    ENDIF
    IF :LNOT::DEF:CYREG_PICU5_INTTYPE4
