MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cydevicerv_trm.inc
CYREG_PICU5_INTTYPE4 EQU 0x4000452c
    ENDIF
    IF :LNOT::DEF:CYREG_PICU5_INTTYPE5
CYREG_PICU5_INTTYPE5 EQU 0x4000452d
    ENDIF
    IF :LNOT::DEF:CYREG_PICU5_INTTYPE6
CYREG_PICU5_INTTYPE6 EQU 0x4000452e
    ENDIF
    IF :LNOT::DEF:CYREG_PICU5_INTTYPE7
CYREG_PICU5_INTTYPE7 EQU 0x4000452f
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_INTTYPE_PICU6_BASE
CYDEV_PICU_INTTYPE_PICU6_BASE EQU 0x40004530
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_INTTYPE_PICU6_SIZE
CYDEV_PICU_INTTYPE_PICU6_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PICU6_INTTYPE0
CYREG_PICU6_INTTYPE0 EQU 0x40004530
    ENDIF
    IF :LNOT::DEF:CYREG_PICU6_INTTYPE1
CYREG_PICU6_INTTYPE1 EQU 0x40004531
    ENDIF
    IF :LNOT::DEF:CYREG_PICU6_INTTYPE2
CYREG_PICU6_INTTYPE2 EQU 0x40004532
    ENDIF
    IF :LNOT::DEF:CYREG_PICU6_INTTYPE3
CYREG_PICU6_INTTYPE3 EQU 0x40004533
    ENDIF
    IF :LNOT::DEF:CYREG_PICU6_INTTYPE4
CYREG_PICU6_INTTYPE4 EQU 0x40004534
    ENDIF
    IF :LNOT::DEF:CYREG_PICU6_INTTYPE5
CYREG_PICU6_INTTYPE5 EQU 0x40004535
    ENDIF
    IF :LNOT::DEF:CYREG_PICU6_INTTYPE6
CYREG_PICU6_INTTYPE6 EQU 0x40004536
    ENDIF
    IF :LNOT::DEF:CYREG_PICU6_INTTYPE7
CYREG_PICU6_INTTYPE7 EQU 0x40004537
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_INTTYPE_PICU12_BASE
CYDEV_PICU_INTTYPE_PICU12_BASE EQU 0x40004560
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_INTTYPE_PICU12_SIZE
CYDEV_PICU_INTTYPE_PICU12_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PICU12_INTTYPE0
CYREG_PICU12_INTTYPE0 EQU 0x40004560
    ENDIF
    IF :LNOT::DEF:CYREG_PICU12_INTTYPE1
CYREG_PICU12_INTTYPE1 EQU 0x40004561
    ENDIF
    IF :LNOT::DEF:CYREG_PICU12_INTTYPE2
CYREG_PICU12_INTTYPE2 EQU 0x40004562
    ENDIF
    IF :LNOT::DEF:CYREG_PICU12_INTTYPE3
CYREG_PICU12_INTTYPE3 EQU 0x40004563
    ENDIF
    IF :LNOT::DEF:CYREG_PICU12_INTTYPE4
CYREG_PICU12_INTTYPE4 EQU 0x40004564
    ENDIF
    IF :LNOT::DEF:CYREG_PICU12_INTTYPE5
CYREG_PICU12_INTTYPE5 EQU 0x40004565
    ENDIF
    IF :LNOT::DEF:CYREG_PICU12_INTTYPE6
CYREG_PICU12_INTTYPE6 EQU 0x40004566
    ENDIF
    IF :LNOT::DEF:CYREG_PICU12_INTTYPE7
CYREG_PICU12_INTTYPE7 EQU 0x40004567
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_INTTYPE_PICU15_BASE
CYDEV_PICU_INTTYPE_PICU15_BASE EQU 0x40004578
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_INTTYPE_PICU15_SIZE
CYDEV_PICU_INTTYPE_PICU15_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PICU15_INTTYPE0
CYREG_PICU15_INTTYPE0 EQU 0x40004578
    ENDIF
    IF :LNOT::DEF:CYREG_PICU15_INTTYPE1
CYREG_PICU15_INTTYPE1 EQU 0x40004579
    ENDIF
    IF :LNOT::DEF:CYREG_PICU15_INTTYPE2
CYREG_PICU15_INTTYPE2 EQU 0x4000457a
    ENDIF
    IF :LNOT::DEF:CYREG_PICU15_INTTYPE3
CYREG_PICU15_INTTYPE3 EQU 0x4000457b
    ENDIF
    IF :LNOT::DEF:CYREG_PICU15_INTTYPE4
CYREG_PICU15_INTTYPE4 EQU 0x4000457c
    ENDIF
    IF :LNOT::DEF:CYREG_PICU15_INTTYPE5
CYREG_PICU15_INTTYPE5 EQU 0x4000457d
    ENDIF
    IF :LNOT::DEF:CYREG_PICU15_INTTYPE6
CYREG_PICU15_INTTYPE6 EQU 0x4000457e
    ENDIF
    IF :LNOT::DEF:CYREG_PICU15_INTTYPE7
CYREG_PICU15_INTTYPE7 EQU 0x4000457f
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_STAT_BASE
CYDEV_PICU_STAT_BASE EQU 0x40004580
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_STAT_SIZE
CYDEV_PICU_STAT_SIZE EQU 0x00000010
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_STAT_PICU0_BASE
CYDEV_PICU_STAT_PICU0_BASE EQU 0x40004580
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_STAT_PICU0_SIZE
CYDEV_PICU_STAT_PICU0_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_PICU0_INTSTAT
CYREG_PICU0_INTSTAT EQU 0x40004580
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_STAT_PICU1_BASE
CYDEV_PICU_STAT_PICU1_BASE EQU 0x40004581
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_STAT_PICU1_SIZE
CYDEV_PICU_STAT_PICU1_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_PICU1_INTSTAT
CYREG_PICU1_INTSTAT EQU 0x40004581
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_STAT_PICU2_BASE
CYDEV_PICU_STAT_PICU2_BASE EQU 0x40004582
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_STAT_PICU2_SIZE
CYDEV_PICU_STAT_PICU2_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_PICU2_INTSTAT
CYREG_PICU2_INTSTAT EQU 0x40004582
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_STAT_PICU3_BASE
CYDEV_PICU_STAT_PICU3_BASE EQU 0x40004583
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_STAT_PICU3_SIZE
CYDEV_PICU_STAT_PICU3_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_PICU3_INTSTAT
CYREG_PICU3_INTSTAT EQU 0x40004583
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_STAT_PICU4_BASE
CYDEV_PICU_STAT_PICU4_BASE EQU 0x40004584
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_STAT_PICU4_SIZE
CYDEV_PICU_STAT_PICU4_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_PICU4_INTSTAT
CYREG_PICU4_INTSTAT EQU 0x40004584
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_STAT_PICU5_BASE
CYDEV_PICU_STAT_PICU5_BASE EQU 0x40004585
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_STAT_PICU5_SIZE
CYDEV_PICU_STAT_PICU5_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_PICU5_INTSTAT
CYREG_PICU5_INTSTAT EQU 0x40004585
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_STAT_PICU6_BASE
CYDEV_PICU_STAT_PICU6_BASE EQU 0x40004586
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_STAT_PICU6_SIZE
CYDEV_PICU_STAT_PICU6_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_PICU6_INTSTAT
CYREG_PICU6_INTSTAT EQU 0x40004586
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_STAT_PICU12_BASE
CYDEV_PICU_STAT_PICU12_BASE EQU 0x4000458c
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_STAT_PICU12_SIZE
CYDEV_PICU_STAT_PICU12_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_PICU12_INTSTAT
CYREG_PICU12_INTSTAT EQU 0x4000458c
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_STAT_PICU15_BASE
CYDEV_PICU_STAT_PICU15_BASE EQU 0x4000458f
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_STAT_PICU15_SIZE
CYDEV_PICU_STAT_PICU15_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_PICU15_INTSTAT
CYREG_PICU15_INTSTAT EQU 0x4000458f
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_SNAP_BASE
CYDEV_PICU_SNAP_BASE EQU 0x40004590
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_SNAP_SIZE
CYDEV_PICU_SNAP_SIZE EQU 0x00000010
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_SNAP_PICU0_BASE
CYDEV_PICU_SNAP_PICU0_BASE EQU 0x40004590
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_SNAP_PICU0_SIZE
CYDEV_PICU_SNAP_PICU0_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_PICU0_SNAP
CYREG_PICU0_SNAP EQU 0x40004590
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_SNAP_PICU1_BASE
CYDEV_PICU_SNAP_PICU1_BASE EQU 0x40004591
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_SNAP_PICU1_SIZE
CYDEV_PICU_SNAP_PICU1_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_PICU1_SNAP
CYREG_PICU1_SNAP EQU 0x40004591
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_SNAP_PICU2_BASE
CYDEV_PICU_SNAP_PICU2_BASE EQU 0x40004592
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_SNAP_PICU2_SIZE
CYDEV_PICU_SNAP_PICU2_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_PICU2_SNAP
CYREG_PICU2_SNAP EQU 0x40004592
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_SNAP_PICU3_BASE
CYDEV_PICU_SNAP_PICU3_BASE EQU 0x40004593
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_SNAP_PICU3_SIZE
CYDEV_PICU_SNAP_PICU3_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_PICU3_SNAP
CYREG_PICU3_SNAP EQU 0x40004593
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_SNAP_PICU4_BASE
CYDEV_PICU_SNAP_PICU4_BASE EQU 0x40004594
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_SNAP_PICU4_SIZE
CYDEV_PICU_SNAP_PICU4_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_PICU4_SNAP
CYREG_PICU4_SNAP EQU 0x40004594
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_SNAP_PICU5_BASE
CYDEV_PICU_SNAP_PICU5_BASE EQU 0x40004595
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_SNAP_PICU5_SIZE
CYDEV_PICU_SNAP_PICU5_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_PICU5_SNAP
CYREG_PICU5_SNAP EQU 0x40004595
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_SNAP_PICU6_BASE
CYDEV_PICU_SNAP_PICU6_BASE EQU 0x40004596
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_SNAP_PICU6_SIZE
CYDEV_PICU_SNAP_PICU6_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_PICU6_SNAP
CYREG_PICU6_SNAP EQU 0x40004596
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_SNAP_PICU12_BASE
CYDEV_PICU_SNAP_PICU12_BASE EQU 0x4000459c
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_SNAP_PICU12_SIZE
CYDEV_PICU_SNAP_PICU12_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_PICU12_SNAP
CYREG_PICU12_SNAP EQU 0x4000459c
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_SNAP_PICU15_BASE
CYDEV_PICU_SNAP_PICU15_BASE EQU 0x4000459f
    ENDIF
    IF :LNOT::DEF:CYDEV_PICU_SNAP_PICU15_SIZE
CYDEV_PICU_SNAP_PICU15_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_PICU15_SNAP
CYREG_PICU15_SNAP EQU 0x4000459f
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_BASE
CYDEV_MFGCFG_BASE EQU 0x40004600
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_SIZE
CYDEV_MFGCFG_SIZE EQU 0x000000ed
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_ANAIF_BASE
CYDEV_MFGCFG_ANAIF_BASE EQU 0x40004600
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_ANAIF_SIZE
CYDEV_MFGCFG_ANAIF_SIZE EQU 0x00000028
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_ANAIF_CMP0_BASE
CYDEV_MFGCFG_ANAIF_CMP0_BASE EQU 0x40004600
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_ANAIF_CMP0_SIZE
CYDEV_MFGCFG_ANAIF_CMP0_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_CMP0_TR
CYREG_CMP0_TR EQU 0x40004600
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_ANAIF_CMP1_BASE
CYDEV_MFGCFG_ANAIF_CMP1_BASE EQU 0x40004601
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_ANAIF_CMP1_SIZE
CYDEV_MFGCFG_ANAIF_CMP1_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_CMP1_TR
CYREG_CMP1_TR EQU 0x40004601
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_ANAIF_CMP2_BASE
CYDEV_MFGCFG_ANAIF_CMP2_BASE EQU 0x40004602
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_ANAIF_CMP2_SIZE
CYDEV_MFGCFG_ANAIF_CMP2_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_CMP2_TR
CYREG_CMP2_TR EQU 0x40004602
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_ANAIF_CMP3_BASE
CYDEV_MFGCFG_ANAIF_CMP3_BASE EQU 0x40004603
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_ANAIF_CMP3_SIZE
CYDEV_MFGCFG_ANAIF_CMP3_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_CMP3_TR
CYREG_CMP3_TR EQU 0x40004603
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_ANAIF_DAC0_BASE
CYDEV_MFGCFG_ANAIF_DAC0_BASE EQU 0x40004608
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_ANAIF_DAC0_SIZE
CYDEV_MFGCFG_ANAIF_DAC0_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_DAC0_TR
CYREG_DAC0_TR EQU 0x40004608
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_ANAIF_DAC1_BASE
CYDEV_MFGCFG_ANAIF_DAC1_BASE EQU 0x40004609
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_ANAIF_DAC1_SIZE
CYDEV_MFGCFG_ANAIF_DAC1_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_DAC1_TR
CYREG_DAC1_TR EQU 0x40004609
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_ANAIF_DAC2_BASE
CYDEV_MFGCFG_ANAIF_DAC2_BASE EQU 0x4000460a
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_ANAIF_DAC2_SIZE
CYDEV_MFGCFG_ANAIF_DAC2_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_DAC2_TR
CYREG_DAC2_TR EQU 0x4000460a
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_ANAIF_DAC3_BASE
CYDEV_MFGCFG_ANAIF_DAC3_BASE EQU 0x4000460b
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_ANAIF_DAC3_SIZE
CYDEV_MFGCFG_ANAIF_DAC3_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_DAC3_TR
CYREG_DAC3_TR EQU 0x4000460b
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_ANAIF_NPUMP_DSM_BASE
CYDEV_MFGCFG_ANAIF_NPUMP_DSM_BASE EQU 0x40004610
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_ANAIF_NPUMP_DSM_SIZE
CYDEV_MFGCFG_ANAIF_NPUMP_DSM_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_NPUMP_DSM_TR0
CYREG_NPUMP_DSM_TR0 EQU 0x40004610
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_ANAIF_NPUMP_ABUF_BASE
CYDEV_MFGCFG_ANAIF_NPUMP_ABUF_BASE EQU 0x40004612
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_ANAIF_NPUMP_ABUF_SIZE
CYDEV_MFGCFG_ANAIF_NPUMP_ABUF_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_NPUMP_ABUF_TR0
CYREG_NPUMP_ABUF_TR0 EQU 0x40004612
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_ANAIF_SAR0_BASE
CYDEV_MFGCFG_ANAIF_SAR0_BASE EQU 0x40004614
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_ANAIF_SAR0_SIZE
CYDEV_MFGCFG_ANAIF_SAR0_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_SAR0_TR0
CYREG_SAR0_TR0 EQU 0x40004614
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_ANAIF_SAR1_BASE
CYDEV_MFGCFG_ANAIF_SAR1_BASE EQU 0x40004616
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_ANAIF_SAR1_SIZE
CYDEV_MFGCFG_ANAIF_SAR1_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_SAR1_TR0
CYREG_SAR1_TR0 EQU 0x40004616
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_ANAIF_ABUF0_BASE
CYDEV_MFGCFG_ANAIF_ABUF0_BASE EQU 0x40004620
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_ANAIF_ABUF0_SIZE
CYDEV_MFGCFG_ANAIF_ABUF0_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYREG_ABUF0_TR0
CYREG_ABUF0_TR0 EQU 0x40004620
    ENDIF
    IF :LNOT::DEF:CYREG_ABUF0_TR1
CYREG_ABUF0_TR1 EQU 0x40004621
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_ANAIF_ABUF1_BASE
CYDEV_MFGCFG_ANAIF_ABUF1_BASE EQU 0x40004622
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_ANAIF_ABUF1_SIZE
CYDEV_MFGCFG_ANAIF_ABUF1_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYREG_ABUF1_TR0
CYREG_ABUF1_TR0 EQU 0x40004622
    ENDIF
    IF :LNOT::DEF:CYREG_ABUF1_TR1
CYREG_ABUF1_TR1 EQU 0x40004623
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_ANAIF_ABUF2_BASE
CYDEV_MFGCFG_ANAIF_ABUF2_BASE EQU 0x40004624
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_ANAIF_ABUF2_SIZE
CYDEV_MFGCFG_ANAIF_ABUF2_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYREG_ABUF2_TR0
CYREG_ABUF2_TR0 EQU 0x40004624
    ENDIF
    IF :LNOT::DEF:CYREG_ABUF2_TR1
CYREG_ABUF2_TR1 EQU 0x40004625
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_ANAIF_ABUF3_BASE
CYDEV_MFGCFG_ANAIF_ABUF3_BASE EQU 0x40004626
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_ANAIF_ABUF3_SIZE
CYDEV_MFGCFG_ANAIF_ABUF3_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYREG_ABUF3_TR0
CYREG_ABUF3_TR0 EQU 0x40004626
    ENDIF
    IF :LNOT::DEF:CYREG_ABUF3_TR1
CYREG_ABUF3_TR1 EQU 0x40004627
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_PWRSYS_BASE
CYDEV_MFGCFG_PWRSYS_BASE EQU 0x40004680
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_PWRSYS_SIZE
CYDEV_MFGCFG_PWRSYS_SIZE EQU 0x00000009
    ENDIF
    IF :LNOT::DEF:CYREG_PWRSYS_HIB_TR0
CYREG_PWRSYS_HIB_TR0 EQU 0x40004680
    ENDIF
    IF :LNOT::DEF:CYREG_PWRSYS_HIB_TR1
CYREG_PWRSYS_HIB_TR1 EQU 0x40004681
    ENDIF
    IF :LNOT::DEF:CYREG_PWRSYS_I2C_TR
CYREG_PWRSYS_I2C_TR EQU 0x40004682
    ENDIF
    IF :LNOT::DEF:CYREG_PWRSYS_SLP_TR
CYREG_PWRSYS_SLP_TR EQU 0x40004683
    ENDIF
    IF :LNOT::DEF:CYREG_PWRSYS_BUZZ_TR
CYREG_PWRSYS_BUZZ_TR EQU 0x40004684
    ENDIF
    IF :LNOT::DEF:CYREG_PWRSYS_WAKE_TR0
CYREG_PWRSYS_WAKE_TR0 EQU 0x40004685
    ENDIF
    IF :LNOT::DEF:CYREG_PWRSYS_WAKE_TR1
CYREG_PWRSYS_WAKE_TR1 EQU 0x40004686
    ENDIF
    IF :LNOT::DEF:CYREG_PWRSYS_BREF_TR
CYREG_PWRSYS_BREF_TR EQU 0x40004687
    ENDIF
    IF :LNOT::DEF:CYREG_PWRSYS_BG_TR
CYREG_PWRSYS_BG_TR EQU 0x40004688
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_ILO_BASE
CYDEV_MFGCFG_ILO_BASE EQU 0x40004690
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_ILO_SIZE
CYDEV_MFGCFG_ILO_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYREG_ILO_TR0
CYREG_ILO_TR0 EQU 0x40004690
    ENDIF
    IF :LNOT::DEF:CYREG_ILO_TR1
CYREG_ILO_TR1 EQU 0x40004691
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_X32_BASE
CYDEV_MFGCFG_X32_BASE EQU 0x40004698
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_X32_SIZE
CYDEV_MFGCFG_X32_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_X32_TR
CYREG_X32_TR EQU 0x40004698
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_IMO_BASE
CYDEV_MFGCFG_IMO_BASE EQU 0x400046a0
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_IMO_SIZE
CYDEV_MFGCFG_IMO_SIZE EQU 0x00000005
    ENDIF
    IF :LNOT::DEF:CYREG_IMO_TR0
CYREG_IMO_TR0 EQU 0x400046a0
    ENDIF
    IF :LNOT::DEF:CYREG_IMO_TR1
CYREG_IMO_TR1 EQU 0x400046a1
    ENDIF
    IF :LNOT::DEF:CYREG_IMO_GAIN
CYREG_IMO_GAIN EQU 0x400046a2
    ENDIF
    IF :LNOT::DEF:CYREG_IMO_C36M
CYREG_IMO_C36M EQU 0x400046a3
    ENDIF
    IF :LNOT::DEF:CYREG_IMO_TR2
CYREG_IMO_TR2 EQU 0x400046a4
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_XMHZ_BASE
CYDEV_MFGCFG_XMHZ_BASE EQU 0x400046a8
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_XMHZ_SIZE
CYDEV_MFGCFG_XMHZ_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_XMHZ_TR
CYREG_XMHZ_TR EQU 0x400046a8
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_MLOGIC_BASE
CYDEV_MFGCFG_MLOGIC_BASE EQU 0x400046e0
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_MLOGIC_SIZE
CYDEV_MFGCFG_MLOGIC_SIZE EQU 0x0000000d
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_MLOGIC_DMP_BASE
CYDEV_MFGCFG_MLOGIC_DMP_BASE EQU 0x400046e2
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_MLOGIC_DMP_SIZE
CYDEV_MFGCFG_MLOGIC_DMP_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_MLOGIC_DMP_DMY
CYREG_MLOGIC_DMP_DMY EQU 0x400046e2
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_MLOGIC_SEG_BASE
CYDEV_MFGCFG_MLOGIC_SEG_BASE EQU 0x400046e4
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_MLOGIC_SEG_SIZE
CYDEV_MFGCFG_MLOGIC_SEG_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYREG_MLOGIC_SEG_CR
CYREG_MLOGIC_SEG_CR EQU 0x400046e4
    ENDIF
    IF :LNOT::DEF:CYREG_MLOGIC_SEG_CFG0
CYREG_MLOGIC_SEG_CFG0 EQU 0x400046e5
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_MLOGIC_DBG_BASE
CYDEV_MFGCFG_MLOGIC_DBG_BASE EQU 0x400046e8
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_MLOGIC_DBG_SIZE
CYDEV_MFGCFG_MLOGIC_DBG_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_MLOGIC_DBG_DBE
CYREG_MLOGIC_DBG_DBE EQU 0x400046e8
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_MLOGIC_CPU_BASE
CYDEV_MFGCFG_MLOGIC_CPU_BASE EQU 0x400046ea
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_MLOGIC_CPU_SIZE
CYDEV_MFGCFG_MLOGIC_CPU_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_MLOGIC_CPU_SCR
CYREG_MLOGIC_CPU_SCR EQU 0x400046ea
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_MLOGIC_REV_BASE
CYDEV_MFGCFG_MLOGIC_REV_BASE EQU 0x400046ec
    ENDIF
    IF :LNOT::DEF:CYDEV_MFGCFG_MLOGIC_REV_SIZE
CYDEV_MFGCFG_MLOGIC_REV_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_MLOGIC_REV_ID
CYREG_MLOGIC_REV_ID EQU 0x400046ec
    ENDIF
    IF :LNOT::DEF:CYDEV_RESET_BASE
CYDEV_RESET_BASE EQU 0x400046f0
    ENDIF
    IF :LNOT::DEF:CYDEV_RESET_SIZE
CYDEV_RESET_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYREG_RESET_IPOR_CR0
CYREG_RESET_IPOR_CR0 EQU 0x400046f0
    ENDIF
    IF :LNOT::DEF:CYREG_RESET_IPOR_CR1
CYREG_RESET_IPOR_CR1 EQU 0x400046f1
    ENDIF
    IF :LNOT::DEF:CYREG_RESET_IPOR_CR2
CYREG_RESET_IPOR_CR2 EQU 0x400046f2
    ENDIF
    IF :LNOT::DEF:CYREG_RESET_IPOR_CR3
CYREG_RESET_IPOR_CR3 EQU 0x400046f3
    ENDIF
    IF :LNOT::DEF:CYREG_RESET_CR0
CYREG_RESET_CR0 EQU 0x400046f4
    ENDIF
    IF :LNOT::DEF:CYREG_RESET_CR1
CYREG_RESET_CR1 EQU 0x400046f5
    ENDIF
    IF :LNOT::DEF:CYREG_RESET_CR2
CYREG_RESET_CR2 EQU 0x400046f6
    ENDIF
    IF :LNOT::DEF:CYREG_RESET_CR3
CYREG_RESET_CR3 EQU 0x400046f7
    ENDIF
    IF :LNOT::DEF:CYREG_RESET_SR0
CYREG_RESET_SR0 EQU 0x400046f8
    ENDIF
    IF :LNOT::DEF:CYREG_RESET_SR1
CYREG_RESET_SR1 EQU 0x400046f9
    ENDIF
    IF :LNOT::DEF:CYREG_RESET_SR2
CYREG_RESET_SR2 EQU 0x400046fa
    ENDIF
    IF :LNOT::DEF:CYREG_RESET_TR
CYREG_RESET_TR EQU 0x400046fb
    ENDIF
    IF :LNOT::DEF:CYDEV_SPC_BASE
CYDEV_SPC_BASE EQU 0x40004700
    ENDIF
    IF :LNOT::DEF:CYDEV_SPC_SIZE
CYDEV_SPC_SIZE EQU 0x00000100
    ENDIF
    IF :LNOT::DEF:CYREG_SPC_FM_EE_CR
CYREG_SPC_FM_EE_CR EQU 0x40004700
    ENDIF
    IF :LNOT::DEF:CYREG_SPC_FM_EE_WAKE_CNT
CYREG_SPC_FM_EE_WAKE_CNT EQU 0x40004701
    ENDIF
    IF :LNOT::DEF:CYREG_SPC_EE_SCR
CYREG_SPC_EE_SCR EQU 0x40004702
    ENDIF
    IF :LNOT::DEF:CYREG_SPC_EE_ERR
CYREG_SPC_EE_ERR EQU 0x40004703
    ENDIF
    IF :LNOT::DEF:CYREG_SPC_CPU_DATA
CYREG_SPC_CPU_DATA EQU 0x40004720
    ENDIF
    IF :LNOT::DEF:CYREG_SPC_DMA_DATA
CYREG_SPC_DMA_DATA EQU 0x40004721
    ENDIF
    IF :LNOT::DEF:CYREG_SPC_SR
CYREG_SPC_SR EQU 0x40004722
    ENDIF
    IF :LNOT::DEF:CYREG_SPC_CR
CYREG_SPC_CR EQU 0x40004723
    ENDIF
    IF :LNOT::DEF:CYDEV_SPC_DMM_MAP_BASE
CYDEV_SPC_DMM_MAP_BASE EQU 0x40004780
    ENDIF
    IF :LNOT::DEF:CYDEV_SPC_DMM_MAP_SIZE
CYDEV_SPC_DMM_MAP_SIZE EQU 0x00000080
    ENDIF
    IF :LNOT::DEF:CYREG_SPC_DMM_MAP_SRAM_MBASE
CYREG_SPC_DMM_MAP_SRAM_MBASE EQU 0x40004780
    ENDIF
    IF :LNOT::DEF:CYREG_SPC_DMM_MAP_SRAM_MSIZE
CYREG_SPC_DMM_MAP_SRAM_MSIZE EQU 0x00000080
    ENDIF
    IF :LNOT::DEF:CYDEV_CACHE_BASE
CYDEV_CACHE_BASE EQU 0x40004800
    ENDIF
    IF :LNOT::DEF:CYDEV_CACHE_SIZE
CYDEV_CACHE_SIZE EQU 0x0000009c
    ENDIF
    IF :LNOT::DEF:CYREG_CACHE_CC_CTL
CYREG_CACHE_CC_CTL EQU 0x40004800
    ENDIF
    IF :LNOT::DEF:CYREG_CACHE_ECC_CORR
CYREG_CACHE_ECC_CORR EQU 0x40004880
    ENDIF
    IF :LNOT::DEF:CYREG_CACHE_ECC_ERR
CYREG_CACHE_ECC_ERR EQU 0x40004888
    ENDIF
    IF :LNOT::DEF:CYREG_CACHE_FLASH_ERR
CYREG_CACHE_FLASH_ERR EQU 0x40004890
    ENDIF
    IF :LNOT::DEF:CYREG_CACHE_HITMISS
CYREG_CACHE_HITMISS EQU 0x40004898
    ENDIF
    IF :LNOT::DEF:CYDEV_I2C_BASE
CYDEV_I2C_BASE EQU 0x40004900
    ENDIF
    IF :LNOT::DEF:CYDEV_I2C_SIZE
CYDEV_I2C_SIZE EQU 0x000000dc
    ENDIF
    IF :LNOT::DEF:CYREG_I2C_XCFG
CYREG_I2C_XCFG EQU 0x400049c8
    ENDIF
    IF :LNOT::DEF:CYREG_I2C_ADR
CYREG_I2C_ADR EQU 0x400049ca
    ENDIF
    IF :LNOT::DEF:CYREG_I2C_CFG
CYREG_I2C_CFG EQU 0x400049d6
    ENDIF
    IF :LNOT::DEF:CYREG_I2C_CSR
CYREG_I2C_CSR EQU 0x400049d7
    ENDIF
    IF :LNOT::DEF:CYREG_I2C_D
CYREG_I2C_D EQU 0x400049d8
    ENDIF
    IF :LNOT::DEF:CYREG_I2C_MCSR
CYREG_I2C_MCSR EQU 0x400049d9
    ENDIF
    IF :LNOT::DEF:CYREG_I2C_CLK_DIV
CYREG_I2C_CLK_DIV EQU 0x400049db
    ENDIF
    IF :LNOT::DEF:CYDEV_DEC_BASE
CYDEV_DEC_BASE EQU 0x40004e00
    ENDIF
    IF :LNOT::DEF:CYDEV_DEC_SIZE
CYDEV_DEC_SIZE EQU 0x00000015
    ENDIF
    IF :LNOT::DEF:CYREG_DEC_CR
CYREG_DEC_CR EQU 0x40004e00
    ENDIF
    IF :LNOT::DEF:CYREG_DEC_SR
CYREG_DEC_SR EQU 0x40004e01
    ENDIF
    IF :LNOT::DEF:CYREG_DEC_SHIFT1
CYREG_DEC_SHIFT1 EQU 0x40004e02
    ENDIF
    IF :LNOT::DEF:CYREG_DEC_SHIFT2
CYREG_DEC_SHIFT2 EQU 0x40004e03
    ENDIF
    IF :LNOT::DEF:CYREG_DEC_DR2
CYREG_DEC_DR2 EQU 0x40004e04
    ENDIF
    IF :LNOT::DEF:CYREG_DEC_DR2H
CYREG_DEC_DR2H EQU 0x40004e05
    ENDIF
    IF :LNOT::DEF:CYREG_DEC_DR1
CYREG_DEC_DR1 EQU 0x40004e06
    ENDIF
    IF :LNOT::DEF:CYREG_DEC_OCOR
CYREG_DEC_OCOR EQU 0x40004e08
    ENDIF
    IF :LNOT::DEF:CYREG_DEC_OCORM
CYREG_DEC_OCORM EQU 0x40004e09
    ENDIF
    IF :LNOT::DEF:CYREG_DEC_OCORH
CYREG_DEC_OCORH EQU 0x40004e0a
    ENDIF
    IF :LNOT::DEF:CYREG_DEC_GCOR
CYREG_DEC_GCOR EQU 0x40004e0c
    ENDIF
    IF :LNOT::DEF:CYREG_DEC_GCORH
CYREG_DEC_GCORH EQU 0x40004e0d
    ENDIF
    IF :LNOT::DEF:CYREG_DEC_GVAL
CYREG_DEC_GVAL EQU 0x40004e0e
    ENDIF
    IF :LNOT::DEF:CYREG_DEC_OUTSAMP
CYREG_DEC_OUTSAMP EQU 0x40004e10
    ENDIF
    IF :LNOT::DEF:CYREG_DEC_OUTSAMPM
CYREG_DEC_OUTSAMPM EQU 0x40004e11
    ENDIF
    IF :LNOT::DEF:CYREG_DEC_OUTSAMPH
CYREG_DEC_OUTSAMPH EQU 0x40004e12
    ENDIF
    IF :LNOT::DEF:CYREG_DEC_OUTSAMPS
CYREG_DEC_OUTSAMPS EQU 0x40004e13
    ENDIF
    IF :LNOT::DEF:CYREG_DEC_COHER
CYREG_DEC_COHER EQU 0x40004e14
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR0_BASE
CYDEV_TMR0_BASE EQU 0x40004f00
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR0_SIZE
CYDEV_TMR0_SIZE EQU 0x0000000b
    ENDIF
    IF :LNOT::DEF:CYREG_TMR0_CFG0
CYREG_TMR0_CFG0 EQU 0x40004f00
    ENDIF
    IF :LNOT::DEF:CYREG_TMR0_CFG1
CYREG_TMR0_CFG1 EQU 0x40004f01
    ENDIF
    IF :LNOT::DEF:CYREG_TMR0_PER0
CYREG_TMR0_PER0 EQU 0x40004f02
    ENDIF
    IF :LNOT::DEF:CYREG_TMR0_PER1
CYREG_TMR0_PER1 EQU 0x40004f03
    ENDIF
    IF :LNOT::DEF:CYREG_TMR0_CNT_CMP0
CYREG_TMR0_CNT_CMP0 EQU 0x40004f04
    ENDIF
    IF :LNOT::DEF:CYREG_TMR0_CNT_CMP1
CYREG_TMR0_CNT_CMP1 EQU 0x40004f05
    ENDIF
    IF :LNOT::DEF:CYREG_TMR0_CAP0
CYREG_TMR0_CAP0 EQU 0x40004f06
    ENDIF
    IF :LNOT::DEF:CYREG_TMR0_CAP1
CYREG_TMR0_CAP1 EQU 0x40004f07
    ENDIF
    IF :LNOT::DEF:CYREG_TMR0_SR0
CYREG_TMR0_SR0 EQU 0x40004f08
