MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cydevicerv_trm.inc
    ENDIF
    IF :LNOT::DEF:CYREG_TMR0_RT0
CYREG_TMR0_RT0 EQU 0x40004f09
    ENDIF
    IF :LNOT::DEF:CYREG_TMR0_RT1
CYREG_TMR0_RT1 EQU 0x40004f0a
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR1_BASE
CYDEV_TMR1_BASE EQU 0x40004f0c
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR1_SIZE
CYDEV_TMR1_SIZE EQU 0x0000000b
    ENDIF
    IF :LNOT::DEF:CYREG_TMR1_CFG0
CYREG_TMR1_CFG0 EQU 0x40004f0c
    ENDIF
    IF :LNOT::DEF:CYREG_TMR1_CFG1
CYREG_TMR1_CFG1 EQU 0x40004f0d
    ENDIF
    IF :LNOT::DEF:CYREG_TMR1_PER0
CYREG_TMR1_PER0 EQU 0x40004f0e
    ENDIF
    IF :LNOT::DEF:CYREG_TMR1_PER1
CYREG_TMR1_PER1 EQU 0x40004f0f
    ENDIF
    IF :LNOT::DEF:CYREG_TMR1_CNT_CMP0
CYREG_TMR1_CNT_CMP0 EQU 0x40004f10
    ENDIF
    IF :LNOT::DEF:CYREG_TMR1_CNT_CMP1
CYREG_TMR1_CNT_CMP1 EQU 0x40004f11
    ENDIF
    IF :LNOT::DEF:CYREG_TMR1_CAP0
CYREG_TMR1_CAP0 EQU 0x40004f12
    ENDIF
    IF :LNOT::DEF:CYREG_TMR1_CAP1
CYREG_TMR1_CAP1 EQU 0x40004f13
    ENDIF
    IF :LNOT::DEF:CYREG_TMR1_SR0
CYREG_TMR1_SR0 EQU 0x40004f14
    ENDIF
    IF :LNOT::DEF:CYREG_TMR1_RT0
CYREG_TMR1_RT0 EQU 0x40004f15
    ENDIF
    IF :LNOT::DEF:CYREG_TMR1_RT1
CYREG_TMR1_RT1 EQU 0x40004f16
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR2_BASE
CYDEV_TMR2_BASE EQU 0x40004f18
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR2_SIZE
CYDEV_TMR2_SIZE EQU 0x0000000b
    ENDIF
    IF :LNOT::DEF:CYREG_TMR2_CFG0
CYREG_TMR2_CFG0 EQU 0x40004f18
    ENDIF
    IF :LNOT::DEF:CYREG_TMR2_CFG1
CYREG_TMR2_CFG1 EQU 0x40004f19
    ENDIF
    IF :LNOT::DEF:CYREG_TMR2_PER0
CYREG_TMR2_PER0 EQU 0x40004f1a
    ENDIF
    IF :LNOT::DEF:CYREG_TMR2_PER1
CYREG_TMR2_PER1 EQU 0x40004f1b
    ENDIF
    IF :LNOT::DEF:CYREG_TMR2_CNT_CMP0
CYREG_TMR2_CNT_CMP0 EQU 0x40004f1c
    ENDIF
    IF :LNOT::DEF:CYREG_TMR2_CNT_CMP1
CYREG_TMR2_CNT_CMP1 EQU 0x40004f1d
    ENDIF
    IF :LNOT::DEF:CYREG_TMR2_CAP0
CYREG_TMR2_CAP0 EQU 0x40004f1e
    ENDIF
    IF :LNOT::DEF:CYREG_TMR2_CAP1
CYREG_TMR2_CAP1 EQU 0x40004f1f
    ENDIF
    IF :LNOT::DEF:CYREG_TMR2_SR0
CYREG_TMR2_SR0 EQU 0x40004f20
    ENDIF
    IF :LNOT::DEF:CYREG_TMR2_RT0
CYREG_TMR2_RT0 EQU 0x40004f21
    ENDIF
    IF :LNOT::DEF:CYREG_TMR2_RT1
CYREG_TMR2_RT1 EQU 0x40004f22
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR3_BASE
CYDEV_TMR3_BASE EQU 0x40004f24
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR3_SIZE
CYDEV_TMR3_SIZE EQU 0x0000000b
    ENDIF
    IF :LNOT::DEF:CYREG_TMR3_CFG0
CYREG_TMR3_CFG0 EQU 0x40004f24
    ENDIF
    IF :LNOT::DEF:CYREG_TMR3_CFG1
CYREG_TMR3_CFG1 EQU 0x40004f25
    ENDIF
    IF :LNOT::DEF:CYREG_TMR3_PER0
CYREG_TMR3_PER0 EQU 0x40004f26
    ENDIF
    IF :LNOT::DEF:CYREG_TMR3_PER1
CYREG_TMR3_PER1 EQU 0x40004f27
    ENDIF
    IF :LNOT::DEF:CYREG_TMR3_CNT_CMP0
CYREG_TMR3_CNT_CMP0 EQU 0x40004f28
    ENDIF
    IF :LNOT::DEF:CYREG_TMR3_CNT_CMP1
CYREG_TMR3_CNT_CMP1 EQU 0x40004f29
    ENDIF
    IF :LNOT::DEF:CYREG_TMR3_CAP0
CYREG_TMR3_CAP0 EQU 0x40004f2a
    ENDIF
    IF :LNOT::DEF:CYREG_TMR3_CAP1
CYREG_TMR3_CAP1 EQU 0x40004f2b
    ENDIF
    IF :LNOT::DEF:CYREG_TMR3_SR0
CYREG_TMR3_SR0 EQU 0x40004f2c
    ENDIF
    IF :LNOT::DEF:CYREG_TMR3_RT0
CYREG_TMR3_RT0 EQU 0x40004f2d
    ENDIF
    IF :LNOT::DEF:CYREG_TMR3_RT1
CYREG_TMR3_RT1 EQU 0x40004f2e
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_BASE
CYDEV_IO_BASE EQU 0x40005000
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_SIZE
CYDEV_IO_SIZE EQU 0x00000200
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_BASE
CYDEV_IO_PC_BASE EQU 0x40005000
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_SIZE
CYDEV_IO_PC_SIZE EQU 0x00000080
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT0_BASE
CYDEV_IO_PC_PRT0_BASE EQU 0x40005000
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT0_SIZE
CYDEV_IO_PC_PRT0_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PRT0_PC0
CYREG_PRT0_PC0 EQU 0x40005000
    ENDIF
    IF :LNOT::DEF:CYREG_PRT0_PC1
CYREG_PRT0_PC1 EQU 0x40005001
    ENDIF
    IF :LNOT::DEF:CYREG_PRT0_PC2
CYREG_PRT0_PC2 EQU 0x40005002
    ENDIF
    IF :LNOT::DEF:CYREG_PRT0_PC3
CYREG_PRT0_PC3 EQU 0x40005003
    ENDIF
    IF :LNOT::DEF:CYREG_PRT0_PC4
CYREG_PRT0_PC4 EQU 0x40005004
    ENDIF
    IF :LNOT::DEF:CYREG_PRT0_PC5
CYREG_PRT0_PC5 EQU 0x40005005
    ENDIF
    IF :LNOT::DEF:CYREG_PRT0_PC6
CYREG_PRT0_PC6 EQU 0x40005006
    ENDIF
    IF :LNOT::DEF:CYREG_PRT0_PC7
CYREG_PRT0_PC7 EQU 0x40005007
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT1_BASE
CYDEV_IO_PC_PRT1_BASE EQU 0x40005008
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT1_SIZE
CYDEV_IO_PC_PRT1_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PRT1_PC0
CYREG_PRT1_PC0 EQU 0x40005008
    ENDIF
    IF :LNOT::DEF:CYREG_PRT1_PC1
CYREG_PRT1_PC1 EQU 0x40005009
    ENDIF
    IF :LNOT::DEF:CYREG_PRT1_PC2
CYREG_PRT1_PC2 EQU 0x4000500a
    ENDIF
    IF :LNOT::DEF:CYREG_PRT1_PC3
CYREG_PRT1_PC3 EQU 0x4000500b
    ENDIF
    IF :LNOT::DEF:CYREG_PRT1_PC4
CYREG_PRT1_PC4 EQU 0x4000500c
    ENDIF
    IF :LNOT::DEF:CYREG_PRT1_PC5
CYREG_PRT1_PC5 EQU 0x4000500d
    ENDIF
    IF :LNOT::DEF:CYREG_PRT1_PC6
CYREG_PRT1_PC6 EQU 0x4000500e
    ENDIF
    IF :LNOT::DEF:CYREG_PRT1_PC7
CYREG_PRT1_PC7 EQU 0x4000500f
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT2_BASE
CYDEV_IO_PC_PRT2_BASE EQU 0x40005010
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT2_SIZE
CYDEV_IO_PC_PRT2_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PRT2_PC0
CYREG_PRT2_PC0 EQU 0x40005010
    ENDIF
    IF :LNOT::DEF:CYREG_PRT2_PC1
CYREG_PRT2_PC1 EQU 0x40005011
    ENDIF
    IF :LNOT::DEF:CYREG_PRT2_PC2
CYREG_PRT2_PC2 EQU 0x40005012
    ENDIF
    IF :LNOT::DEF:CYREG_PRT2_PC3
CYREG_PRT2_PC3 EQU 0x40005013
    ENDIF
    IF :LNOT::DEF:CYREG_PRT2_PC4
CYREG_PRT2_PC4 EQU 0x40005014
    ENDIF
    IF :LNOT::DEF:CYREG_PRT2_PC5
CYREG_PRT2_PC5 EQU 0x40005015
    ENDIF
    IF :LNOT::DEF:CYREG_PRT2_PC6
CYREG_PRT2_PC6 EQU 0x40005016
    ENDIF
    IF :LNOT::DEF:CYREG_PRT2_PC7
CYREG_PRT2_PC7 EQU 0x40005017
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT3_BASE
CYDEV_IO_PC_PRT3_BASE EQU 0x40005018
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT3_SIZE
CYDEV_IO_PC_PRT3_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PRT3_PC0
CYREG_PRT3_PC0 EQU 0x40005018
    ENDIF
    IF :LNOT::DEF:CYREG_PRT3_PC1
CYREG_PRT3_PC1 EQU 0x40005019
    ENDIF
    IF :LNOT::DEF:CYREG_PRT3_PC2
CYREG_PRT3_PC2 EQU 0x4000501a
    ENDIF
    IF :LNOT::DEF:CYREG_PRT3_PC3
CYREG_PRT3_PC3 EQU 0x4000501b
    ENDIF
    IF :LNOT::DEF:CYREG_PRT3_PC4
CYREG_PRT3_PC4 EQU 0x4000501c
    ENDIF
    IF :LNOT::DEF:CYREG_PRT3_PC5
CYREG_PRT3_PC5 EQU 0x4000501d
    ENDIF
    IF :LNOT::DEF:CYREG_PRT3_PC6
CYREG_PRT3_PC6 EQU 0x4000501e
    ENDIF
    IF :LNOT::DEF:CYREG_PRT3_PC7
CYREG_PRT3_PC7 EQU 0x4000501f
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT4_BASE
CYDEV_IO_PC_PRT4_BASE EQU 0x40005020
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT4_SIZE
CYDEV_IO_PC_PRT4_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PRT4_PC0
CYREG_PRT4_PC0 EQU 0x40005020
    ENDIF
    IF :LNOT::DEF:CYREG_PRT4_PC1
CYREG_PRT4_PC1 EQU 0x40005021
    ENDIF
    IF :LNOT::DEF:CYREG_PRT4_PC2
CYREG_PRT4_PC2 EQU 0x40005022
    ENDIF
    IF :LNOT::DEF:CYREG_PRT4_PC3
CYREG_PRT4_PC3 EQU 0x40005023
    ENDIF
    IF :LNOT::DEF:CYREG_PRT4_PC4
CYREG_PRT4_PC4 EQU 0x40005024
    ENDIF
    IF :LNOT::DEF:CYREG_PRT4_PC5
CYREG_PRT4_PC5 EQU 0x40005025
    ENDIF
    IF :LNOT::DEF:CYREG_PRT4_PC6
CYREG_PRT4_PC6 EQU 0x40005026
    ENDIF
    IF :LNOT::DEF:CYREG_PRT4_PC7
CYREG_PRT4_PC7 EQU 0x40005027
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT5_BASE
CYDEV_IO_PC_PRT5_BASE EQU 0x40005028
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT5_SIZE
CYDEV_IO_PC_PRT5_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PRT5_PC0
CYREG_PRT5_PC0 EQU 0x40005028
    ENDIF
    IF :LNOT::DEF:CYREG_PRT5_PC1
CYREG_PRT5_PC1 EQU 0x40005029
    ENDIF
    IF :LNOT::DEF:CYREG_PRT5_PC2
CYREG_PRT5_PC2 EQU 0x4000502a
    ENDIF
    IF :LNOT::DEF:CYREG_PRT5_PC3
CYREG_PRT5_PC3 EQU 0x4000502b
    ENDIF
    IF :LNOT::DEF:CYREG_PRT5_PC4
CYREG_PRT5_PC4 EQU 0x4000502c
    ENDIF
    IF :LNOT::DEF:CYREG_PRT5_PC5
CYREG_PRT5_PC5 EQU 0x4000502d
    ENDIF
    IF :LNOT::DEF:CYREG_PRT5_PC6
CYREG_PRT5_PC6 EQU 0x4000502e
    ENDIF
    IF :LNOT::DEF:CYREG_PRT5_PC7
CYREG_PRT5_PC7 EQU 0x4000502f
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT6_BASE
CYDEV_IO_PC_PRT6_BASE EQU 0x40005030
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT6_SIZE
CYDEV_IO_PC_PRT6_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PRT6_PC0
CYREG_PRT6_PC0 EQU 0x40005030
    ENDIF
    IF :LNOT::DEF:CYREG_PRT6_PC1
CYREG_PRT6_PC1 EQU 0x40005031
    ENDIF
    IF :LNOT::DEF:CYREG_PRT6_PC2
CYREG_PRT6_PC2 EQU 0x40005032
    ENDIF
    IF :LNOT::DEF:CYREG_PRT6_PC3
CYREG_PRT6_PC3 EQU 0x40005033
    ENDIF
    IF :LNOT::DEF:CYREG_PRT6_PC4
CYREG_PRT6_PC4 EQU 0x40005034
    ENDIF
    IF :LNOT::DEF:CYREG_PRT6_PC5
CYREG_PRT6_PC5 EQU 0x40005035
    ENDIF
    IF :LNOT::DEF:CYREG_PRT6_PC6
CYREG_PRT6_PC6 EQU 0x40005036
    ENDIF
    IF :LNOT::DEF:CYREG_PRT6_PC7
CYREG_PRT6_PC7 EQU 0x40005037
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT12_BASE
CYDEV_IO_PC_PRT12_BASE EQU 0x40005060
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT12_SIZE
CYDEV_IO_PC_PRT12_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PRT12_PC0
CYREG_PRT12_PC0 EQU 0x40005060
    ENDIF
    IF :LNOT::DEF:CYREG_PRT12_PC1
CYREG_PRT12_PC1 EQU 0x40005061
    ENDIF
    IF :LNOT::DEF:CYREG_PRT12_PC2
CYREG_PRT12_PC2 EQU 0x40005062
    ENDIF
    IF :LNOT::DEF:CYREG_PRT12_PC3
CYREG_PRT12_PC3 EQU 0x40005063
    ENDIF
    IF :LNOT::DEF:CYREG_PRT12_PC4
CYREG_PRT12_PC4 EQU 0x40005064
    ENDIF
    IF :LNOT::DEF:CYREG_PRT12_PC5
CYREG_PRT12_PC5 EQU 0x40005065
    ENDIF
    IF :LNOT::DEF:CYREG_PRT12_PC6
CYREG_PRT12_PC6 EQU 0x40005066
    ENDIF
    IF :LNOT::DEF:CYREG_PRT12_PC7
CYREG_PRT12_PC7 EQU 0x40005067
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT15_BASE
CYDEV_IO_PC_PRT15_BASE EQU 0x40005078
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT15_SIZE
CYDEV_IO_PC_PRT15_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PRT15_PC0
CYREG_PRT15_PC0 EQU 0x40005078
    ENDIF
    IF :LNOT::DEF:CYREG_PRT15_PC1
CYREG_PRT15_PC1 EQU 0x40005079
    ENDIF
    IF :LNOT::DEF:CYREG_PRT15_PC2
CYREG_PRT15_PC2 EQU 0x4000507a
    ENDIF
    IF :LNOT::DEF:CYREG_PRT15_PC3
CYREG_PRT15_PC3 EQU 0x4000507b
    ENDIF
    IF :LNOT::DEF:CYREG_PRT15_PC4
CYREG_PRT15_PC4 EQU 0x4000507c
    ENDIF
    IF :LNOT::DEF:CYREG_PRT15_PC5
CYREG_PRT15_PC5 EQU 0x4000507d
    ENDIF
    IF :LNOT::DEF:CYREG_PRT15_PC6
CYREG_PRT15_PC6 EQU 0x4000507e
    ENDIF
    IF :LNOT::DEF:CYREG_PRT15_PC7
CYREG_PRT15_PC7 EQU 0x4000507f
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_DR_BASE
CYDEV_IO_DR_BASE EQU 0x40005080
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_DR_SIZE
CYDEV_IO_DR_SIZE EQU 0x00000010
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_DR_PRT0_BASE
CYDEV_IO_DR_PRT0_BASE EQU 0x40005080
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_DR_PRT0_SIZE
CYDEV_IO_DR_PRT0_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_PRT0_DR_ALIAS
CYREG_PRT0_DR_ALIAS EQU 0x40005080
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_DR_PRT1_BASE
CYDEV_IO_DR_PRT1_BASE EQU 0x40005081
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_DR_PRT1_SIZE
CYDEV_IO_DR_PRT1_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_PRT1_DR_ALIAS
CYREG_PRT1_DR_ALIAS EQU 0x40005081
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_DR_PRT2_BASE
CYDEV_IO_DR_PRT2_BASE EQU 0x40005082
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_DR_PRT2_SIZE
CYDEV_IO_DR_PRT2_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_PRT2_DR_ALIAS
CYREG_PRT2_DR_ALIAS EQU 0x40005082
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_DR_PRT3_BASE
CYDEV_IO_DR_PRT3_BASE EQU 0x40005083
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_DR_PRT3_SIZE
CYDEV_IO_DR_PRT3_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_PRT3_DR_ALIAS
CYREG_PRT3_DR_ALIAS EQU 0x40005083
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_DR_PRT4_BASE
CYDEV_IO_DR_PRT4_BASE EQU 0x40005084
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_DR_PRT4_SIZE
CYDEV_IO_DR_PRT4_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_PRT4_DR_ALIAS
CYREG_PRT4_DR_ALIAS EQU 0x40005084
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_DR_PRT5_BASE
CYDEV_IO_DR_PRT5_BASE EQU 0x40005085
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_DR_PRT5_SIZE
CYDEV_IO_DR_PRT5_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_PRT5_DR_ALIAS
CYREG_PRT5_DR_ALIAS EQU 0x40005085
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_DR_PRT6_BASE
CYDEV_IO_DR_PRT6_BASE EQU 0x40005086
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_DR_PRT6_SIZE
CYDEV_IO_DR_PRT6_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_PRT6_DR_ALIAS
CYREG_PRT6_DR_ALIAS EQU 0x40005086
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_DR_PRT12_BASE
CYDEV_IO_DR_PRT12_BASE EQU 0x4000508c
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_DR_PRT12_SIZE
CYDEV_IO_DR_PRT12_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_PRT12_DR_ALIAS
CYREG_PRT12_DR_ALIAS EQU 0x4000508c
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_DR_PRT15_BASE
CYDEV_IO_DR_PRT15_BASE EQU 0x4000508f
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_DR_PRT15_SIZE
CYDEV_IO_DR_PRT15_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_PRT15_DR_ALIAS
CYREG_PRT15_DR_ALIAS EQU 0x4000508f
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PS_BASE
CYDEV_IO_PS_BASE EQU 0x40005090
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PS_SIZE
CYDEV_IO_PS_SIZE EQU 0x00000010
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PS_PRT0_BASE
CYDEV_IO_PS_PRT0_BASE EQU 0x40005090
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PS_PRT0_SIZE
CYDEV_IO_PS_PRT0_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_PRT0_PS_ALIAS
CYREG_PRT0_PS_ALIAS EQU 0x40005090
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PS_PRT1_BASE
CYDEV_IO_PS_PRT1_BASE EQU 0x40005091
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PS_PRT1_SIZE
CYDEV_IO_PS_PRT1_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_PRT1_PS_ALIAS
CYREG_PRT1_PS_ALIAS EQU 0x40005091
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PS_PRT2_BASE
CYDEV_IO_PS_PRT2_BASE EQU 0x40005092
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PS_PRT2_SIZE
CYDEV_IO_PS_PRT2_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_PRT2_PS_ALIAS
CYREG_PRT2_PS_ALIAS EQU 0x40005092
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PS_PRT3_BASE
CYDEV_IO_PS_PRT3_BASE EQU 0x40005093
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PS_PRT3_SIZE
CYDEV_IO_PS_PRT3_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_PRT3_PS_ALIAS
CYREG_PRT3_PS_ALIAS EQU 0x40005093
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PS_PRT4_BASE
CYDEV_IO_PS_PRT4_BASE EQU 0x40005094
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PS_PRT4_SIZE
CYDEV_IO_PS_PRT4_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_PRT4_PS_ALIAS
CYREG_PRT4_PS_ALIAS EQU 0x40005094
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PS_PRT5_BASE
CYDEV_IO_PS_PRT5_BASE EQU 0x40005095
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PS_PRT5_SIZE
CYDEV_IO_PS_PRT5_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_PRT5_PS_ALIAS
CYREG_PRT5_PS_ALIAS EQU 0x40005095
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PS_PRT6_BASE
CYDEV_IO_PS_PRT6_BASE EQU 0x40005096
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PS_PRT6_SIZE
CYDEV_IO_PS_PRT6_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_PRT6_PS_ALIAS
CYREG_PRT6_PS_ALIAS EQU 0x40005096
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PS_PRT12_BASE
CYDEV_IO_PS_PRT12_BASE EQU 0x4000509c
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PS_PRT12_SIZE
CYDEV_IO_PS_PRT12_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_PRT12_PS_ALIAS
CYREG_PRT12_PS_ALIAS EQU 0x4000509c
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PS_PRT15_BASE
CYDEV_IO_PS_PRT15_BASE EQU 0x4000509f
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PS_PRT15_SIZE
CYDEV_IO_PS_PRT15_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_PRT15_PS_ALIAS
CYREG_PRT15_PS_ALIAS EQU 0x4000509f
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_BASE
CYDEV_IO_PRT_BASE EQU 0x40005100
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_SIZE
CYDEV_IO_PRT_SIZE EQU 0x00000100
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT0_BASE
CYDEV_IO_PRT_PRT0_BASE EQU 0x40005100
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT0_SIZE
CYDEV_IO_PRT_PRT0_SIZE EQU 0x00000010
    ENDIF
    IF :LNOT::DEF:CYREG_PRT0_DR
CYREG_PRT0_DR EQU 0x40005100
    ENDIF
    IF :LNOT::DEF:CYREG_PRT0_PS
CYREG_PRT0_PS EQU 0x40005101
    ENDIF
    IF :LNOT::DEF:CYREG_PRT0_DM0
CYREG_PRT0_DM0 EQU 0x40005102
    ENDIF
    IF :LNOT::DEF:CYREG_PRT0_DM1
CYREG_PRT0_DM1 EQU 0x40005103
    ENDIF
    IF :LNOT::DEF:CYREG_PRT0_DM2
CYREG_PRT0_DM2 EQU 0x40005104
    ENDIF
    IF :LNOT::DEF:CYREG_PRT0_SLW
CYREG_PRT0_SLW EQU 0x40005105
    ENDIF
    IF :LNOT::DEF:CYREG_PRT0_BYP
CYREG_PRT0_BYP EQU 0x40005106
    ENDIF
    IF :LNOT::DEF:CYREG_PRT0_BIE
CYREG_PRT0_BIE EQU 0x40005107
    ENDIF
    IF :LNOT::DEF:CYREG_PRT0_INP_DIS
CYREG_PRT0_INP_DIS EQU 0x40005108
    ENDIF
    IF :LNOT::DEF:CYREG_PRT0_CTL
CYREG_PRT0_CTL EQU 0x40005109
    ENDIF
    IF :LNOT::DEF:CYREG_PRT0_PRT
CYREG_PRT0_PRT EQU 0x4000510a
    ENDIF
    IF :LNOT::DEF:CYREG_PRT0_BIT_MASK
CYREG_PRT0_BIT_MASK EQU 0x4000510b
    ENDIF
    IF :LNOT::DEF:CYREG_PRT0_AMUX
CYREG_PRT0_AMUX EQU 0x4000510c
    ENDIF
    IF :LNOT::DEF:CYREG_PRT0_AG
CYREG_PRT0_AG EQU 0x4000510d
    ENDIF
    IF :LNOT::DEF:CYREG_PRT0_LCD_COM_SEG
CYREG_PRT0_LCD_COM_SEG EQU 0x4000510e
    ENDIF
    IF :LNOT::DEF:CYREG_PRT0_LCD_EN
CYREG_PRT0_LCD_EN EQU 0x4000510f
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT1_BASE
CYDEV_IO_PRT_PRT1_BASE EQU 0x40005110
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT1_SIZE
CYDEV_IO_PRT_PRT1_SIZE EQU 0x00000010
    ENDIF
    IF :LNOT::DEF:CYREG_PRT1_DR
CYREG_PRT1_DR EQU 0x40005110
    ENDIF
    IF :LNOT::DEF:CYREG_PRT1_PS
CYREG_PRT1_PS EQU 0x40005111
    ENDIF
    IF :LNOT::DEF:CYREG_PRT1_DM0
CYREG_PRT1_DM0 EQU 0x40005112
    ENDIF
    IF :LNOT::DEF:CYREG_PRT1_DM1
CYREG_PRT1_DM1 EQU 0x40005113
    ENDIF
    IF :LNOT::DEF:CYREG_PRT1_DM2
CYREG_PRT1_DM2 EQU 0x40005114
    ENDIF
    IF :LNOT::DEF:CYREG_PRT1_SLW
CYREG_PRT1_SLW EQU 0x40005115
    ENDIF
    IF :LNOT::DEF:CYREG_PRT1_BYP
CYREG_PRT1_BYP EQU 0x40005116
    ENDIF
    IF :LNOT::DEF:CYREG_PRT1_BIE
CYREG_PRT1_BIE EQU 0x40005117
    ENDIF
    IF :LNOT::DEF:CYREG_PRT1_INP_DIS
CYREG_PRT1_INP_DIS EQU 0x40005118
    ENDIF
    IF :LNOT::DEF:CYREG_PRT1_CTL
CYREG_PRT1_CTL EQU 0x40005119
    ENDIF
    IF :LNOT::DEF:CYREG_PRT1_PRT
CYREG_PRT1_PRT EQU 0x4000511a
    ENDIF
    IF :LNOT::DEF:CYREG_PRT1_BIT_MASK
CYREG_PRT1_BIT_MASK EQU 0x4000511b
    ENDIF
    IF :LNOT::DEF:CYREG_PRT1_AMUX
CYREG_PRT1_AMUX EQU 0x4000511c
    ENDIF
    IF :LNOT::DEF:CYREG_PRT1_AG
CYREG_PRT1_AG EQU 0x4000511d
    ENDIF
    IF :LNOT::DEF:CYREG_PRT1_LCD_COM_SEG
CYREG_PRT1_LCD_COM_SEG EQU 0x4000511e
    ENDIF
    IF :LNOT::DEF:CYREG_PRT1_LCD_EN
CYREG_PRT1_LCD_EN EQU 0x4000511f
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT2_BASE
CYDEV_IO_PRT_PRT2_BASE EQU 0x40005120
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT2_SIZE
CYDEV_IO_PRT_PRT2_SIZE EQU 0x00000010
    ENDIF
    IF :LNOT::DEF:CYREG_PRT2_DR
CYREG_PRT2_DR EQU 0x40005120
    ENDIF
    IF :LNOT::DEF:CYREG_PRT2_PS
CYREG_PRT2_PS EQU 0x40005121
    ENDIF
    IF :LNOT::DEF:CYREG_PRT2_DM0
CYREG_PRT2_DM0 EQU 0x40005122
    ENDIF
    IF :LNOT::DEF:CYREG_PRT2_DM1
CYREG_PRT2_DM1 EQU 0x40005123
    ENDIF
    IF :LNOT::DEF:CYREG_PRT2_DM2
CYREG_PRT2_DM2 EQU 0x40005124
    ENDIF
    IF :LNOT::DEF:CYREG_PRT2_SLW
CYREG_PRT2_SLW EQU 0x40005125
    ENDIF
    IF :LNOT::DEF:CYREG_PRT2_BYP
CYREG_PRT2_BYP EQU 0x40005126
    ENDIF
    IF :LNOT::DEF:CYREG_PRT2_BIE
CYREG_PRT2_BIE EQU 0x40005127
    ENDIF
    IF :LNOT::DEF:CYREG_PRT2_INP_DIS
CYREG_PRT2_INP_DIS EQU 0x40005128
    ENDIF
    IF :LNOT::DEF:CYREG_PRT2_CTL
CYREG_PRT2_CTL EQU 0x40005129
    ENDIF
    IF :LNOT::DEF:CYREG_PRT2_PRT
CYREG_PRT2_PRT EQU 0x4000512a
    ENDIF
    IF :LNOT::DEF:CYREG_PRT2_BIT_MASK
CYREG_PRT2_BIT_MASK EQU 0x4000512b
    ENDIF
    IF :LNOT::DEF:CYREG_PRT2_AMUX
CYREG_PRT2_AMUX EQU 0x4000512c
    ENDIF
    IF :LNOT::DEF:CYREG_PRT2_AG
CYREG_PRT2_AG EQU 0x4000512d
    ENDIF
    IF :LNOT::DEF:CYREG_PRT2_LCD_COM_SEG
CYREG_PRT2_LCD_COM_SEG EQU 0x4000512e
    ENDIF
    IF :LNOT::DEF:CYREG_PRT2_LCD_EN
CYREG_PRT2_LCD_EN EQU 0x4000512f
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT3_BASE
CYDEV_IO_PRT_PRT3_BASE EQU 0x40005130
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT3_SIZE
CYDEV_IO_PRT_PRT3_SIZE EQU 0x00000010
    ENDIF
    IF :LNOT::DEF:CYREG_PRT3_DR
CYREG_PRT3_DR EQU 0x40005130
    ENDIF
    IF :LNOT::DEF:CYREG_PRT3_PS
CYREG_PRT3_PS EQU 0x40005131
    ENDIF
    IF :LNOT::DEF:CYREG_PRT3_DM0
CYREG_PRT3_DM0 EQU 0x40005132
    ENDIF
    IF :LNOT::DEF:CYREG_PRT3_DM1
CYREG_PRT3_DM1 EQU 0x40005133
    ENDIF
    IF :LNOT::DEF:CYREG_PRT3_DM2
CYREG_PRT3_DM2 EQU 0x40005134
    ENDIF
    IF :LNOT::DEF:CYREG_PRT3_SLW
CYREG_PRT3_SLW EQU 0x40005135
    ENDIF
    IF :LNOT::DEF:CYREG_PRT3_BYP
CYREG_PRT3_BYP EQU 0x40005136
    ENDIF
    IF :LNOT::DEF:CYREG_PRT3_BIE
CYREG_PRT3_BIE EQU 0x40005137
    ENDIF
    IF :LNOT::DEF:CYREG_PRT3_INP_DIS
CYREG_PRT3_INP_DIS EQU 0x40005138
    ENDIF
    IF :LNOT::DEF:CYREG_PRT3_CTL
CYREG_PRT3_CTL EQU 0x40005139
    ENDIF
    IF :LNOT::DEF:CYREG_PRT3_PRT
CYREG_PRT3_PRT EQU 0x4000513a
    ENDIF
    IF :LNOT::DEF:CYREG_PRT3_BIT_MASK
CYREG_PRT3_BIT_MASK EQU 0x4000513b
    ENDIF
    IF :LNOT::DEF:CYREG_PRT3_AMUX
CYREG_PRT3_AMUX EQU 0x4000513c
    ENDIF
    IF :LNOT::DEF:CYREG_PRT3_AG
CYREG_PRT3_AG EQU 0x4000513d
    ENDIF
    IF :LNOT::DEF:CYREG_PRT3_LCD_COM_SEG
CYREG_PRT3_LCD_COM_SEG EQU 0x4000513e
    ENDIF
    IF :LNOT::DEF:CYREG_PRT3_LCD_EN
CYREG_PRT3_LCD_EN EQU 0x4000513f
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT4_BASE
CYDEV_IO_PRT_PRT4_BASE EQU 0x40005140
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT4_SIZE
CYDEV_IO_PRT_PRT4_SIZE EQU 0x00000010
    ENDIF
    IF :LNOT::DEF:CYREG_PRT4_DR
CYREG_PRT4_DR EQU 0x40005140
    ENDIF
    IF :LNOT::DEF:CYREG_PRT4_PS
CYREG_PRT4_PS EQU 0x40005141
    ENDIF
    IF :LNOT::DEF:CYREG_PRT4_DM0
CYREG_PRT4_DM0 EQU 0x40005142
    ENDIF
    IF :LNOT::DEF:CYREG_PRT4_DM1
CYREG_PRT4_DM1 EQU 0x40005143
    ENDIF
    IF :LNOT::DEF:CYREG_PRT4_DM2
CYREG_PRT4_DM2 EQU 0x40005144
    ENDIF
    IF :LNOT::DEF:CYREG_PRT4_SLW
CYREG_PRT4_SLW EQU 0x40005145
    ENDIF
    IF :LNOT::DEF:CYREG_PRT4_BYP
CYREG_PRT4_BYP EQU 0x40005146
    ENDIF
    IF :LNOT::DEF:CYREG_PRT4_BIE
CYREG_PRT4_BIE EQU 0x40005147
    ENDIF
    IF :LNOT::DEF:CYREG_PRT4_INP_DIS
CYREG_PRT4_INP_DIS EQU 0x40005148
    ENDIF
    IF :LNOT::DEF:CYREG_PRT4_CTL
CYREG_PRT4_CTL EQU 0x40005149
    ENDIF
    IF :LNOT::DEF:CYREG_PRT4_PRT
CYREG_PRT4_PRT EQU 0x4000514a
    ENDIF
    IF :LNOT::DEF:CYREG_PRT4_BIT_MASK
CYREG_PRT4_BIT_MASK EQU 0x4000514b
    ENDIF
    IF :LNOT::DEF:CYREG_PRT4_AMUX
CYREG_PRT4_AMUX EQU 0x4000514c
    ENDIF
    IF :LNOT::DEF:CYREG_PRT4_AG
CYREG_PRT4_AG EQU 0x4000514d
    ENDIF
    IF :LNOT::DEF:CYREG_PRT4_LCD_COM_SEG
CYREG_PRT4_LCD_COM_SEG EQU 0x4000514e
    ENDIF
    IF :LNOT::DEF:CYREG_PRT4_LCD_EN
CYREG_PRT4_LCD_EN EQU 0x4000514f
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT5_BASE
CYDEV_IO_PRT_PRT5_BASE EQU 0x40005150
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT5_SIZE
CYDEV_IO_PRT_PRT5_SIZE EQU 0x00000010
    ENDIF
    IF :LNOT::DEF:CYREG_PRT5_DR
CYREG_PRT5_DR EQU 0x40005150
    ENDIF
    IF :LNOT::DEF:CYREG_PRT5_PS
CYREG_PRT5_PS EQU 0x40005151
    ENDIF
    IF :LNOT::DEF:CYREG_PRT5_DM0
CYREG_PRT5_DM0 EQU 0x40005152
    ENDIF
    IF :LNOT::DEF:CYREG_PRT5_DM1
CYREG_PRT5_DM1 EQU 0x40005153
    ENDIF
    IF :LNOT::DEF:CYREG_PRT5_DM2
CYREG_PRT5_DM2 EQU 0x40005154
    ENDIF
    IF :LNOT::DEF:CYREG_PRT5_SLW
CYREG_PRT5_SLW EQU 0x40005155
    ENDIF
    IF :LNOT::DEF:CYREG_PRT5_BYP
CYREG_PRT5_BYP EQU 0x40005156
    ENDIF
    IF :LNOT::DEF:CYREG_PRT5_BIE
CYREG_PRT5_BIE EQU 0x40005157
    ENDIF
    IF :LNOT::DEF:CYREG_PRT5_INP_DIS
