MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cydevicerv_trm.inc
CYREG_PRT5_INP_DIS EQU 0x40005158
    ENDIF
    IF :LNOT::DEF:CYREG_PRT5_CTL
CYREG_PRT5_CTL EQU 0x40005159
    ENDIF
    IF :LNOT::DEF:CYREG_PRT5_PRT
CYREG_PRT5_PRT EQU 0x4000515a
    ENDIF
    IF :LNOT::DEF:CYREG_PRT5_BIT_MASK
CYREG_PRT5_BIT_MASK EQU 0x4000515b
    ENDIF
    IF :LNOT::DEF:CYREG_PRT5_AMUX
CYREG_PRT5_AMUX EQU 0x4000515c
    ENDIF
    IF :LNOT::DEF:CYREG_PRT5_AG
CYREG_PRT5_AG EQU 0x4000515d
    ENDIF
    IF :LNOT::DEF:CYREG_PRT5_LCD_COM_SEG
CYREG_PRT5_LCD_COM_SEG EQU 0x4000515e
    ENDIF
    IF :LNOT::DEF:CYREG_PRT5_LCD_EN
CYREG_PRT5_LCD_EN EQU 0x4000515f
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT6_BASE
CYDEV_IO_PRT_PRT6_BASE EQU 0x40005160
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT6_SIZE
CYDEV_IO_PRT_PRT6_SIZE EQU 0x00000010
    ENDIF
    IF :LNOT::DEF:CYREG_PRT6_DR
CYREG_PRT6_DR EQU 0x40005160
    ENDIF
    IF :LNOT::DEF:CYREG_PRT6_PS
CYREG_PRT6_PS EQU 0x40005161
    ENDIF
    IF :LNOT::DEF:CYREG_PRT6_DM0
CYREG_PRT6_DM0 EQU 0x40005162
    ENDIF
    IF :LNOT::DEF:CYREG_PRT6_DM1
CYREG_PRT6_DM1 EQU 0x40005163
    ENDIF
    IF :LNOT::DEF:CYREG_PRT6_DM2
CYREG_PRT6_DM2 EQU 0x40005164
    ENDIF
    IF :LNOT::DEF:CYREG_PRT6_SLW
CYREG_PRT6_SLW EQU 0x40005165
    ENDIF
    IF :LNOT::DEF:CYREG_PRT6_BYP
CYREG_PRT6_BYP EQU 0x40005166
    ENDIF
    IF :LNOT::DEF:CYREG_PRT6_BIE
CYREG_PRT6_BIE EQU 0x40005167
    ENDIF
    IF :LNOT::DEF:CYREG_PRT6_INP_DIS
CYREG_PRT6_INP_DIS EQU 0x40005168
    ENDIF
    IF :LNOT::DEF:CYREG_PRT6_CTL
CYREG_PRT6_CTL EQU 0x40005169
    ENDIF
    IF :LNOT::DEF:CYREG_PRT6_PRT
CYREG_PRT6_PRT EQU 0x4000516a
    ENDIF
    IF :LNOT::DEF:CYREG_PRT6_BIT_MASK
CYREG_PRT6_BIT_MASK EQU 0x4000516b
    ENDIF
    IF :LNOT::DEF:CYREG_PRT6_AMUX
CYREG_PRT6_AMUX EQU 0x4000516c
    ENDIF
    IF :LNOT::DEF:CYREG_PRT6_AG
CYREG_PRT6_AG EQU 0x4000516d
    ENDIF
    IF :LNOT::DEF:CYREG_PRT6_LCD_COM_SEG
CYREG_PRT6_LCD_COM_SEG EQU 0x4000516e
    ENDIF
    IF :LNOT::DEF:CYREG_PRT6_LCD_EN
CYREG_PRT6_LCD_EN EQU 0x4000516f
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT12_BASE
CYDEV_IO_PRT_PRT12_BASE EQU 0x400051c0
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT12_SIZE
CYDEV_IO_PRT_PRT12_SIZE EQU 0x00000010
    ENDIF
    IF :LNOT::DEF:CYREG_PRT12_DR
CYREG_PRT12_DR EQU 0x400051c0
    ENDIF
    IF :LNOT::DEF:CYREG_PRT12_PS
CYREG_PRT12_PS EQU 0x400051c1
    ENDIF
    IF :LNOT::DEF:CYREG_PRT12_DM0
CYREG_PRT12_DM0 EQU 0x400051c2
    ENDIF
    IF :LNOT::DEF:CYREG_PRT12_DM1
CYREG_PRT12_DM1 EQU 0x400051c3
    ENDIF
    IF :LNOT::DEF:CYREG_PRT12_DM2
CYREG_PRT12_DM2 EQU 0x400051c4
    ENDIF
    IF :LNOT::DEF:CYREG_PRT12_SLW
CYREG_PRT12_SLW EQU 0x400051c5
    ENDIF
    IF :LNOT::DEF:CYREG_PRT12_BYP
CYREG_PRT12_BYP EQU 0x400051c6
    ENDIF
    IF :LNOT::DEF:CYREG_PRT12_BIE
CYREG_PRT12_BIE EQU 0x400051c7
    ENDIF
    IF :LNOT::DEF:CYREG_PRT12_INP_DIS
CYREG_PRT12_INP_DIS EQU 0x400051c8
    ENDIF
    IF :LNOT::DEF:CYREG_PRT12_SIO_HYST_EN
CYREG_PRT12_SIO_HYST_EN EQU 0x400051c9
    ENDIF
    IF :LNOT::DEF:CYREG_PRT12_PRT
CYREG_PRT12_PRT EQU 0x400051ca
    ENDIF
    IF :LNOT::DEF:CYREG_PRT12_BIT_MASK
CYREG_PRT12_BIT_MASK EQU 0x400051cb
    ENDIF
    IF :LNOT::DEF:CYREG_PRT12_SIO_REG_HIFREQ
CYREG_PRT12_SIO_REG_HIFREQ EQU 0x400051cc
    ENDIF
    IF :LNOT::DEF:CYREG_PRT12_AG
CYREG_PRT12_AG EQU 0x400051cd
    ENDIF
    IF :LNOT::DEF:CYREG_PRT12_SIO_CFG
CYREG_PRT12_SIO_CFG EQU 0x400051ce
    ENDIF
    IF :LNOT::DEF:CYREG_PRT12_SIO_DIFF
CYREG_PRT12_SIO_DIFF EQU 0x400051cf
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT15_BASE
CYDEV_IO_PRT_PRT15_BASE EQU 0x400051f0
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT15_SIZE
CYDEV_IO_PRT_PRT15_SIZE EQU 0x00000010
    ENDIF
    IF :LNOT::DEF:CYREG_PRT15_DR
CYREG_PRT15_DR EQU 0x400051f0
    ENDIF
    IF :LNOT::DEF:CYREG_PRT15_PS
CYREG_PRT15_PS EQU 0x400051f1
    ENDIF
    IF :LNOT::DEF:CYREG_PRT15_DM0
CYREG_PRT15_DM0 EQU 0x400051f2
    ENDIF
    IF :LNOT::DEF:CYREG_PRT15_DM1
CYREG_PRT15_DM1 EQU 0x400051f3
    ENDIF
    IF :LNOT::DEF:CYREG_PRT15_DM2
CYREG_PRT15_DM2 EQU 0x400051f4
    ENDIF
    IF :LNOT::DEF:CYREG_PRT15_SLW
CYREG_PRT15_SLW EQU 0x400051f5
    ENDIF
    IF :LNOT::DEF:CYREG_PRT15_BYP
CYREG_PRT15_BYP EQU 0x400051f6
    ENDIF
    IF :LNOT::DEF:CYREG_PRT15_BIE
CYREG_PRT15_BIE EQU 0x400051f7
    ENDIF
    IF :LNOT::DEF:CYREG_PRT15_INP_DIS
CYREG_PRT15_INP_DIS EQU 0x400051f8
    ENDIF
    IF :LNOT::DEF:CYREG_PRT15_CTL
CYREG_PRT15_CTL EQU 0x400051f9
    ENDIF
    IF :LNOT::DEF:CYREG_PRT15_PRT
CYREG_PRT15_PRT EQU 0x400051fa
    ENDIF
    IF :LNOT::DEF:CYREG_PRT15_BIT_MASK
CYREG_PRT15_BIT_MASK EQU 0x400051fb
    ENDIF
    IF :LNOT::DEF:CYREG_PRT15_AMUX
CYREG_PRT15_AMUX EQU 0x400051fc
    ENDIF
    IF :LNOT::DEF:CYREG_PRT15_AG
CYREG_PRT15_AG EQU 0x400051fd
    ENDIF
    IF :LNOT::DEF:CYREG_PRT15_LCD_COM_SEG
CYREG_PRT15_LCD_COM_SEG EQU 0x400051fe
    ENDIF
    IF :LNOT::DEF:CYREG_PRT15_LCD_EN
CYREG_PRT15_LCD_EN EQU 0x400051ff
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_BASE
CYDEV_PRTDSI_BASE EQU 0x40005200
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_SIZE
CYDEV_PRTDSI_SIZE EQU 0x0000007f
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT0_BASE
CYDEV_PRTDSI_PRT0_BASE EQU 0x40005200
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT0_SIZE
CYDEV_PRTDSI_PRT0_SIZE EQU 0x00000007
    ENDIF
    IF :LNOT::DEF:CYREG_PRT0_OUT_SEL0
CYREG_PRT0_OUT_SEL0 EQU 0x40005200
    ENDIF
    IF :LNOT::DEF:CYREG_PRT0_OUT_SEL1
CYREG_PRT0_OUT_SEL1 EQU 0x40005201
    ENDIF
    IF :LNOT::DEF:CYREG_PRT0_OE_SEL0
CYREG_PRT0_OE_SEL0 EQU 0x40005202
    ENDIF
    IF :LNOT::DEF:CYREG_PRT0_OE_SEL1
CYREG_PRT0_OE_SEL1 EQU 0x40005203
    ENDIF
    IF :LNOT::DEF:CYREG_PRT0_DBL_SYNC_IN
CYREG_PRT0_DBL_SYNC_IN EQU 0x40005204
    ENDIF
    IF :LNOT::DEF:CYREG_PRT0_SYNC_OUT
CYREG_PRT0_SYNC_OUT EQU 0x40005205
    ENDIF
    IF :LNOT::DEF:CYREG_PRT0_CAPS_SEL
CYREG_PRT0_CAPS_SEL EQU 0x40005206
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT1_BASE
CYDEV_PRTDSI_PRT1_BASE EQU 0x40005208
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT1_SIZE
CYDEV_PRTDSI_PRT1_SIZE EQU 0x00000007
    ENDIF
    IF :LNOT::DEF:CYREG_PRT1_OUT_SEL0
CYREG_PRT1_OUT_SEL0 EQU 0x40005208
    ENDIF
    IF :LNOT::DEF:CYREG_PRT1_OUT_SEL1
CYREG_PRT1_OUT_SEL1 EQU 0x40005209
    ENDIF
    IF :LNOT::DEF:CYREG_PRT1_OE_SEL0
CYREG_PRT1_OE_SEL0 EQU 0x4000520a
    ENDIF
    IF :LNOT::DEF:CYREG_PRT1_OE_SEL1
CYREG_PRT1_OE_SEL1 EQU 0x4000520b
    ENDIF
    IF :LNOT::DEF:CYREG_PRT1_DBL_SYNC_IN
CYREG_PRT1_DBL_SYNC_IN EQU 0x4000520c
    ENDIF
    IF :LNOT::DEF:CYREG_PRT1_SYNC_OUT
CYREG_PRT1_SYNC_OUT EQU 0x4000520d
    ENDIF
    IF :LNOT::DEF:CYREG_PRT1_CAPS_SEL
CYREG_PRT1_CAPS_SEL EQU 0x4000520e
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT2_BASE
CYDEV_PRTDSI_PRT2_BASE EQU 0x40005210
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT2_SIZE
CYDEV_PRTDSI_PRT2_SIZE EQU 0x00000007
    ENDIF
    IF :LNOT::DEF:CYREG_PRT2_OUT_SEL0
CYREG_PRT2_OUT_SEL0 EQU 0x40005210
    ENDIF
    IF :LNOT::DEF:CYREG_PRT2_OUT_SEL1
CYREG_PRT2_OUT_SEL1 EQU 0x40005211
    ENDIF
    IF :LNOT::DEF:CYREG_PRT2_OE_SEL0
CYREG_PRT2_OE_SEL0 EQU 0x40005212
    ENDIF
    IF :LNOT::DEF:CYREG_PRT2_OE_SEL1
CYREG_PRT2_OE_SEL1 EQU 0x40005213
    ENDIF
    IF :LNOT::DEF:CYREG_PRT2_DBL_SYNC_IN
CYREG_PRT2_DBL_SYNC_IN EQU 0x40005214
    ENDIF
    IF :LNOT::DEF:CYREG_PRT2_SYNC_OUT
CYREG_PRT2_SYNC_OUT EQU 0x40005215
    ENDIF
    IF :LNOT::DEF:CYREG_PRT2_CAPS_SEL
CYREG_PRT2_CAPS_SEL EQU 0x40005216
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT3_BASE
CYDEV_PRTDSI_PRT3_BASE EQU 0x40005218
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT3_SIZE
CYDEV_PRTDSI_PRT3_SIZE EQU 0x00000007
    ENDIF
    IF :LNOT::DEF:CYREG_PRT3_OUT_SEL0
CYREG_PRT3_OUT_SEL0 EQU 0x40005218
    ENDIF
    IF :LNOT::DEF:CYREG_PRT3_OUT_SEL1
CYREG_PRT3_OUT_SEL1 EQU 0x40005219
    ENDIF
    IF :LNOT::DEF:CYREG_PRT3_OE_SEL0
CYREG_PRT3_OE_SEL0 EQU 0x4000521a
    ENDIF
    IF :LNOT::DEF:CYREG_PRT3_OE_SEL1
CYREG_PRT3_OE_SEL1 EQU 0x4000521b
    ENDIF
    IF :LNOT::DEF:CYREG_PRT3_DBL_SYNC_IN
CYREG_PRT3_DBL_SYNC_IN EQU 0x4000521c
    ENDIF
    IF :LNOT::DEF:CYREG_PRT3_SYNC_OUT
CYREG_PRT3_SYNC_OUT EQU 0x4000521d
    ENDIF
    IF :LNOT::DEF:CYREG_PRT3_CAPS_SEL
CYREG_PRT3_CAPS_SEL EQU 0x4000521e
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT4_BASE
CYDEV_PRTDSI_PRT4_BASE EQU 0x40005220
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT4_SIZE
CYDEV_PRTDSI_PRT4_SIZE EQU 0x00000007
    ENDIF
    IF :LNOT::DEF:CYREG_PRT4_OUT_SEL0
CYREG_PRT4_OUT_SEL0 EQU 0x40005220
    ENDIF
    IF :LNOT::DEF:CYREG_PRT4_OUT_SEL1
CYREG_PRT4_OUT_SEL1 EQU 0x40005221
    ENDIF
    IF :LNOT::DEF:CYREG_PRT4_OE_SEL0
CYREG_PRT4_OE_SEL0 EQU 0x40005222
    ENDIF
    IF :LNOT::DEF:CYREG_PRT4_OE_SEL1
CYREG_PRT4_OE_SEL1 EQU 0x40005223
    ENDIF
    IF :LNOT::DEF:CYREG_PRT4_DBL_SYNC_IN
CYREG_PRT4_DBL_SYNC_IN EQU 0x40005224
    ENDIF
    IF :LNOT::DEF:CYREG_PRT4_SYNC_OUT
CYREG_PRT4_SYNC_OUT EQU 0x40005225
    ENDIF
    IF :LNOT::DEF:CYREG_PRT4_CAPS_SEL
CYREG_PRT4_CAPS_SEL EQU 0x40005226
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT5_BASE
CYDEV_PRTDSI_PRT5_BASE EQU 0x40005228
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT5_SIZE
CYDEV_PRTDSI_PRT5_SIZE EQU 0x00000007
    ENDIF
    IF :LNOT::DEF:CYREG_PRT5_OUT_SEL0
CYREG_PRT5_OUT_SEL0 EQU 0x40005228
    ENDIF
    IF :LNOT::DEF:CYREG_PRT5_OUT_SEL1
CYREG_PRT5_OUT_SEL1 EQU 0x40005229
    ENDIF
    IF :LNOT::DEF:CYREG_PRT5_OE_SEL0
CYREG_PRT5_OE_SEL0 EQU 0x4000522a
    ENDIF
    IF :LNOT::DEF:CYREG_PRT5_OE_SEL1
CYREG_PRT5_OE_SEL1 EQU 0x4000522b
    ENDIF
    IF :LNOT::DEF:CYREG_PRT5_DBL_SYNC_IN
CYREG_PRT5_DBL_SYNC_IN EQU 0x4000522c
    ENDIF
    IF :LNOT::DEF:CYREG_PRT5_SYNC_OUT
CYREG_PRT5_SYNC_OUT EQU 0x4000522d
    ENDIF
    IF :LNOT::DEF:CYREG_PRT5_CAPS_SEL
CYREG_PRT5_CAPS_SEL EQU 0x4000522e
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT6_BASE
CYDEV_PRTDSI_PRT6_BASE EQU 0x40005230
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT6_SIZE
CYDEV_PRTDSI_PRT6_SIZE EQU 0x00000007
    ENDIF
    IF :LNOT::DEF:CYREG_PRT6_OUT_SEL0
CYREG_PRT6_OUT_SEL0 EQU 0x40005230
    ENDIF
    IF :LNOT::DEF:CYREG_PRT6_OUT_SEL1
CYREG_PRT6_OUT_SEL1 EQU 0x40005231
    ENDIF
    IF :LNOT::DEF:CYREG_PRT6_OE_SEL0
CYREG_PRT6_OE_SEL0 EQU 0x40005232
    ENDIF
    IF :LNOT::DEF:CYREG_PRT6_OE_SEL1
CYREG_PRT6_OE_SEL1 EQU 0x40005233
    ENDIF
    IF :LNOT::DEF:CYREG_PRT6_DBL_SYNC_IN
CYREG_PRT6_DBL_SYNC_IN EQU 0x40005234
    ENDIF
    IF :LNOT::DEF:CYREG_PRT6_SYNC_OUT
CYREG_PRT6_SYNC_OUT EQU 0x40005235
    ENDIF
    IF :LNOT::DEF:CYREG_PRT6_CAPS_SEL
CYREG_PRT6_CAPS_SEL EQU 0x40005236
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT12_BASE
CYDEV_PRTDSI_PRT12_BASE EQU 0x40005260
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT12_SIZE
CYDEV_PRTDSI_PRT12_SIZE EQU 0x00000006
    ENDIF
    IF :LNOT::DEF:CYREG_PRT12_OUT_SEL0
CYREG_PRT12_OUT_SEL0 EQU 0x40005260
    ENDIF
    IF :LNOT::DEF:CYREG_PRT12_OUT_SEL1
CYREG_PRT12_OUT_SEL1 EQU 0x40005261
    ENDIF
    IF :LNOT::DEF:CYREG_PRT12_OE_SEL0
CYREG_PRT12_OE_SEL0 EQU 0x40005262
    ENDIF
    IF :LNOT::DEF:CYREG_PRT12_OE_SEL1
CYREG_PRT12_OE_SEL1 EQU 0x40005263
    ENDIF
    IF :LNOT::DEF:CYREG_PRT12_DBL_SYNC_IN
CYREG_PRT12_DBL_SYNC_IN EQU 0x40005264
    ENDIF
    IF :LNOT::DEF:CYREG_PRT12_SYNC_OUT
CYREG_PRT12_SYNC_OUT EQU 0x40005265
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT15_BASE
CYDEV_PRTDSI_PRT15_BASE EQU 0x40005278
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT15_SIZE
CYDEV_PRTDSI_PRT15_SIZE EQU 0x00000007
    ENDIF
    IF :LNOT::DEF:CYREG_PRT15_OUT_SEL0
CYREG_PRT15_OUT_SEL0 EQU 0x40005278
    ENDIF
    IF :LNOT::DEF:CYREG_PRT15_OUT_SEL1
CYREG_PRT15_OUT_SEL1 EQU 0x40005279
    ENDIF
    IF :LNOT::DEF:CYREG_PRT15_OE_SEL0
CYREG_PRT15_OE_SEL0 EQU 0x4000527a
    ENDIF
    IF :LNOT::DEF:CYREG_PRT15_OE_SEL1
CYREG_PRT15_OE_SEL1 EQU 0x4000527b
    ENDIF
    IF :LNOT::DEF:CYREG_PRT15_DBL_SYNC_IN
CYREG_PRT15_DBL_SYNC_IN EQU 0x4000527c
    ENDIF
    IF :LNOT::DEF:CYREG_PRT15_SYNC_OUT
CYREG_PRT15_SYNC_OUT EQU 0x4000527d
    ENDIF
    IF :LNOT::DEF:CYREG_PRT15_CAPS_SEL
CYREG_PRT15_CAPS_SEL EQU 0x4000527e
    ENDIF
    IF :LNOT::DEF:CYDEV_EMIF_BASE
CYDEV_EMIF_BASE EQU 0x40005400
    ENDIF
    IF :LNOT::DEF:CYDEV_EMIF_SIZE
CYDEV_EMIF_SIZE EQU 0x00000005
    ENDIF
    IF :LNOT::DEF:CYREG_EMIF_NO_UDB
CYREG_EMIF_NO_UDB EQU 0x40005400
    ENDIF
    IF :LNOT::DEF:CYREG_EMIF_WAIT_STATES
CYREG_EMIF_WAIT_STATES EQU 0x40005401
    ENDIF
    IF :LNOT::DEF:CYREG_EMIF_MEM_DWN
CYREG_EMIF_MEM_DWN EQU 0x40005402
    ENDIF
    IF :LNOT::DEF:CYREG_EMIF_MEMCLK_DIV
CYREG_EMIF_MEMCLK_DIV EQU 0x40005403
    ENDIF
    IF :LNOT::DEF:CYREG_EMIF_CLOCK_EN
CYREG_EMIF_CLOCK_EN EQU 0x40005404
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_BASE
CYDEV_ANAIF_BASE EQU 0x40005800
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_SIZE
CYDEV_ANAIF_SIZE EQU 0x000003a9
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_BASE
CYDEV_ANAIF_CFG_BASE EQU 0x40005800
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SIZE
CYDEV_ANAIF_CFG_SIZE EQU 0x00000110
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SC0_BASE
CYDEV_ANAIF_CFG_SC0_BASE EQU 0x40005800
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SC0_SIZE
CYDEV_ANAIF_CFG_SC0_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYREG_SC0_CR0
CYREG_SC0_CR0 EQU 0x40005800
    ENDIF
    IF :LNOT::DEF:CYREG_SC0_CR1
CYREG_SC0_CR1 EQU 0x40005801
    ENDIF
    IF :LNOT::DEF:CYREG_SC0_CR2
CYREG_SC0_CR2 EQU 0x40005802
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SC1_BASE
CYDEV_ANAIF_CFG_SC1_BASE EQU 0x40005804
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SC1_SIZE
CYDEV_ANAIF_CFG_SC1_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYREG_SC1_CR0
CYREG_SC1_CR0 EQU 0x40005804
    ENDIF
    IF :LNOT::DEF:CYREG_SC1_CR1
CYREG_SC1_CR1 EQU 0x40005805
    ENDIF
    IF :LNOT::DEF:CYREG_SC1_CR2
CYREG_SC1_CR2 EQU 0x40005806
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SC2_BASE
CYDEV_ANAIF_CFG_SC2_BASE EQU 0x40005808
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SC2_SIZE
CYDEV_ANAIF_CFG_SC2_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYREG_SC2_CR0
CYREG_SC2_CR0 EQU 0x40005808
    ENDIF
    IF :LNOT::DEF:CYREG_SC2_CR1
CYREG_SC2_CR1 EQU 0x40005809
    ENDIF
    IF :LNOT::DEF:CYREG_SC2_CR2
CYREG_SC2_CR2 EQU 0x4000580a
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SC3_BASE
CYDEV_ANAIF_CFG_SC3_BASE EQU 0x4000580c
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SC3_SIZE
CYDEV_ANAIF_CFG_SC3_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYREG_SC3_CR0
CYREG_SC3_CR0 EQU 0x4000580c
    ENDIF
    IF :LNOT::DEF:CYREG_SC3_CR1
CYREG_SC3_CR1 EQU 0x4000580d
    ENDIF
    IF :LNOT::DEF:CYREG_SC3_CR2
CYREG_SC3_CR2 EQU 0x4000580e
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DAC0_BASE
CYDEV_ANAIF_CFG_DAC0_BASE EQU 0x40005820
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DAC0_SIZE
CYDEV_ANAIF_CFG_DAC0_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYREG_DAC0_CR0
CYREG_DAC0_CR0 EQU 0x40005820
    ENDIF
    IF :LNOT::DEF:CYREG_DAC0_CR1
CYREG_DAC0_CR1 EQU 0x40005821
    ENDIF
    IF :LNOT::DEF:CYREG_DAC0_TST
CYREG_DAC0_TST EQU 0x40005822
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DAC1_BASE
CYDEV_ANAIF_CFG_DAC1_BASE EQU 0x40005824
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DAC1_SIZE
CYDEV_ANAIF_CFG_DAC1_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYREG_DAC1_CR0
CYREG_DAC1_CR0 EQU 0x40005824
    ENDIF
    IF :LNOT::DEF:CYREG_DAC1_CR1
CYREG_DAC1_CR1 EQU 0x40005825
    ENDIF
    IF :LNOT::DEF:CYREG_DAC1_TST
CYREG_DAC1_TST EQU 0x40005826
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DAC2_BASE
CYDEV_ANAIF_CFG_DAC2_BASE EQU 0x40005828
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DAC2_SIZE
CYDEV_ANAIF_CFG_DAC2_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYREG_DAC2_CR0
CYREG_DAC2_CR0 EQU 0x40005828
    ENDIF
    IF :LNOT::DEF:CYREG_DAC2_CR1
CYREG_DAC2_CR1 EQU 0x40005829
    ENDIF
    IF :LNOT::DEF:CYREG_DAC2_TST
CYREG_DAC2_TST EQU 0x4000582a
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DAC3_BASE
CYDEV_ANAIF_CFG_DAC3_BASE EQU 0x4000582c
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DAC3_SIZE
CYDEV_ANAIF_CFG_DAC3_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYREG_DAC3_CR0
CYREG_DAC3_CR0 EQU 0x4000582c
    ENDIF
    IF :LNOT::DEF:CYREG_DAC3_CR1
CYREG_DAC3_CR1 EQU 0x4000582d
    ENDIF
    IF :LNOT::DEF:CYREG_DAC3_TST
CYREG_DAC3_TST EQU 0x4000582e
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_CMP0_BASE
CYDEV_ANAIF_CFG_CMP0_BASE EQU 0x40005840
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_CMP0_SIZE
CYDEV_ANAIF_CFG_CMP0_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_CMP0_CR
CYREG_CMP0_CR EQU 0x40005840
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_CMP1_BASE
CYDEV_ANAIF_CFG_CMP1_BASE EQU 0x40005841
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_CMP1_SIZE
CYDEV_ANAIF_CFG_CMP1_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_CMP1_CR
CYREG_CMP1_CR EQU 0x40005841
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_CMP2_BASE
CYDEV_ANAIF_CFG_CMP2_BASE EQU 0x40005842
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_CMP2_SIZE
CYDEV_ANAIF_CFG_CMP2_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_CMP2_CR
CYREG_CMP2_CR EQU 0x40005842
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_CMP3_BASE
CYDEV_ANAIF_CFG_CMP3_BASE EQU 0x40005843
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_CMP3_SIZE
CYDEV_ANAIF_CFG_CMP3_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_CMP3_CR
CYREG_CMP3_CR EQU 0x40005843
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_LUT0_BASE
CYDEV_ANAIF_CFG_LUT0_BASE EQU 0x40005848
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_LUT0_SIZE
CYDEV_ANAIF_CFG_LUT0_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYREG_LUT0_CR
CYREG_LUT0_CR EQU 0x40005848
    ENDIF
    IF :LNOT::DEF:CYREG_LUT0_MX
CYREG_LUT0_MX EQU 0x40005849
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_LUT1_BASE
CYDEV_ANAIF_CFG_LUT1_BASE EQU 0x4000584a
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_LUT1_SIZE
CYDEV_ANAIF_CFG_LUT1_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYREG_LUT1_CR
CYREG_LUT1_CR EQU 0x4000584a
    ENDIF
    IF :LNOT::DEF:CYREG_LUT1_MX
CYREG_LUT1_MX EQU 0x4000584b
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_LUT2_BASE
CYDEV_ANAIF_CFG_LUT2_BASE EQU 0x4000584c
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_LUT2_SIZE
CYDEV_ANAIF_CFG_LUT2_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYREG_LUT2_CR
CYREG_LUT2_CR EQU 0x4000584c
    ENDIF
    IF :LNOT::DEF:CYREG_LUT2_MX
CYREG_LUT2_MX EQU 0x4000584d
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_LUT3_BASE
CYDEV_ANAIF_CFG_LUT3_BASE EQU 0x4000584e
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_LUT3_SIZE
CYDEV_ANAIF_CFG_LUT3_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYREG_LUT3_CR
CYREG_LUT3_CR EQU 0x4000584e
    ENDIF
    IF :LNOT::DEF:CYREG_LUT3_MX
CYREG_LUT3_MX EQU 0x4000584f
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_ABUF0_BASE
CYDEV_ANAIF_CFG_ABUF0_BASE EQU 0x40005858
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_ABUF0_SIZE
CYDEV_ANAIF_CFG_ABUF0_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYREG_ABUF0_CR
CYREG_ABUF0_CR EQU 0x40005858
    ENDIF
    IF :LNOT::DEF:CYREG_ABUF0_RSVD
CYREG_ABUF0_RSVD EQU 0x40005859
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_ABUF1_BASE
CYDEV_ANAIF_CFG_ABUF1_BASE EQU 0x4000585a
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_ABUF1_SIZE
CYDEV_ANAIF_CFG_ABUF1_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYREG_ABUF1_CR
CYREG_ABUF1_CR EQU 0x4000585a
    ENDIF
    IF :LNOT::DEF:CYREG_ABUF1_RSVD
CYREG_ABUF1_RSVD EQU 0x4000585b
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_ABUF2_BASE
CYDEV_ANAIF_CFG_ABUF2_BASE EQU 0x4000585c
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_ABUF2_SIZE
CYDEV_ANAIF_CFG_ABUF2_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYREG_ABUF2_CR
CYREG_ABUF2_CR EQU 0x4000585c
    ENDIF
    IF :LNOT::DEF:CYREG_ABUF2_RSVD
CYREG_ABUF2_RSVD EQU 0x4000585d
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_ABUF3_BASE
CYDEV_ANAIF_CFG_ABUF3_BASE EQU 0x4000585e
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_ABUF3_SIZE
CYDEV_ANAIF_CFG_ABUF3_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYREG_ABUF3_CR
CYREG_ABUF3_CR EQU 0x4000585e
    ENDIF
    IF :LNOT::DEF:CYREG_ABUF3_RSVD
CYREG_ABUF3_RSVD EQU 0x4000585f
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_LCDDAC_BASE
CYDEV_ANAIF_CFG_LCDDAC_BASE EQU 0x40005868
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_LCDDAC_SIZE
CYDEV_ANAIF_CFG_LCDDAC_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYREG_LCDDAC_CR0
CYREG_LCDDAC_CR0 EQU 0x40005868
    ENDIF
    IF :LNOT::DEF:CYREG_LCDDAC_CR1
CYREG_LCDDAC_CR1 EQU 0x40005869
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_LCDDRV_BASE
CYDEV_ANAIF_CFG_LCDDRV_BASE EQU 0x4000586a
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_LCDDRV_SIZE
CYDEV_ANAIF_CFG_LCDDRV_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_LCDDRV_CR
CYREG_LCDDRV_CR EQU 0x4000586a
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_BG_BASE
CYDEV_ANAIF_CFG_BG_BASE EQU 0x4000586c
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_BG_SIZE
CYDEV_ANAIF_CFG_BG_SIZE EQU 0x00000004
    ENDIF
    IF :LNOT::DEF:CYREG_BG_CR0
CYREG_BG_CR0 EQU 0x4000586c
    ENDIF
    IF :LNOT::DEF:CYREG_BG_RSVD
CYREG_BG_RSVD EQU 0x4000586d
    ENDIF
    IF :LNOT::DEF:CYREG_BG_DFT0
CYREG_BG_DFT0 EQU 0x4000586e
    ENDIF
    IF :LNOT::DEF:CYREG_BG_DFT1
CYREG_BG_DFT1 EQU 0x4000586f
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_CAPSL_BASE
CYDEV_ANAIF_CFG_CAPSL_BASE EQU 0x40005870
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_CAPSL_SIZE
CYDEV_ANAIF_CFG_CAPSL_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYREG_CAPSL_CFG0
CYREG_CAPSL_CFG0 EQU 0x40005870
    ENDIF
    IF :LNOT::DEF:CYREG_CAPSL_CFG1
CYREG_CAPSL_CFG1 EQU 0x40005871
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_CAPSR_BASE
CYDEV_ANAIF_CFG_CAPSR_BASE EQU 0x40005872
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_CAPSR_SIZE
CYDEV_ANAIF_CFG_CAPSR_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYREG_CAPSR_CFG0
CYREG_CAPSR_CFG0 EQU 0x40005872
    ENDIF
    IF :LNOT::DEF:CYREG_CAPSR_CFG1
CYREG_CAPSR_CFG1 EQU 0x40005873
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_CAPS_BASE
CYDEV_ANAIF_CFG_CAPS_BASE EQU 0x40005874
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_CAPS_SIZE
CYDEV_ANAIF_CFG_CAPS_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_CAPS_DFT
CYREG_CAPS_DFT EQU 0x40005874
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_PUMP_BASE
CYDEV_ANAIF_CFG_PUMP_BASE EQU 0x40005876
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_PUMP_SIZE
CYDEV_ANAIF_CFG_PUMP_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYREG_PUMP_CR0
CYREG_PUMP_CR0 EQU 0x40005876
    ENDIF
    IF :LNOT::DEF:CYREG_PUMP_CR1
CYREG_PUMP_CR1 EQU 0x40005877
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_LPF0_BASE
CYDEV_ANAIF_CFG_LPF0_BASE EQU 0x40005878
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_LPF0_SIZE
CYDEV_ANAIF_CFG_LPF0_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYREG_LPF0_CR0
CYREG_LPF0_CR0 EQU 0x40005878
    ENDIF
    IF :LNOT::DEF:CYREG_LPF0_RSVD
CYREG_LPF0_RSVD EQU 0x40005879
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_LPF1_BASE
CYDEV_ANAIF_CFG_LPF1_BASE EQU 0x4000587a
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_LPF1_SIZE
CYDEV_ANAIF_CFG_LPF1_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYREG_LPF1_CR0
CYREG_LPF1_CR0 EQU 0x4000587a
    ENDIF
    IF :LNOT::DEF:CYREG_LPF1_RSVD
CYREG_LPF1_RSVD EQU 0x4000587b
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_MISC_BASE
CYDEV_ANAIF_CFG_MISC_BASE EQU 0x4000587c
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_MISC_SIZE
CYDEV_ANAIF_CFG_MISC_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_ANAIF_CFG_MISC_CR0
CYREG_ANAIF_CFG_MISC_CR0 EQU 0x4000587c
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_TFAULT_BASE
CYDEV_ANAIF_CFG_TFAULT_BASE EQU 0x4000587e
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_TFAULT_SIZE
