MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cydevicerv_trm.inc
CYDEV_ANAIF_CFG_TFAULT_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYREG_TFAULT_CR0
CYREG_TFAULT_CR0 EQU 0x4000587e
    ENDIF
    IF :LNOT::DEF:CYREG_TFAULT_CR1
CYREG_TFAULT_CR1 EQU 0x4000587f
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DSM0_BASE
CYDEV_ANAIF_CFG_DSM0_BASE EQU 0x40005880
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DSM0_SIZE
CYDEV_ANAIF_CFG_DSM0_SIZE EQU 0x00000020
    ENDIF
    IF :LNOT::DEF:CYREG_DSM0_CR0
CYREG_DSM0_CR0 EQU 0x40005880
    ENDIF
    IF :LNOT::DEF:CYREG_DSM0_CR1
CYREG_DSM0_CR1 EQU 0x40005881
    ENDIF
    IF :LNOT::DEF:CYREG_DSM0_CR2
CYREG_DSM0_CR2 EQU 0x40005882
    ENDIF
    IF :LNOT::DEF:CYREG_DSM0_CR3
CYREG_DSM0_CR3 EQU 0x40005883
    ENDIF
    IF :LNOT::DEF:CYREG_DSM0_CR4
CYREG_DSM0_CR4 EQU 0x40005884
    ENDIF
    IF :LNOT::DEF:CYREG_DSM0_CR5
CYREG_DSM0_CR5 EQU 0x40005885
    ENDIF
    IF :LNOT::DEF:CYREG_DSM0_CR6
CYREG_DSM0_CR6 EQU 0x40005886
    ENDIF
    IF :LNOT::DEF:CYREG_DSM0_CR7
CYREG_DSM0_CR7 EQU 0x40005887
    ENDIF
    IF :LNOT::DEF:CYREG_DSM0_CR8
CYREG_DSM0_CR8 EQU 0x40005888
    ENDIF
    IF :LNOT::DEF:CYREG_DSM0_CR9
CYREG_DSM0_CR9 EQU 0x40005889
    ENDIF
    IF :LNOT::DEF:CYREG_DSM0_CR10
CYREG_DSM0_CR10 EQU 0x4000588a
    ENDIF
    IF :LNOT::DEF:CYREG_DSM0_CR11
CYREG_DSM0_CR11 EQU 0x4000588b
    ENDIF
    IF :LNOT::DEF:CYREG_DSM0_CR12
CYREG_DSM0_CR12 EQU 0x4000588c
    ENDIF
    IF :LNOT::DEF:CYREG_DSM0_CR13
CYREG_DSM0_CR13 EQU 0x4000588d
    ENDIF
    IF :LNOT::DEF:CYREG_DSM0_CR14
CYREG_DSM0_CR14 EQU 0x4000588e
    ENDIF
    IF :LNOT::DEF:CYREG_DSM0_CR15
CYREG_DSM0_CR15 EQU 0x4000588f
    ENDIF
    IF :LNOT::DEF:CYREG_DSM0_CR16
CYREG_DSM0_CR16 EQU 0x40005890
    ENDIF
    IF :LNOT::DEF:CYREG_DSM0_CR17
CYREG_DSM0_CR17 EQU 0x40005891
    ENDIF
    IF :LNOT::DEF:CYREG_DSM0_REF0
CYREG_DSM0_REF0 EQU 0x40005892
    ENDIF
    IF :LNOT::DEF:CYREG_DSM0_REF1
CYREG_DSM0_REF1 EQU 0x40005893
    ENDIF
    IF :LNOT::DEF:CYREG_DSM0_REF2
CYREG_DSM0_REF2 EQU 0x40005894
    ENDIF
    IF :LNOT::DEF:CYREG_DSM0_REF3
CYREG_DSM0_REF3 EQU 0x40005895
    ENDIF
    IF :LNOT::DEF:CYREG_DSM0_DEM0
CYREG_DSM0_DEM0 EQU 0x40005896
    ENDIF
    IF :LNOT::DEF:CYREG_DSM0_DEM1
CYREG_DSM0_DEM1 EQU 0x40005897
    ENDIF
    IF :LNOT::DEF:CYREG_DSM0_TST0
CYREG_DSM0_TST0 EQU 0x40005898
    ENDIF
    IF :LNOT::DEF:CYREG_DSM0_TST1
CYREG_DSM0_TST1 EQU 0x40005899
    ENDIF
    IF :LNOT::DEF:CYREG_DSM0_BUF0
CYREG_DSM0_BUF0 EQU 0x4000589a
    ENDIF
    IF :LNOT::DEF:CYREG_DSM0_BUF1
CYREG_DSM0_BUF1 EQU 0x4000589b
    ENDIF
    IF :LNOT::DEF:CYREG_DSM0_BUF2
CYREG_DSM0_BUF2 EQU 0x4000589c
    ENDIF
    IF :LNOT::DEF:CYREG_DSM0_BUF3
CYREG_DSM0_BUF3 EQU 0x4000589d
    ENDIF
    IF :LNOT::DEF:CYREG_DSM0_MISC
CYREG_DSM0_MISC EQU 0x4000589e
    ENDIF
    IF :LNOT::DEF:CYREG_DSM0_RSVD1
CYREG_DSM0_RSVD1 EQU 0x4000589f
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SAR0_BASE
CYDEV_ANAIF_CFG_SAR0_BASE EQU 0x40005900
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SAR0_SIZE
CYDEV_ANAIF_CFG_SAR0_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_SAR0_CSR0
CYREG_SAR0_CSR0 EQU 0x40005900
    ENDIF
    IF :LNOT::DEF:CYREG_SAR0_CSR1
CYREG_SAR0_CSR1 EQU 0x40005901
    ENDIF
    IF :LNOT::DEF:CYREG_SAR0_CSR2
CYREG_SAR0_CSR2 EQU 0x40005902
    ENDIF
    IF :LNOT::DEF:CYREG_SAR0_CSR3
CYREG_SAR0_CSR3 EQU 0x40005903
    ENDIF
    IF :LNOT::DEF:CYREG_SAR0_CSR4
CYREG_SAR0_CSR4 EQU 0x40005904
    ENDIF
    IF :LNOT::DEF:CYREG_SAR0_CSR5
CYREG_SAR0_CSR5 EQU 0x40005905
    ENDIF
    IF :LNOT::DEF:CYREG_SAR0_CSR6
CYREG_SAR0_CSR6 EQU 0x40005906
    ENDIF
    IF :LNOT::DEF:CYREG_SAR0_CSR7
CYREG_SAR0_CSR7 EQU 0x40005907
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SAR1_BASE
CYDEV_ANAIF_CFG_SAR1_BASE EQU 0x40005908
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SAR1_SIZE
CYDEV_ANAIF_CFG_SAR1_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_SAR1_CSR0
CYREG_SAR1_CSR0 EQU 0x40005908
    ENDIF
    IF :LNOT::DEF:CYREG_SAR1_CSR1
CYREG_SAR1_CSR1 EQU 0x40005909
    ENDIF
    IF :LNOT::DEF:CYREG_SAR1_CSR2
CYREG_SAR1_CSR2 EQU 0x4000590a
    ENDIF
    IF :LNOT::DEF:CYREG_SAR1_CSR3
CYREG_SAR1_CSR3 EQU 0x4000590b
    ENDIF
    IF :LNOT::DEF:CYREG_SAR1_CSR4
CYREG_SAR1_CSR4 EQU 0x4000590c
    ENDIF
    IF :LNOT::DEF:CYREG_SAR1_CSR5
CYREG_SAR1_CSR5 EQU 0x4000590d
    ENDIF
    IF :LNOT::DEF:CYREG_SAR1_CSR6
CYREG_SAR1_CSR6 EQU 0x4000590e
    ENDIF
    IF :LNOT::DEF:CYREG_SAR1_CSR7
CYREG_SAR1_CSR7 EQU 0x4000590f
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_BASE
CYDEV_ANAIF_RT_BASE EQU 0x40005a00
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SIZE
CYDEV_ANAIF_RT_SIZE EQU 0x00000160
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC0_BASE
CYDEV_ANAIF_RT_SC0_BASE EQU 0x40005a00
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC0_SIZE
CYDEV_ANAIF_RT_SC0_SIZE EQU 0x0000000d
    ENDIF
    IF :LNOT::DEF:CYREG_SC0_SW0
CYREG_SC0_SW0 EQU 0x40005a00
    ENDIF
    IF :LNOT::DEF:CYREG_SC0_SW2
CYREG_SC0_SW2 EQU 0x40005a02
    ENDIF
    IF :LNOT::DEF:CYREG_SC0_SW3
CYREG_SC0_SW3 EQU 0x40005a03
    ENDIF
    IF :LNOT::DEF:CYREG_SC0_SW4
CYREG_SC0_SW4 EQU 0x40005a04
    ENDIF
    IF :LNOT::DEF:CYREG_SC0_SW6
CYREG_SC0_SW6 EQU 0x40005a06
    ENDIF
    IF :LNOT::DEF:CYREG_SC0_SW7
CYREG_SC0_SW7 EQU 0x40005a07
    ENDIF
    IF :LNOT::DEF:CYREG_SC0_SW8
CYREG_SC0_SW8 EQU 0x40005a08
    ENDIF
    IF :LNOT::DEF:CYREG_SC0_SW10
CYREG_SC0_SW10 EQU 0x40005a0a
    ENDIF
    IF :LNOT::DEF:CYREG_SC0_CLK
CYREG_SC0_CLK EQU 0x40005a0b
    ENDIF
    IF :LNOT::DEF:CYREG_SC0_BST
CYREG_SC0_BST EQU 0x40005a0c
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC1_BASE
CYDEV_ANAIF_RT_SC1_BASE EQU 0x40005a10
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC1_SIZE
CYDEV_ANAIF_RT_SC1_SIZE EQU 0x0000000d
    ENDIF
    IF :LNOT::DEF:CYREG_SC1_SW0
CYREG_SC1_SW0 EQU 0x40005a10
    ENDIF
    IF :LNOT::DEF:CYREG_SC1_SW2
CYREG_SC1_SW2 EQU 0x40005a12
    ENDIF
    IF :LNOT::DEF:CYREG_SC1_SW3
CYREG_SC1_SW3 EQU 0x40005a13
    ENDIF
    IF :LNOT::DEF:CYREG_SC1_SW4
CYREG_SC1_SW4 EQU 0x40005a14
    ENDIF
    IF :LNOT::DEF:CYREG_SC1_SW6
CYREG_SC1_SW6 EQU 0x40005a16
    ENDIF
    IF :LNOT::DEF:CYREG_SC1_SW7
CYREG_SC1_SW7 EQU 0x40005a17
    ENDIF
    IF :LNOT::DEF:CYREG_SC1_SW8
CYREG_SC1_SW8 EQU 0x40005a18
    ENDIF
    IF :LNOT::DEF:CYREG_SC1_SW10
CYREG_SC1_SW10 EQU 0x40005a1a
    ENDIF
    IF :LNOT::DEF:CYREG_SC1_CLK
CYREG_SC1_CLK EQU 0x40005a1b
    ENDIF
    IF :LNOT::DEF:CYREG_SC1_BST
CYREG_SC1_BST EQU 0x40005a1c
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC2_BASE
CYDEV_ANAIF_RT_SC2_BASE EQU 0x40005a20
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC2_SIZE
CYDEV_ANAIF_RT_SC2_SIZE EQU 0x0000000d
    ENDIF
    IF :LNOT::DEF:CYREG_SC2_SW0
CYREG_SC2_SW0 EQU 0x40005a20
    ENDIF
    IF :LNOT::DEF:CYREG_SC2_SW2
CYREG_SC2_SW2 EQU 0x40005a22
    ENDIF
    IF :LNOT::DEF:CYREG_SC2_SW3
CYREG_SC2_SW3 EQU 0x40005a23
    ENDIF
    IF :LNOT::DEF:CYREG_SC2_SW4
CYREG_SC2_SW4 EQU 0x40005a24
    ENDIF
    IF :LNOT::DEF:CYREG_SC2_SW6
CYREG_SC2_SW6 EQU 0x40005a26
    ENDIF
    IF :LNOT::DEF:CYREG_SC2_SW7
CYREG_SC2_SW7 EQU 0x40005a27
    ENDIF
    IF :LNOT::DEF:CYREG_SC2_SW8
CYREG_SC2_SW8 EQU 0x40005a28
    ENDIF
    IF :LNOT::DEF:CYREG_SC2_SW10
CYREG_SC2_SW10 EQU 0x40005a2a
    ENDIF
    IF :LNOT::DEF:CYREG_SC2_CLK
CYREG_SC2_CLK EQU 0x40005a2b
    ENDIF
    IF :LNOT::DEF:CYREG_SC2_BST
CYREG_SC2_BST EQU 0x40005a2c
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC3_BASE
CYDEV_ANAIF_RT_SC3_BASE EQU 0x40005a30
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC3_SIZE
CYDEV_ANAIF_RT_SC3_SIZE EQU 0x0000000d
    ENDIF
    IF :LNOT::DEF:CYREG_SC3_SW0
CYREG_SC3_SW0 EQU 0x40005a30
    ENDIF
    IF :LNOT::DEF:CYREG_SC3_SW2
CYREG_SC3_SW2 EQU 0x40005a32
    ENDIF
    IF :LNOT::DEF:CYREG_SC3_SW3
CYREG_SC3_SW3 EQU 0x40005a33
    ENDIF
    IF :LNOT::DEF:CYREG_SC3_SW4
CYREG_SC3_SW4 EQU 0x40005a34
    ENDIF
    IF :LNOT::DEF:CYREG_SC3_SW6
CYREG_SC3_SW6 EQU 0x40005a36
    ENDIF
    IF :LNOT::DEF:CYREG_SC3_SW7
CYREG_SC3_SW7 EQU 0x40005a37
    ENDIF
    IF :LNOT::DEF:CYREG_SC3_SW8
CYREG_SC3_SW8 EQU 0x40005a38
    ENDIF
    IF :LNOT::DEF:CYREG_SC3_SW10
CYREG_SC3_SW10 EQU 0x40005a3a
    ENDIF
    IF :LNOT::DEF:CYREG_SC3_CLK
CYREG_SC3_CLK EQU 0x40005a3b
    ENDIF
    IF :LNOT::DEF:CYREG_SC3_BST
CYREG_SC3_BST EQU 0x40005a3c
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DAC0_BASE
CYDEV_ANAIF_RT_DAC0_BASE EQU 0x40005a80
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DAC0_SIZE
CYDEV_ANAIF_RT_DAC0_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_DAC0_SW0
CYREG_DAC0_SW0 EQU 0x40005a80
    ENDIF
    IF :LNOT::DEF:CYREG_DAC0_SW2
CYREG_DAC0_SW2 EQU 0x40005a82
    ENDIF
    IF :LNOT::DEF:CYREG_DAC0_SW3
CYREG_DAC0_SW3 EQU 0x40005a83
    ENDIF
    IF :LNOT::DEF:CYREG_DAC0_SW4
CYREG_DAC0_SW4 EQU 0x40005a84
    ENDIF
    IF :LNOT::DEF:CYREG_DAC0_STROBE
CYREG_DAC0_STROBE EQU 0x40005a87
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DAC1_BASE
CYDEV_ANAIF_RT_DAC1_BASE EQU 0x40005a88
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DAC1_SIZE
CYDEV_ANAIF_RT_DAC1_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_DAC1_SW0
CYREG_DAC1_SW0 EQU 0x40005a88
    ENDIF
    IF :LNOT::DEF:CYREG_DAC1_SW2
CYREG_DAC1_SW2 EQU 0x40005a8a
    ENDIF
    IF :LNOT::DEF:CYREG_DAC1_SW3
CYREG_DAC1_SW3 EQU 0x40005a8b
    ENDIF
    IF :LNOT::DEF:CYREG_DAC1_SW4
CYREG_DAC1_SW4 EQU 0x40005a8c
    ENDIF
    IF :LNOT::DEF:CYREG_DAC1_STROBE
CYREG_DAC1_STROBE EQU 0x40005a8f
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DAC2_BASE
CYDEV_ANAIF_RT_DAC2_BASE EQU 0x40005a90
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DAC2_SIZE
CYDEV_ANAIF_RT_DAC2_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_DAC2_SW0
CYREG_DAC2_SW0 EQU 0x40005a90
    ENDIF
    IF :LNOT::DEF:CYREG_DAC2_SW2
CYREG_DAC2_SW2 EQU 0x40005a92
    ENDIF
    IF :LNOT::DEF:CYREG_DAC2_SW3
CYREG_DAC2_SW3 EQU 0x40005a93
    ENDIF
    IF :LNOT::DEF:CYREG_DAC2_SW4
CYREG_DAC2_SW4 EQU 0x40005a94
    ENDIF
    IF :LNOT::DEF:CYREG_DAC2_STROBE
CYREG_DAC2_STROBE EQU 0x40005a97
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DAC3_BASE
CYDEV_ANAIF_RT_DAC3_BASE EQU 0x40005a98
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DAC3_SIZE
CYDEV_ANAIF_RT_DAC3_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_DAC3_SW0
CYREG_DAC3_SW0 EQU 0x40005a98
    ENDIF
    IF :LNOT::DEF:CYREG_DAC3_SW2
CYREG_DAC3_SW2 EQU 0x40005a9a
    ENDIF
    IF :LNOT::DEF:CYREG_DAC3_SW3
CYREG_DAC3_SW3 EQU 0x40005a9b
    ENDIF
    IF :LNOT::DEF:CYREG_DAC3_SW4
CYREG_DAC3_SW4 EQU 0x40005a9c
    ENDIF
    IF :LNOT::DEF:CYREG_DAC3_STROBE
CYREG_DAC3_STROBE EQU 0x40005a9f
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_CMP0_BASE
CYDEV_ANAIF_RT_CMP0_BASE EQU 0x40005ac0
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_CMP0_SIZE
CYDEV_ANAIF_RT_CMP0_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_CMP0_SW0
CYREG_CMP0_SW0 EQU 0x40005ac0
    ENDIF
    IF :LNOT::DEF:CYREG_CMP0_SW2
CYREG_CMP0_SW2 EQU 0x40005ac2
    ENDIF
    IF :LNOT::DEF:CYREG_CMP0_SW3
CYREG_CMP0_SW3 EQU 0x40005ac3
    ENDIF
    IF :LNOT::DEF:CYREG_CMP0_SW4
CYREG_CMP0_SW4 EQU 0x40005ac4
    ENDIF
    IF :LNOT::DEF:CYREG_CMP0_SW6
CYREG_CMP0_SW6 EQU 0x40005ac6
    ENDIF
    IF :LNOT::DEF:CYREG_CMP0_CLK
CYREG_CMP0_CLK EQU 0x40005ac7
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_CMP1_BASE
CYDEV_ANAIF_RT_CMP1_BASE EQU 0x40005ac8
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_CMP1_SIZE
CYDEV_ANAIF_RT_CMP1_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_CMP1_SW0
CYREG_CMP1_SW0 EQU 0x40005ac8
    ENDIF
    IF :LNOT::DEF:CYREG_CMP1_SW2
CYREG_CMP1_SW2 EQU 0x40005aca
    ENDIF
    IF :LNOT::DEF:CYREG_CMP1_SW3
CYREG_CMP1_SW3 EQU 0x40005acb
    ENDIF
    IF :LNOT::DEF:CYREG_CMP1_SW4
CYREG_CMP1_SW4 EQU 0x40005acc
    ENDIF
    IF :LNOT::DEF:CYREG_CMP1_SW6
CYREG_CMP1_SW6 EQU 0x40005ace
    ENDIF
    IF :LNOT::DEF:CYREG_CMP1_CLK
CYREG_CMP1_CLK EQU 0x40005acf
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_CMP2_BASE
CYDEV_ANAIF_RT_CMP2_BASE EQU 0x40005ad0
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_CMP2_SIZE
CYDEV_ANAIF_RT_CMP2_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_CMP2_SW0
CYREG_CMP2_SW0 EQU 0x40005ad0
    ENDIF
    IF :LNOT::DEF:CYREG_CMP2_SW2
CYREG_CMP2_SW2 EQU 0x40005ad2
    ENDIF
    IF :LNOT::DEF:CYREG_CMP2_SW3
CYREG_CMP2_SW3 EQU 0x40005ad3
    ENDIF
    IF :LNOT::DEF:CYREG_CMP2_SW4
CYREG_CMP2_SW4 EQU 0x40005ad4
    ENDIF
    IF :LNOT::DEF:CYREG_CMP2_SW6
CYREG_CMP2_SW6 EQU 0x40005ad6
    ENDIF
    IF :LNOT::DEF:CYREG_CMP2_CLK
CYREG_CMP2_CLK EQU 0x40005ad7
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_CMP3_BASE
CYDEV_ANAIF_RT_CMP3_BASE EQU 0x40005ad8
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_CMP3_SIZE
CYDEV_ANAIF_RT_CMP3_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_CMP3_SW0
CYREG_CMP3_SW0 EQU 0x40005ad8
    ENDIF
    IF :LNOT::DEF:CYREG_CMP3_SW2
CYREG_CMP3_SW2 EQU 0x40005ada
    ENDIF
    IF :LNOT::DEF:CYREG_CMP3_SW3
CYREG_CMP3_SW3 EQU 0x40005adb
    ENDIF
    IF :LNOT::DEF:CYREG_CMP3_SW4
CYREG_CMP3_SW4 EQU 0x40005adc
    ENDIF
    IF :LNOT::DEF:CYREG_CMP3_SW6
CYREG_CMP3_SW6 EQU 0x40005ade
    ENDIF
    IF :LNOT::DEF:CYREG_CMP3_CLK
CYREG_CMP3_CLK EQU 0x40005adf
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DSM0_BASE
CYDEV_ANAIF_RT_DSM0_BASE EQU 0x40005b00
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DSM0_SIZE
CYDEV_ANAIF_RT_DSM0_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_DSM0_SW0
CYREG_DSM0_SW0 EQU 0x40005b00
    ENDIF
    IF :LNOT::DEF:CYREG_DSM0_SW2
CYREG_DSM0_SW2 EQU 0x40005b02
    ENDIF
    IF :LNOT::DEF:CYREG_DSM0_SW3
CYREG_DSM0_SW3 EQU 0x40005b03
    ENDIF
    IF :LNOT::DEF:CYREG_DSM0_SW4
CYREG_DSM0_SW4 EQU 0x40005b04
    ENDIF
    IF :LNOT::DEF:CYREG_DSM0_SW6
CYREG_DSM0_SW6 EQU 0x40005b06
    ENDIF
    IF :LNOT::DEF:CYREG_DSM0_CLK
CYREG_DSM0_CLK EQU 0x40005b07
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SAR0_BASE
CYDEV_ANAIF_RT_SAR0_BASE EQU 0x40005b20
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SAR0_SIZE
CYDEV_ANAIF_RT_SAR0_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_SAR0_SW0
CYREG_SAR0_SW0 EQU 0x40005b20
    ENDIF
    IF :LNOT::DEF:CYREG_SAR0_SW2
CYREG_SAR0_SW2 EQU 0x40005b22
    ENDIF
    IF :LNOT::DEF:CYREG_SAR0_SW3
CYREG_SAR0_SW3 EQU 0x40005b23
    ENDIF
    IF :LNOT::DEF:CYREG_SAR0_SW4
CYREG_SAR0_SW4 EQU 0x40005b24
    ENDIF
    IF :LNOT::DEF:CYREG_SAR0_SW6
CYREG_SAR0_SW6 EQU 0x40005b26
    ENDIF
    IF :LNOT::DEF:CYREG_SAR0_CLK
CYREG_SAR0_CLK EQU 0x40005b27
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SAR1_BASE
CYDEV_ANAIF_RT_SAR1_BASE EQU 0x40005b28
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SAR1_SIZE
CYDEV_ANAIF_RT_SAR1_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_SAR1_SW0
CYREG_SAR1_SW0 EQU 0x40005b28
    ENDIF
    IF :LNOT::DEF:CYREG_SAR1_SW2
CYREG_SAR1_SW2 EQU 0x40005b2a
    ENDIF
    IF :LNOT::DEF:CYREG_SAR1_SW3
CYREG_SAR1_SW3 EQU 0x40005b2b
    ENDIF
    IF :LNOT::DEF:CYREG_SAR1_SW4
CYREG_SAR1_SW4 EQU 0x40005b2c
    ENDIF
    IF :LNOT::DEF:CYREG_SAR1_SW6
CYREG_SAR1_SW6 EQU 0x40005b2e
    ENDIF
    IF :LNOT::DEF:CYREG_SAR1_CLK
CYREG_SAR1_CLK EQU 0x40005b2f
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_ABUF0_BASE
CYDEV_ANAIF_RT_ABUF0_BASE EQU 0x40005b40
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_ABUF0_SIZE
CYDEV_ANAIF_RT_ABUF0_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYREG_ABUF0_MX
CYREG_ABUF0_MX EQU 0x40005b40
    ENDIF
    IF :LNOT::DEF:CYREG_ABUF0_SW
CYREG_ABUF0_SW EQU 0x40005b41
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_ABUF1_BASE
CYDEV_ANAIF_RT_ABUF1_BASE EQU 0x40005b42
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_ABUF1_SIZE
CYDEV_ANAIF_RT_ABUF1_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYREG_ABUF1_MX
CYREG_ABUF1_MX EQU 0x40005b42
    ENDIF
    IF :LNOT::DEF:CYREG_ABUF1_SW
CYREG_ABUF1_SW EQU 0x40005b43
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_ABUF2_BASE
CYDEV_ANAIF_RT_ABUF2_BASE EQU 0x40005b44
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_ABUF2_SIZE
CYDEV_ANAIF_RT_ABUF2_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYREG_ABUF2_MX
CYREG_ABUF2_MX EQU 0x40005b44
    ENDIF
    IF :LNOT::DEF:CYREG_ABUF2_SW
CYREG_ABUF2_SW EQU 0x40005b45
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_ABUF3_BASE
CYDEV_ANAIF_RT_ABUF3_BASE EQU 0x40005b46
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_ABUF3_SIZE
CYDEV_ANAIF_RT_ABUF3_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYREG_ABUF3_MX
CYREG_ABUF3_MX EQU 0x40005b46
    ENDIF
    IF :LNOT::DEF:CYREG_ABUF3_SW
CYREG_ABUF3_SW EQU 0x40005b47
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_LCDDAC_BASE
CYDEV_ANAIF_RT_LCDDAC_BASE EQU 0x40005b50
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_LCDDAC_SIZE
CYDEV_ANAIF_RT_LCDDAC_SIZE EQU 0x00000005
    ENDIF
    IF :LNOT::DEF:CYREG_LCDDAC_SW0
CYREG_LCDDAC_SW0 EQU 0x40005b50
    ENDIF
    IF :LNOT::DEF:CYREG_LCDDAC_SW1
CYREG_LCDDAC_SW1 EQU 0x40005b51
    ENDIF
    IF :LNOT::DEF:CYREG_LCDDAC_SW2
CYREG_LCDDAC_SW2 EQU 0x40005b52
    ENDIF
    IF :LNOT::DEF:CYREG_LCDDAC_SW3
CYREG_LCDDAC_SW3 EQU 0x40005b53
    ENDIF
    IF :LNOT::DEF:CYREG_LCDDAC_SW4
CYREG_LCDDAC_SW4 EQU 0x40005b54
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC_BASE
CYDEV_ANAIF_RT_SC_BASE EQU 0x40005b56
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC_SIZE
CYDEV_ANAIF_RT_SC_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_SC_MISC
CYREG_SC_MISC EQU 0x40005b56
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_BUS_BASE
CYDEV_ANAIF_RT_BUS_BASE EQU 0x40005b58
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_BUS_SIZE
CYDEV_ANAIF_RT_BUS_SIZE EQU 0x00000004
    ENDIF
    IF :LNOT::DEF:CYREG_BUS_SW0
CYREG_BUS_SW0 EQU 0x40005b58
    ENDIF
    IF :LNOT::DEF:CYREG_BUS_SW2
CYREG_BUS_SW2 EQU 0x40005b5a
    ENDIF
    IF :LNOT::DEF:CYREG_BUS_SW3
CYREG_BUS_SW3 EQU 0x40005b5b
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DFT_BASE
CYDEV_ANAIF_RT_DFT_BASE EQU 0x40005b5c
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DFT_SIZE
CYDEV_ANAIF_RT_DFT_SIZE EQU 0x00000004
    ENDIF
    IF :LNOT::DEF:CYREG_DFT_CR0
CYREG_DFT_CR0 EQU 0x40005b5c
    ENDIF
    IF :LNOT::DEF:CYREG_DFT_CR1
CYREG_DFT_CR1 EQU 0x40005b5d
    ENDIF
    IF :LNOT::DEF:CYREG_DFT_CR2
CYREG_DFT_CR2 EQU 0x40005b5e
    ENDIF
    IF :LNOT::DEF:CYREG_DFT_CR3
CYREG_DFT_CR3 EQU 0x40005b5f
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_BASE
CYDEV_ANAIF_WRK_BASE EQU 0x40005b80
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_SIZE
CYDEV_ANAIF_WRK_SIZE EQU 0x00000029
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_DAC0_BASE
CYDEV_ANAIF_WRK_DAC0_BASE EQU 0x40005b80
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_DAC0_SIZE
CYDEV_ANAIF_WRK_DAC0_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_DAC0_D
CYREG_DAC0_D EQU 0x40005b80
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_DAC1_BASE
CYDEV_ANAIF_WRK_DAC1_BASE EQU 0x40005b81
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_DAC1_SIZE
CYDEV_ANAIF_WRK_DAC1_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_DAC1_D
CYREG_DAC1_D EQU 0x40005b81
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_DAC2_BASE
CYDEV_ANAIF_WRK_DAC2_BASE EQU 0x40005b82
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_DAC2_SIZE
CYDEV_ANAIF_WRK_DAC2_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_DAC2_D
CYREG_DAC2_D EQU 0x40005b82
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_DAC3_BASE
CYDEV_ANAIF_WRK_DAC3_BASE EQU 0x40005b83
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_DAC3_SIZE
CYDEV_ANAIF_WRK_DAC3_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_DAC3_D
CYREG_DAC3_D EQU 0x40005b83
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_DSM0_BASE
CYDEV_ANAIF_WRK_DSM0_BASE EQU 0x40005b88
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_DSM0_SIZE
CYDEV_ANAIF_WRK_DSM0_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYREG_DSM0_OUT0
CYREG_DSM0_OUT0 EQU 0x40005b88
    ENDIF
    IF :LNOT::DEF:CYREG_DSM0_OUT1
CYREG_DSM0_OUT1 EQU 0x40005b89
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_SC_BASE
CYDEV_ANAIF_WRK_SC_BASE EQU 0x40005b8c
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_SC_SIZE
CYDEV_ANAIF_WRK_SC_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYREG_SC_SR
CYREG_SC_SR EQU 0x40005b8c
    ENDIF
    IF :LNOT::DEF:CYREG_SC_MSK
CYREG_SC_MSK EQU 0x40005b8d
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_LUT_BASE
CYDEV_ANAIF_WRK_LUT_BASE EQU 0x40005b8e
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_LUT_SIZE
CYDEV_ANAIF_WRK_LUT_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYREG_LUT_SR
CYREG_LUT_SR EQU 0x40005b8e
    ENDIF
    IF :LNOT::DEF:CYREG_LUT_MSK
CYREG_LUT_MSK EQU 0x40005b8f
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_CMP_BASE
CYDEV_ANAIF_WRK_CMP_BASE EQU 0x40005b90
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_CMP_SIZE
CYDEV_ANAIF_WRK_CMP_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYREG_CMP_WRK
CYREG_CMP_WRK EQU 0x40005b90
    ENDIF
    IF :LNOT::DEF:CYREG_CMP_LTRI
CYREG_CMP_LTRI EQU 0x40005b91
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_TFAULT_BASE
CYDEV_ANAIF_WRK_TFAULT_BASE EQU 0x40005b92
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_TFAULT_SIZE
CYDEV_ANAIF_WRK_TFAULT_SIZE EQU 0x00000004
    ENDIF
    IF :LNOT::DEF:CYREG_TFAULT_WRK0
CYREG_TFAULT_WRK0 EQU 0x40005b92
    ENDIF
    IF :LNOT::DEF:CYREG_TFAULT_WRK1
CYREG_TFAULT_WRK1 EQU 0x40005b93
    ENDIF
    IF :LNOT::DEF:CYREG_TFAULT_WRK2
CYREG_TFAULT_WRK2 EQU 0x40005b94
    ENDIF
    IF :LNOT::DEF:CYREG_TFAULT_WRK3
CYREG_TFAULT_WRK3 EQU 0x40005b95
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_SAR0_BASE
CYDEV_ANAIF_WRK_SAR0_BASE EQU 0x40005ba0
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_SAR0_SIZE
CYDEV_ANAIF_WRK_SAR0_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYREG_SAR0_WRK0
CYREG_SAR0_WRK0 EQU 0x40005ba0
    ENDIF
    IF :LNOT::DEF:CYREG_SAR0_WRK1
CYREG_SAR0_WRK1 EQU 0x40005ba1
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_SAR1_BASE
CYDEV_ANAIF_WRK_SAR1_BASE EQU 0x40005ba2
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_SAR1_SIZE
CYDEV_ANAIF_WRK_SAR1_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYREG_SAR1_WRK0
CYREG_SAR1_WRK0 EQU 0x40005ba2
    ENDIF
    IF :LNOT::DEF:CYREG_SAR1_WRK1
CYREG_SAR1_WRK1 EQU 0x40005ba3
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_SARS_BASE
CYDEV_ANAIF_WRK_SARS_BASE EQU 0x40005ba8
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_SARS_SIZE
CYDEV_ANAIF_WRK_SARS_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYREG_ANAIF_WRK_SARS_SOF
CYREG_ANAIF_WRK_SARS_SOF EQU 0x40005ba8
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_BASE
CYDEV_USB_BASE EQU 0x40006000
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIZE
CYDEV_USB_SIZE EQU 0x00000300
    ENDIF
    IF :LNOT::DEF:CYREG_USB_EP0_DR0
CYREG_USB_EP0_DR0 EQU 0x40006000
    ENDIF
    IF :LNOT::DEF:CYREG_USB_EP0_DR1
CYREG_USB_EP0_DR1 EQU 0x40006001
    ENDIF
    IF :LNOT::DEF:CYREG_USB_EP0_DR2
CYREG_USB_EP0_DR2 EQU 0x40006002
    ENDIF
    IF :LNOT::DEF:CYREG_USB_EP0_DR3
CYREG_USB_EP0_DR3 EQU 0x40006003
    ENDIF
    IF :LNOT::DEF:CYREG_USB_EP0_DR4
CYREG_USB_EP0_DR4 EQU 0x40006004
    ENDIF
    IF :LNOT::DEF:CYREG_USB_EP0_DR5
CYREG_USB_EP0_DR5 EQU 0x40006005
    ENDIF
    IF :LNOT::DEF:CYREG_USB_EP0_DR6
CYREG_USB_EP0_DR6 EQU 0x40006006
    ENDIF
    IF :LNOT::DEF:CYREG_USB_EP0_DR7
CYREG_USB_EP0_DR7 EQU 0x40006007
    ENDIF
    IF :LNOT::DEF:CYREG_USB_CR0
CYREG_USB_CR0 EQU 0x40006008
    ENDIF
    IF :LNOT::DEF:CYREG_USB_CR1
CYREG_USB_CR1 EQU 0x40006009
    ENDIF
    IF :LNOT::DEF:CYREG_USB_SIE_EP_INT_EN
CYREG_USB_SIE_EP_INT_EN EQU 0x4000600a
    ENDIF
    IF :LNOT::DEF:CYREG_USB_SIE_EP_INT_SR
CYREG_USB_SIE_EP_INT_SR EQU 0x4000600b
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP1_BASE
CYDEV_USB_SIE_EP1_BASE EQU 0x4000600c
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP1_SIZE
CYDEV_USB_SIE_EP1_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYREG_USB_SIE_EP1_CNT0
CYREG_USB_SIE_EP1_CNT0 EQU 0x4000600c
    ENDIF
