MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cydevicerv_trm.inc
    IF :LNOT::DEF:CYREG_USB_SIE_EP1_CNT1
CYREG_USB_SIE_EP1_CNT1 EQU 0x4000600d
    ENDIF
    IF :LNOT::DEF:CYREG_USB_SIE_EP1_CR0
CYREG_USB_SIE_EP1_CR0 EQU 0x4000600e
    ENDIF
    IF :LNOT::DEF:CYREG_USB_USBIO_CR0
CYREG_USB_USBIO_CR0 EQU 0x40006010
    ENDIF
    IF :LNOT::DEF:CYREG_USB_USBIO_CR2
CYREG_USB_USBIO_CR2 EQU 0x40006011
    ENDIF
    IF :LNOT::DEF:CYREG_USB_USBIO_CR1
CYREG_USB_USBIO_CR1 EQU 0x40006012
    ENDIF
    IF :LNOT::DEF:CYREG_USB_SOF0
CYREG_USB_SOF0 EQU 0x40006018
    ENDIF
    IF :LNOT::DEF:CYREG_USB_SOF1
CYREG_USB_SOF1 EQU 0x40006019
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP2_BASE
CYDEV_USB_SIE_EP2_BASE EQU 0x4000601c
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP2_SIZE
CYDEV_USB_SIE_EP2_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYREG_USB_SIE_EP2_CNT0
CYREG_USB_SIE_EP2_CNT0 EQU 0x4000601c
    ENDIF
    IF :LNOT::DEF:CYREG_USB_SIE_EP2_CNT1
CYREG_USB_SIE_EP2_CNT1 EQU 0x4000601d
    ENDIF
    IF :LNOT::DEF:CYREG_USB_SIE_EP2_CR0
CYREG_USB_SIE_EP2_CR0 EQU 0x4000601e
    ENDIF
    IF :LNOT::DEF:CYREG_USB_OSCLK_DR0
CYREG_USB_OSCLK_DR0 EQU 0x40006020
    ENDIF
    IF :LNOT::DEF:CYREG_USB_OSCLK_DR1
CYREG_USB_OSCLK_DR1 EQU 0x40006021
    ENDIF
    IF :LNOT::DEF:CYREG_USB_EP0_CR
CYREG_USB_EP0_CR EQU 0x40006028
    ENDIF
    IF :LNOT::DEF:CYREG_USB_EP0_CNT
CYREG_USB_EP0_CNT EQU 0x40006029
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP3_BASE
CYDEV_USB_SIE_EP3_BASE EQU 0x4000602c
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP3_SIZE
CYDEV_USB_SIE_EP3_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYREG_USB_SIE_EP3_CNT0
CYREG_USB_SIE_EP3_CNT0 EQU 0x4000602c
    ENDIF
    IF :LNOT::DEF:CYREG_USB_SIE_EP3_CNT1
CYREG_USB_SIE_EP3_CNT1 EQU 0x4000602d
    ENDIF
    IF :LNOT::DEF:CYREG_USB_SIE_EP3_CR0
CYREG_USB_SIE_EP3_CR0 EQU 0x4000602e
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP4_BASE
CYDEV_USB_SIE_EP4_BASE EQU 0x4000603c
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP4_SIZE
CYDEV_USB_SIE_EP4_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYREG_USB_SIE_EP4_CNT0
CYREG_USB_SIE_EP4_CNT0 EQU 0x4000603c
    ENDIF
    IF :LNOT::DEF:CYREG_USB_SIE_EP4_CNT1
CYREG_USB_SIE_EP4_CNT1 EQU 0x4000603d
    ENDIF
    IF :LNOT::DEF:CYREG_USB_SIE_EP4_CR0
CYREG_USB_SIE_EP4_CR0 EQU 0x4000603e
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP5_BASE
CYDEV_USB_SIE_EP5_BASE EQU 0x4000604c
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP5_SIZE
CYDEV_USB_SIE_EP5_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYREG_USB_SIE_EP5_CNT0
CYREG_USB_SIE_EP5_CNT0 EQU 0x4000604c
    ENDIF
    IF :LNOT::DEF:CYREG_USB_SIE_EP5_CNT1
CYREG_USB_SIE_EP5_CNT1 EQU 0x4000604d
    ENDIF
    IF :LNOT::DEF:CYREG_USB_SIE_EP5_CR0
CYREG_USB_SIE_EP5_CR0 EQU 0x4000604e
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP6_BASE
CYDEV_USB_SIE_EP6_BASE EQU 0x4000605c
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP6_SIZE
CYDEV_USB_SIE_EP6_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYREG_USB_SIE_EP6_CNT0
CYREG_USB_SIE_EP6_CNT0 EQU 0x4000605c
    ENDIF
    IF :LNOT::DEF:CYREG_USB_SIE_EP6_CNT1
CYREG_USB_SIE_EP6_CNT1 EQU 0x4000605d
    ENDIF
    IF :LNOT::DEF:CYREG_USB_SIE_EP6_CR0
CYREG_USB_SIE_EP6_CR0 EQU 0x4000605e
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP7_BASE
CYDEV_USB_SIE_EP7_BASE EQU 0x4000606c
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP7_SIZE
CYDEV_USB_SIE_EP7_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYREG_USB_SIE_EP7_CNT0
CYREG_USB_SIE_EP7_CNT0 EQU 0x4000606c
    ENDIF
    IF :LNOT::DEF:CYREG_USB_SIE_EP7_CNT1
CYREG_USB_SIE_EP7_CNT1 EQU 0x4000606d
    ENDIF
    IF :LNOT::DEF:CYREG_USB_SIE_EP7_CR0
CYREG_USB_SIE_EP7_CR0 EQU 0x4000606e
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP8_BASE
CYDEV_USB_SIE_EP8_BASE EQU 0x4000607c
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP8_SIZE
CYDEV_USB_SIE_EP8_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYREG_USB_SIE_EP8_CNT0
CYREG_USB_SIE_EP8_CNT0 EQU 0x4000607c
    ENDIF
    IF :LNOT::DEF:CYREG_USB_SIE_EP8_CNT1
CYREG_USB_SIE_EP8_CNT1 EQU 0x4000607d
    ENDIF
    IF :LNOT::DEF:CYREG_USB_SIE_EP8_CR0
CYREG_USB_SIE_EP8_CR0 EQU 0x4000607e
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP1_BASE
CYDEV_USB_ARB_EP1_BASE EQU 0x40006080
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP1_SIZE
CYDEV_USB_ARB_EP1_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_EP1_CFG
CYREG_USB_ARB_EP1_CFG EQU 0x40006080
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_EP1_INT_EN
CYREG_USB_ARB_EP1_INT_EN EQU 0x40006081
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_EP1_SR
CYREG_USB_ARB_EP1_SR EQU 0x40006082
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW1_BASE
CYDEV_USB_ARB_RW1_BASE EQU 0x40006084
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW1_SIZE
CYDEV_USB_ARB_RW1_SIZE EQU 0x00000005
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_RW1_WA
CYREG_USB_ARB_RW1_WA EQU 0x40006084
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_RW1_WA_MSB
CYREG_USB_ARB_RW1_WA_MSB EQU 0x40006085
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_RW1_RA
CYREG_USB_ARB_RW1_RA EQU 0x40006086
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_RW1_RA_MSB
CYREG_USB_ARB_RW1_RA_MSB EQU 0x40006087
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_RW1_DR
CYREG_USB_ARB_RW1_DR EQU 0x40006088
    ENDIF
    IF :LNOT::DEF:CYREG_USB_BUF_SIZE
CYREG_USB_BUF_SIZE EQU 0x4000608c
    ENDIF
    IF :LNOT::DEF:CYREG_USB_EP_ACTIVE
CYREG_USB_EP_ACTIVE EQU 0x4000608e
    ENDIF
    IF :LNOT::DEF:CYREG_USB_EP_TYPE
CYREG_USB_EP_TYPE EQU 0x4000608f
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP2_BASE
CYDEV_USB_ARB_EP2_BASE EQU 0x40006090
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP2_SIZE
CYDEV_USB_ARB_EP2_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_EP2_CFG
CYREG_USB_ARB_EP2_CFG EQU 0x40006090
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_EP2_INT_EN
CYREG_USB_ARB_EP2_INT_EN EQU 0x40006091
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_EP2_SR
CYREG_USB_ARB_EP2_SR EQU 0x40006092
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW2_BASE
CYDEV_USB_ARB_RW2_BASE EQU 0x40006094
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW2_SIZE
CYDEV_USB_ARB_RW2_SIZE EQU 0x00000005
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_RW2_WA
CYREG_USB_ARB_RW2_WA EQU 0x40006094
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_RW2_WA_MSB
CYREG_USB_ARB_RW2_WA_MSB EQU 0x40006095
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_RW2_RA
CYREG_USB_ARB_RW2_RA EQU 0x40006096
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_RW2_RA_MSB
CYREG_USB_ARB_RW2_RA_MSB EQU 0x40006097
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_RW2_DR
CYREG_USB_ARB_RW2_DR EQU 0x40006098
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_CFG
CYREG_USB_ARB_CFG EQU 0x4000609c
    ENDIF
    IF :LNOT::DEF:CYREG_USB_USB_CLK_EN
CYREG_USB_USB_CLK_EN EQU 0x4000609d
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_INT_EN
CYREG_USB_ARB_INT_EN EQU 0x4000609e
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_INT_SR
CYREG_USB_ARB_INT_SR EQU 0x4000609f
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP3_BASE
CYDEV_USB_ARB_EP3_BASE EQU 0x400060a0
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP3_SIZE
CYDEV_USB_ARB_EP3_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_EP3_CFG
CYREG_USB_ARB_EP3_CFG EQU 0x400060a0
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_EP3_INT_EN
CYREG_USB_ARB_EP3_INT_EN EQU 0x400060a1
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_EP3_SR
CYREG_USB_ARB_EP3_SR EQU 0x400060a2
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW3_BASE
CYDEV_USB_ARB_RW3_BASE EQU 0x400060a4
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW3_SIZE
CYDEV_USB_ARB_RW3_SIZE EQU 0x00000005
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_RW3_WA
CYREG_USB_ARB_RW3_WA EQU 0x400060a4
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_RW3_WA_MSB
CYREG_USB_ARB_RW3_WA_MSB EQU 0x400060a5
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_RW3_RA
CYREG_USB_ARB_RW3_RA EQU 0x400060a6
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_RW3_RA_MSB
CYREG_USB_ARB_RW3_RA_MSB EQU 0x400060a7
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_RW3_DR
CYREG_USB_ARB_RW3_DR EQU 0x400060a8
    ENDIF
    IF :LNOT::DEF:CYREG_USB_CWA
CYREG_USB_CWA EQU 0x400060ac
    ENDIF
    IF :LNOT::DEF:CYREG_USB_CWA_MSB
CYREG_USB_CWA_MSB EQU 0x400060ad
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP4_BASE
CYDEV_USB_ARB_EP4_BASE EQU 0x400060b0
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP4_SIZE
CYDEV_USB_ARB_EP4_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_EP4_CFG
CYREG_USB_ARB_EP4_CFG EQU 0x400060b0
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_EP4_INT_EN
CYREG_USB_ARB_EP4_INT_EN EQU 0x400060b1
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_EP4_SR
CYREG_USB_ARB_EP4_SR EQU 0x400060b2
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW4_BASE
CYDEV_USB_ARB_RW4_BASE EQU 0x400060b4
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW4_SIZE
CYDEV_USB_ARB_RW4_SIZE EQU 0x00000005
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_RW4_WA
CYREG_USB_ARB_RW4_WA EQU 0x400060b4
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_RW4_WA_MSB
CYREG_USB_ARB_RW4_WA_MSB EQU 0x400060b5
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_RW4_RA
CYREG_USB_ARB_RW4_RA EQU 0x400060b6
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_RW4_RA_MSB
CYREG_USB_ARB_RW4_RA_MSB EQU 0x400060b7
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_RW4_DR
CYREG_USB_ARB_RW4_DR EQU 0x400060b8
    ENDIF
    IF :LNOT::DEF:CYREG_USB_DMA_THRES
CYREG_USB_DMA_THRES EQU 0x400060bc
    ENDIF
    IF :LNOT::DEF:CYREG_USB_DMA_THRES_MSB
CYREG_USB_DMA_THRES_MSB EQU 0x400060bd
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP5_BASE
CYDEV_USB_ARB_EP5_BASE EQU 0x400060c0
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP5_SIZE
CYDEV_USB_ARB_EP5_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_EP5_CFG
CYREG_USB_ARB_EP5_CFG EQU 0x400060c0
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_EP5_INT_EN
CYREG_USB_ARB_EP5_INT_EN EQU 0x400060c1
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_EP5_SR
CYREG_USB_ARB_EP5_SR EQU 0x400060c2
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW5_BASE
CYDEV_USB_ARB_RW5_BASE EQU 0x400060c4
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW5_SIZE
CYDEV_USB_ARB_RW5_SIZE EQU 0x00000005
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_RW5_WA
CYREG_USB_ARB_RW5_WA EQU 0x400060c4
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_RW5_WA_MSB
CYREG_USB_ARB_RW5_WA_MSB EQU 0x400060c5
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_RW5_RA
CYREG_USB_ARB_RW5_RA EQU 0x400060c6
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_RW5_RA_MSB
CYREG_USB_ARB_RW5_RA_MSB EQU 0x400060c7
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_RW5_DR
CYREG_USB_ARB_RW5_DR EQU 0x400060c8
    ENDIF
    IF :LNOT::DEF:CYREG_USB_BUS_RST_CNT
CYREG_USB_BUS_RST_CNT EQU 0x400060cc
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP6_BASE
CYDEV_USB_ARB_EP6_BASE EQU 0x400060d0
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP6_SIZE
CYDEV_USB_ARB_EP6_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_EP6_CFG
CYREG_USB_ARB_EP6_CFG EQU 0x400060d0
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_EP6_INT_EN
CYREG_USB_ARB_EP6_INT_EN EQU 0x400060d1
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_EP6_SR
CYREG_USB_ARB_EP6_SR EQU 0x400060d2
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW6_BASE
CYDEV_USB_ARB_RW6_BASE EQU 0x400060d4
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW6_SIZE
CYDEV_USB_ARB_RW6_SIZE EQU 0x00000005
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_RW6_WA
CYREG_USB_ARB_RW6_WA EQU 0x400060d4
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_RW6_WA_MSB
CYREG_USB_ARB_RW6_WA_MSB EQU 0x400060d5
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_RW6_RA
CYREG_USB_ARB_RW6_RA EQU 0x400060d6
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_RW6_RA_MSB
CYREG_USB_ARB_RW6_RA_MSB EQU 0x400060d7
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_RW6_DR
CYREG_USB_ARB_RW6_DR EQU 0x400060d8
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP7_BASE
CYDEV_USB_ARB_EP7_BASE EQU 0x400060e0
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP7_SIZE
CYDEV_USB_ARB_EP7_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_EP7_CFG
CYREG_USB_ARB_EP7_CFG EQU 0x400060e0
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_EP7_INT_EN
CYREG_USB_ARB_EP7_INT_EN EQU 0x400060e1
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_EP7_SR
CYREG_USB_ARB_EP7_SR EQU 0x400060e2
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW7_BASE
CYDEV_USB_ARB_RW7_BASE EQU 0x400060e4
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW7_SIZE
CYDEV_USB_ARB_RW7_SIZE EQU 0x00000005
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_RW7_WA
CYREG_USB_ARB_RW7_WA EQU 0x400060e4
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_RW7_WA_MSB
CYREG_USB_ARB_RW7_WA_MSB EQU 0x400060e5
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_RW7_RA
CYREG_USB_ARB_RW7_RA EQU 0x400060e6
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_RW7_RA_MSB
CYREG_USB_ARB_RW7_RA_MSB EQU 0x400060e7
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_RW7_DR
CYREG_USB_ARB_RW7_DR EQU 0x400060e8
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP8_BASE
CYDEV_USB_ARB_EP8_BASE EQU 0x400060f0
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP8_SIZE
CYDEV_USB_ARB_EP8_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_EP8_CFG
CYREG_USB_ARB_EP8_CFG EQU 0x400060f0
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_EP8_INT_EN
CYREG_USB_ARB_EP8_INT_EN EQU 0x400060f1
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_EP8_SR
CYREG_USB_ARB_EP8_SR EQU 0x400060f2
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW8_BASE
CYDEV_USB_ARB_RW8_BASE EQU 0x400060f4
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW8_SIZE
CYDEV_USB_ARB_RW8_SIZE EQU 0x00000005
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_RW8_WA
CYREG_USB_ARB_RW8_WA EQU 0x400060f4
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_RW8_WA_MSB
CYREG_USB_ARB_RW8_WA_MSB EQU 0x400060f5
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_RW8_RA
CYREG_USB_ARB_RW8_RA EQU 0x400060f6
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_RW8_RA_MSB
CYREG_USB_ARB_RW8_RA_MSB EQU 0x400060f7
    ENDIF
    IF :LNOT::DEF:CYREG_USB_ARB_RW8_DR
CYREG_USB_ARB_RW8_DR EQU 0x400060f8
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_MEM_BASE
CYDEV_USB_MEM_BASE EQU 0x40006100
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_MEM_SIZE
CYDEV_USB_MEM_SIZE EQU 0x00000200
    ENDIF
    IF :LNOT::DEF:CYREG_USB_MEM_DATA_MBASE
CYREG_USB_MEM_DATA_MBASE EQU 0x40006100
    ENDIF
    IF :LNOT::DEF:CYREG_USB_MEM_DATA_MSIZE
CYREG_USB_MEM_DATA_MSIZE EQU 0x00000200
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_BASE
CYDEV_UWRK_BASE EQU 0x40006400
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_SIZE
CYDEV_UWRK_SIZE EQU 0x00000b60
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_BASE
CYDEV_UWRK_UWRK8_BASE EQU 0x40006400
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_SIZE
CYDEV_UWRK_UWRK8_SIZE EQU 0x000003b0
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_BASE
CYDEV_UWRK_UWRK8_B0_BASE EQU 0x40006400
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_SIZE
CYDEV_UWRK_UWRK8_B0_SIZE EQU 0x000000b0
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB00_A0
CYREG_B0_UDB00_A0 EQU 0x40006400
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB01_A0
CYREG_B0_UDB01_A0 EQU 0x40006401
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB02_A0
CYREG_B0_UDB02_A0 EQU 0x40006402
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB03_A0
CYREG_B0_UDB03_A0 EQU 0x40006403
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB04_A0
CYREG_B0_UDB04_A0 EQU 0x40006404
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB05_A0
CYREG_B0_UDB05_A0 EQU 0x40006405
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB06_A0
CYREG_B0_UDB06_A0 EQU 0x40006406
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB07_A0
CYREG_B0_UDB07_A0 EQU 0x40006407
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB08_A0
CYREG_B0_UDB08_A0 EQU 0x40006408
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB09_A0
CYREG_B0_UDB09_A0 EQU 0x40006409
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB10_A0
CYREG_B0_UDB10_A0 EQU 0x4000640a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB11_A0
CYREG_B0_UDB11_A0 EQU 0x4000640b
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB12_A0
CYREG_B0_UDB12_A0 EQU 0x4000640c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB13_A0
CYREG_B0_UDB13_A0 EQU 0x4000640d
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB14_A0
CYREG_B0_UDB14_A0 EQU 0x4000640e
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB15_A0
CYREG_B0_UDB15_A0 EQU 0x4000640f
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB00_A1
CYREG_B0_UDB00_A1 EQU 0x40006410
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB01_A1
CYREG_B0_UDB01_A1 EQU 0x40006411
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB02_A1
CYREG_B0_UDB02_A1 EQU 0x40006412
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB03_A1
CYREG_B0_UDB03_A1 EQU 0x40006413
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB04_A1
CYREG_B0_UDB04_A1 EQU 0x40006414
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB05_A1
CYREG_B0_UDB05_A1 EQU 0x40006415
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB06_A1
CYREG_B0_UDB06_A1 EQU 0x40006416
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB07_A1
CYREG_B0_UDB07_A1 EQU 0x40006417
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB08_A1
CYREG_B0_UDB08_A1 EQU 0x40006418
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB09_A1
CYREG_B0_UDB09_A1 EQU 0x40006419
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB10_A1
CYREG_B0_UDB10_A1 EQU 0x4000641a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB11_A1
CYREG_B0_UDB11_A1 EQU 0x4000641b
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB12_A1
CYREG_B0_UDB12_A1 EQU 0x4000641c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB13_A1
CYREG_B0_UDB13_A1 EQU 0x4000641d
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB14_A1
CYREG_B0_UDB14_A1 EQU 0x4000641e
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB15_A1
CYREG_B0_UDB15_A1 EQU 0x4000641f
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB00_D0
CYREG_B0_UDB00_D0 EQU 0x40006420
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB01_D0
CYREG_B0_UDB01_D0 EQU 0x40006421
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB02_D0
CYREG_B0_UDB02_D0 EQU 0x40006422
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB03_D0
CYREG_B0_UDB03_D0 EQU 0x40006423
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB04_D0
CYREG_B0_UDB04_D0 EQU 0x40006424
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB05_D0
CYREG_B0_UDB05_D0 EQU 0x40006425
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB06_D0
CYREG_B0_UDB06_D0 EQU 0x40006426
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB07_D0
CYREG_B0_UDB07_D0 EQU 0x40006427
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB08_D0
CYREG_B0_UDB08_D0 EQU 0x40006428
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB09_D0
CYREG_B0_UDB09_D0 EQU 0x40006429
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB10_D0
CYREG_B0_UDB10_D0 EQU 0x4000642a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB11_D0
CYREG_B0_UDB11_D0 EQU 0x4000642b
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB12_D0
CYREG_B0_UDB12_D0 EQU 0x4000642c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB13_D0
CYREG_B0_UDB13_D0 EQU 0x4000642d
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB14_D0
CYREG_B0_UDB14_D0 EQU 0x4000642e
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB15_D0
CYREG_B0_UDB15_D0 EQU 0x4000642f
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB00_D1
CYREG_B0_UDB00_D1 EQU 0x40006430
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB01_D1
CYREG_B0_UDB01_D1 EQU 0x40006431
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB02_D1
CYREG_B0_UDB02_D1 EQU 0x40006432
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB03_D1
CYREG_B0_UDB03_D1 EQU 0x40006433
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB04_D1
CYREG_B0_UDB04_D1 EQU 0x40006434
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB05_D1
CYREG_B0_UDB05_D1 EQU 0x40006435
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB06_D1
CYREG_B0_UDB06_D1 EQU 0x40006436
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB07_D1
CYREG_B0_UDB07_D1 EQU 0x40006437
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB08_D1
CYREG_B0_UDB08_D1 EQU 0x40006438
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB09_D1
CYREG_B0_UDB09_D1 EQU 0x40006439
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB10_D1
CYREG_B0_UDB10_D1 EQU 0x4000643a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB11_D1
CYREG_B0_UDB11_D1 EQU 0x4000643b
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB12_D1
CYREG_B0_UDB12_D1 EQU 0x4000643c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB13_D1
CYREG_B0_UDB13_D1 EQU 0x4000643d
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB14_D1
CYREG_B0_UDB14_D1 EQU 0x4000643e
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB15_D1
CYREG_B0_UDB15_D1 EQU 0x4000643f
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB00_F0
CYREG_B0_UDB00_F0 EQU 0x40006440
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB01_F0
CYREG_B0_UDB01_F0 EQU 0x40006441
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB02_F0
CYREG_B0_UDB02_F0 EQU 0x40006442
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB03_F0
CYREG_B0_UDB03_F0 EQU 0x40006443
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB04_F0
CYREG_B0_UDB04_F0 EQU 0x40006444
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB05_F0
CYREG_B0_UDB05_F0 EQU 0x40006445
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB06_F0
CYREG_B0_UDB06_F0 EQU 0x40006446
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB07_F0
CYREG_B0_UDB07_F0 EQU 0x40006447
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB08_F0
CYREG_B0_UDB08_F0 EQU 0x40006448
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB09_F0
CYREG_B0_UDB09_F0 EQU 0x40006449
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB10_F0
CYREG_B0_UDB10_F0 EQU 0x4000644a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB11_F0
CYREG_B0_UDB11_F0 EQU 0x4000644b
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB12_F0
CYREG_B0_UDB12_F0 EQU 0x4000644c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB13_F0
CYREG_B0_UDB13_F0 EQU 0x4000644d
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB14_F0
CYREG_B0_UDB14_F0 EQU 0x4000644e
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB15_F0
CYREG_B0_UDB15_F0 EQU 0x4000644f
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB00_F1
CYREG_B0_UDB00_F1 EQU 0x40006450
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB01_F1
CYREG_B0_UDB01_F1 EQU 0x40006451
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB02_F1
CYREG_B0_UDB02_F1 EQU 0x40006452
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB03_F1
CYREG_B0_UDB03_F1 EQU 0x40006453
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB04_F1
CYREG_B0_UDB04_F1 EQU 0x40006454
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB05_F1
CYREG_B0_UDB05_F1 EQU 0x40006455
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB06_F1
CYREG_B0_UDB06_F1 EQU 0x40006456
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB07_F1
CYREG_B0_UDB07_F1 EQU 0x40006457
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB08_F1
CYREG_B0_UDB08_F1 EQU 0x40006458
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB09_F1
CYREG_B0_UDB09_F1 EQU 0x40006459
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB10_F1
CYREG_B0_UDB10_F1 EQU 0x4000645a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB11_F1
CYREG_B0_UDB11_F1 EQU 0x4000645b
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB12_F1
CYREG_B0_UDB12_F1 EQU 0x4000645c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB13_F1
CYREG_B0_UDB13_F1 EQU 0x4000645d
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB14_F1
CYREG_B0_UDB14_F1 EQU 0x4000645e
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB15_F1
CYREG_B0_UDB15_F1 EQU 0x4000645f
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB00_ST
CYREG_B0_UDB00_ST EQU 0x40006460
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB01_ST
CYREG_B0_UDB01_ST EQU 0x40006461
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB02_ST
CYREG_B0_UDB02_ST EQU 0x40006462
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB03_ST
CYREG_B0_UDB03_ST EQU 0x40006463
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB04_ST
CYREG_B0_UDB04_ST EQU 0x40006464
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB05_ST
CYREG_B0_UDB05_ST EQU 0x40006465
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB06_ST
CYREG_B0_UDB06_ST EQU 0x40006466
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB07_ST
CYREG_B0_UDB07_ST EQU 0x40006467
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB08_ST
CYREG_B0_UDB08_ST EQU 0x40006468
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB09_ST
CYREG_B0_UDB09_ST EQU 0x40006469
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB10_ST
CYREG_B0_UDB10_ST EQU 0x4000646a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB11_ST
CYREG_B0_UDB11_ST EQU 0x4000646b
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB12_ST
CYREG_B0_UDB12_ST EQU 0x4000646c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB13_ST
CYREG_B0_UDB13_ST EQU 0x4000646d
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB14_ST
CYREG_B0_UDB14_ST EQU 0x4000646e
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB15_ST
