MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cydevicerv_trm.inc
CYREG_B0_UDB15_ST EQU 0x4000646f
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB00_CTL
CYREG_B0_UDB00_CTL EQU 0x40006470
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB01_CTL
CYREG_B0_UDB01_CTL EQU 0x40006471
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB02_CTL
CYREG_B0_UDB02_CTL EQU 0x40006472
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB03_CTL
CYREG_B0_UDB03_CTL EQU 0x40006473
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB04_CTL
CYREG_B0_UDB04_CTL EQU 0x40006474
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB05_CTL
CYREG_B0_UDB05_CTL EQU 0x40006475
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB06_CTL
CYREG_B0_UDB06_CTL EQU 0x40006476
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB07_CTL
CYREG_B0_UDB07_CTL EQU 0x40006477
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB08_CTL
CYREG_B0_UDB08_CTL EQU 0x40006478
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB09_CTL
CYREG_B0_UDB09_CTL EQU 0x40006479
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB10_CTL
CYREG_B0_UDB10_CTL EQU 0x4000647a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB11_CTL
CYREG_B0_UDB11_CTL EQU 0x4000647b
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB12_CTL
CYREG_B0_UDB12_CTL EQU 0x4000647c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB13_CTL
CYREG_B0_UDB13_CTL EQU 0x4000647d
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB14_CTL
CYREG_B0_UDB14_CTL EQU 0x4000647e
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB15_CTL
CYREG_B0_UDB15_CTL EQU 0x4000647f
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB00_MSK
CYREG_B0_UDB00_MSK EQU 0x40006480
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB01_MSK
CYREG_B0_UDB01_MSK EQU 0x40006481
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB02_MSK
CYREG_B0_UDB02_MSK EQU 0x40006482
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB03_MSK
CYREG_B0_UDB03_MSK EQU 0x40006483
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB04_MSK
CYREG_B0_UDB04_MSK EQU 0x40006484
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB05_MSK
CYREG_B0_UDB05_MSK EQU 0x40006485
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB06_MSK
CYREG_B0_UDB06_MSK EQU 0x40006486
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB07_MSK
CYREG_B0_UDB07_MSK EQU 0x40006487
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB08_MSK
CYREG_B0_UDB08_MSK EQU 0x40006488
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB09_MSK
CYREG_B0_UDB09_MSK EQU 0x40006489
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB10_MSK
CYREG_B0_UDB10_MSK EQU 0x4000648a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB11_MSK
CYREG_B0_UDB11_MSK EQU 0x4000648b
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB12_MSK
CYREG_B0_UDB12_MSK EQU 0x4000648c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB13_MSK
CYREG_B0_UDB13_MSK EQU 0x4000648d
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB14_MSK
CYREG_B0_UDB14_MSK EQU 0x4000648e
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB15_MSK
CYREG_B0_UDB15_MSK EQU 0x4000648f
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB00_ACTL
CYREG_B0_UDB00_ACTL EQU 0x40006490
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB01_ACTL
CYREG_B0_UDB01_ACTL EQU 0x40006491
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB02_ACTL
CYREG_B0_UDB02_ACTL EQU 0x40006492
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB03_ACTL
CYREG_B0_UDB03_ACTL EQU 0x40006493
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB04_ACTL
CYREG_B0_UDB04_ACTL EQU 0x40006494
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB05_ACTL
CYREG_B0_UDB05_ACTL EQU 0x40006495
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB06_ACTL
CYREG_B0_UDB06_ACTL EQU 0x40006496
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB07_ACTL
CYREG_B0_UDB07_ACTL EQU 0x40006497
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB08_ACTL
CYREG_B0_UDB08_ACTL EQU 0x40006498
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB09_ACTL
CYREG_B0_UDB09_ACTL EQU 0x40006499
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB10_ACTL
CYREG_B0_UDB10_ACTL EQU 0x4000649a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB11_ACTL
CYREG_B0_UDB11_ACTL EQU 0x4000649b
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB12_ACTL
CYREG_B0_UDB12_ACTL EQU 0x4000649c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB13_ACTL
CYREG_B0_UDB13_ACTL EQU 0x4000649d
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB14_ACTL
CYREG_B0_UDB14_ACTL EQU 0x4000649e
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB15_ACTL
CYREG_B0_UDB15_ACTL EQU 0x4000649f
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB00_MC
CYREG_B0_UDB00_MC EQU 0x400064a0
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB01_MC
CYREG_B0_UDB01_MC EQU 0x400064a1
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB02_MC
CYREG_B0_UDB02_MC EQU 0x400064a2
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB03_MC
CYREG_B0_UDB03_MC EQU 0x400064a3
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB04_MC
CYREG_B0_UDB04_MC EQU 0x400064a4
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB05_MC
CYREG_B0_UDB05_MC EQU 0x400064a5
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB06_MC
CYREG_B0_UDB06_MC EQU 0x400064a6
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB07_MC
CYREG_B0_UDB07_MC EQU 0x400064a7
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB08_MC
CYREG_B0_UDB08_MC EQU 0x400064a8
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB09_MC
CYREG_B0_UDB09_MC EQU 0x400064a9
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB10_MC
CYREG_B0_UDB10_MC EQU 0x400064aa
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB11_MC
CYREG_B0_UDB11_MC EQU 0x400064ab
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB12_MC
CYREG_B0_UDB12_MC EQU 0x400064ac
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB13_MC
CYREG_B0_UDB13_MC EQU 0x400064ad
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB14_MC
CYREG_B0_UDB14_MC EQU 0x400064ae
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB15_MC
CYREG_B0_UDB15_MC EQU 0x400064af
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_BASE
CYDEV_UWRK_UWRK8_B1_BASE EQU 0x40006500
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_SIZE
CYDEV_UWRK_UWRK8_B1_SIZE EQU 0x000000b0
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB04_A0
CYREG_B1_UDB04_A0 EQU 0x40006504
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB05_A0
CYREG_B1_UDB05_A0 EQU 0x40006505
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB06_A0
CYREG_B1_UDB06_A0 EQU 0x40006506
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB07_A0
CYREG_B1_UDB07_A0 EQU 0x40006507
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB08_A0
CYREG_B1_UDB08_A0 EQU 0x40006508
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB09_A0
CYREG_B1_UDB09_A0 EQU 0x40006509
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB10_A0
CYREG_B1_UDB10_A0 EQU 0x4000650a
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB11_A0
CYREG_B1_UDB11_A0 EQU 0x4000650b
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB04_A1
CYREG_B1_UDB04_A1 EQU 0x40006514
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB05_A1
CYREG_B1_UDB05_A1 EQU 0x40006515
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB06_A1
CYREG_B1_UDB06_A1 EQU 0x40006516
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB07_A1
CYREG_B1_UDB07_A1 EQU 0x40006517
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB08_A1
CYREG_B1_UDB08_A1 EQU 0x40006518
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB09_A1
CYREG_B1_UDB09_A1 EQU 0x40006519
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB10_A1
CYREG_B1_UDB10_A1 EQU 0x4000651a
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB11_A1
CYREG_B1_UDB11_A1 EQU 0x4000651b
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB04_D0
CYREG_B1_UDB04_D0 EQU 0x40006524
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB05_D0
CYREG_B1_UDB05_D0 EQU 0x40006525
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB06_D0
CYREG_B1_UDB06_D0 EQU 0x40006526
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB07_D0
CYREG_B1_UDB07_D0 EQU 0x40006527
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB08_D0
CYREG_B1_UDB08_D0 EQU 0x40006528
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB09_D0
CYREG_B1_UDB09_D0 EQU 0x40006529
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB10_D0
CYREG_B1_UDB10_D0 EQU 0x4000652a
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB11_D0
CYREG_B1_UDB11_D0 EQU 0x4000652b
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB04_D1
CYREG_B1_UDB04_D1 EQU 0x40006534
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB05_D1
CYREG_B1_UDB05_D1 EQU 0x40006535
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB06_D1
CYREG_B1_UDB06_D1 EQU 0x40006536
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB07_D1
CYREG_B1_UDB07_D1 EQU 0x40006537
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB08_D1
CYREG_B1_UDB08_D1 EQU 0x40006538
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB09_D1
CYREG_B1_UDB09_D1 EQU 0x40006539
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB10_D1
CYREG_B1_UDB10_D1 EQU 0x4000653a
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB11_D1
CYREG_B1_UDB11_D1 EQU 0x4000653b
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB04_F0
CYREG_B1_UDB04_F0 EQU 0x40006544
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB05_F0
CYREG_B1_UDB05_F0 EQU 0x40006545
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB06_F0
CYREG_B1_UDB06_F0 EQU 0x40006546
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB07_F0
CYREG_B1_UDB07_F0 EQU 0x40006547
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB08_F0
CYREG_B1_UDB08_F0 EQU 0x40006548
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB09_F0
CYREG_B1_UDB09_F0 EQU 0x40006549
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB10_F0
CYREG_B1_UDB10_F0 EQU 0x4000654a
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB11_F0
CYREG_B1_UDB11_F0 EQU 0x4000654b
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB04_F1
CYREG_B1_UDB04_F1 EQU 0x40006554
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB05_F1
CYREG_B1_UDB05_F1 EQU 0x40006555
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB06_F1
CYREG_B1_UDB06_F1 EQU 0x40006556
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB07_F1
CYREG_B1_UDB07_F1 EQU 0x40006557
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB08_F1
CYREG_B1_UDB08_F1 EQU 0x40006558
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB09_F1
CYREG_B1_UDB09_F1 EQU 0x40006559
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB10_F1
CYREG_B1_UDB10_F1 EQU 0x4000655a
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB11_F1
CYREG_B1_UDB11_F1 EQU 0x4000655b
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB04_ST
CYREG_B1_UDB04_ST EQU 0x40006564
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB05_ST
CYREG_B1_UDB05_ST EQU 0x40006565
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB06_ST
CYREG_B1_UDB06_ST EQU 0x40006566
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB07_ST
CYREG_B1_UDB07_ST EQU 0x40006567
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB08_ST
CYREG_B1_UDB08_ST EQU 0x40006568
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB09_ST
CYREG_B1_UDB09_ST EQU 0x40006569
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB10_ST
CYREG_B1_UDB10_ST EQU 0x4000656a
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB11_ST
CYREG_B1_UDB11_ST EQU 0x4000656b
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB04_CTL
CYREG_B1_UDB04_CTL EQU 0x40006574
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB05_CTL
CYREG_B1_UDB05_CTL EQU 0x40006575
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB06_CTL
CYREG_B1_UDB06_CTL EQU 0x40006576
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB07_CTL
CYREG_B1_UDB07_CTL EQU 0x40006577
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB08_CTL
CYREG_B1_UDB08_CTL EQU 0x40006578
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB09_CTL
CYREG_B1_UDB09_CTL EQU 0x40006579
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB10_CTL
CYREG_B1_UDB10_CTL EQU 0x4000657a
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB11_CTL
CYREG_B1_UDB11_CTL EQU 0x4000657b
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB04_MSK
CYREG_B1_UDB04_MSK EQU 0x40006584
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB05_MSK
CYREG_B1_UDB05_MSK EQU 0x40006585
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB06_MSK
CYREG_B1_UDB06_MSK EQU 0x40006586
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB07_MSK
CYREG_B1_UDB07_MSK EQU 0x40006587
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB08_MSK
CYREG_B1_UDB08_MSK EQU 0x40006588
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB09_MSK
CYREG_B1_UDB09_MSK EQU 0x40006589
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB10_MSK
CYREG_B1_UDB10_MSK EQU 0x4000658a
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB11_MSK
CYREG_B1_UDB11_MSK EQU 0x4000658b
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB04_ACTL
CYREG_B1_UDB04_ACTL EQU 0x40006594
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB05_ACTL
CYREG_B1_UDB05_ACTL EQU 0x40006595
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB06_ACTL
CYREG_B1_UDB06_ACTL EQU 0x40006596
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB07_ACTL
CYREG_B1_UDB07_ACTL EQU 0x40006597
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB08_ACTL
CYREG_B1_UDB08_ACTL EQU 0x40006598
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB09_ACTL
CYREG_B1_UDB09_ACTL EQU 0x40006599
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB10_ACTL
CYREG_B1_UDB10_ACTL EQU 0x4000659a
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB11_ACTL
CYREG_B1_UDB11_ACTL EQU 0x4000659b
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB04_MC
CYREG_B1_UDB04_MC EQU 0x400065a4
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB05_MC
CYREG_B1_UDB05_MC EQU 0x400065a5
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB06_MC
CYREG_B1_UDB06_MC EQU 0x400065a6
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB07_MC
CYREG_B1_UDB07_MC EQU 0x400065a7
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB08_MC
CYREG_B1_UDB08_MC EQU 0x400065a8
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB09_MC
CYREG_B1_UDB09_MC EQU 0x400065a9
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB10_MC
CYREG_B1_UDB10_MC EQU 0x400065aa
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB11_MC
CYREG_B1_UDB11_MC EQU 0x400065ab
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_BASE
CYDEV_UWRK_UWRK16_BASE EQU 0x40006800
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_SIZE
CYDEV_UWRK_UWRK16_SIZE EQU 0x00000760
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_BASE
CYDEV_UWRK_UWRK16_CAT_BASE EQU 0x40006800
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_SIZE
CYDEV_UWRK_UWRK16_CAT_SIZE EQU 0x00000760
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_BASE
CYDEV_UWRK_UWRK16_CAT_B0_BASE EQU 0x40006800
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_SIZE
CYDEV_UWRK_UWRK16_CAT_B0_SIZE EQU 0x00000160
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB00_A0_A1
CYREG_B0_UDB00_A0_A1 EQU 0x40006800
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB01_A0_A1
CYREG_B0_UDB01_A0_A1 EQU 0x40006802
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB02_A0_A1
CYREG_B0_UDB02_A0_A1 EQU 0x40006804
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB03_A0_A1
CYREG_B0_UDB03_A0_A1 EQU 0x40006806
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB04_A0_A1
CYREG_B0_UDB04_A0_A1 EQU 0x40006808
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB05_A0_A1
CYREG_B0_UDB05_A0_A1 EQU 0x4000680a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB06_A0_A1
CYREG_B0_UDB06_A0_A1 EQU 0x4000680c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB07_A0_A1
CYREG_B0_UDB07_A0_A1 EQU 0x4000680e
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB08_A0_A1
CYREG_B0_UDB08_A0_A1 EQU 0x40006810
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB09_A0_A1
CYREG_B0_UDB09_A0_A1 EQU 0x40006812
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB10_A0_A1
CYREG_B0_UDB10_A0_A1 EQU 0x40006814
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB11_A0_A1
CYREG_B0_UDB11_A0_A1 EQU 0x40006816
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB12_A0_A1
CYREG_B0_UDB12_A0_A1 EQU 0x40006818
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB13_A0_A1
CYREG_B0_UDB13_A0_A1 EQU 0x4000681a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB14_A0_A1
CYREG_B0_UDB14_A0_A1 EQU 0x4000681c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB15_A0_A1
CYREG_B0_UDB15_A0_A1 EQU 0x4000681e
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB00_D0_D1
CYREG_B0_UDB00_D0_D1 EQU 0x40006840
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB01_D0_D1
CYREG_B0_UDB01_D0_D1 EQU 0x40006842
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB02_D0_D1
CYREG_B0_UDB02_D0_D1 EQU 0x40006844
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB03_D0_D1
CYREG_B0_UDB03_D0_D1 EQU 0x40006846
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB04_D0_D1
CYREG_B0_UDB04_D0_D1 EQU 0x40006848
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB05_D0_D1
CYREG_B0_UDB05_D0_D1 EQU 0x4000684a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB06_D0_D1
CYREG_B0_UDB06_D0_D1 EQU 0x4000684c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB07_D0_D1
CYREG_B0_UDB07_D0_D1 EQU 0x4000684e
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB08_D0_D1
CYREG_B0_UDB08_D0_D1 EQU 0x40006850
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB09_D0_D1
CYREG_B0_UDB09_D0_D1 EQU 0x40006852
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB10_D0_D1
CYREG_B0_UDB10_D0_D1 EQU 0x40006854
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB11_D0_D1
CYREG_B0_UDB11_D0_D1 EQU 0x40006856
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB12_D0_D1
CYREG_B0_UDB12_D0_D1 EQU 0x40006858
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB13_D0_D1
CYREG_B0_UDB13_D0_D1 EQU 0x4000685a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB14_D0_D1
CYREG_B0_UDB14_D0_D1 EQU 0x4000685c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB15_D0_D1
CYREG_B0_UDB15_D0_D1 EQU 0x4000685e
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB00_F0_F1
CYREG_B0_UDB00_F0_F1 EQU 0x40006880
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB01_F0_F1
CYREG_B0_UDB01_F0_F1 EQU 0x40006882
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB02_F0_F1
CYREG_B0_UDB02_F0_F1 EQU 0x40006884
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB03_F0_F1
CYREG_B0_UDB03_F0_F1 EQU 0x40006886
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB04_F0_F1
CYREG_B0_UDB04_F0_F1 EQU 0x40006888
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB05_F0_F1
CYREG_B0_UDB05_F0_F1 EQU 0x4000688a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB06_F0_F1
CYREG_B0_UDB06_F0_F1 EQU 0x4000688c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB07_F0_F1
CYREG_B0_UDB07_F0_F1 EQU 0x4000688e
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB08_F0_F1
CYREG_B0_UDB08_F0_F1 EQU 0x40006890
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB09_F0_F1
CYREG_B0_UDB09_F0_F1 EQU 0x40006892
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB10_F0_F1
CYREG_B0_UDB10_F0_F1 EQU 0x40006894
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB11_F0_F1
CYREG_B0_UDB11_F0_F1 EQU 0x40006896
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB12_F0_F1
CYREG_B0_UDB12_F0_F1 EQU 0x40006898
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB13_F0_F1
CYREG_B0_UDB13_F0_F1 EQU 0x4000689a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB14_F0_F1
CYREG_B0_UDB14_F0_F1 EQU 0x4000689c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB15_F0_F1
CYREG_B0_UDB15_F0_F1 EQU 0x4000689e
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB00_ST_CTL
CYREG_B0_UDB00_ST_CTL EQU 0x400068c0
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB01_ST_CTL
CYREG_B0_UDB01_ST_CTL EQU 0x400068c2
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB02_ST_CTL
CYREG_B0_UDB02_ST_CTL EQU 0x400068c4
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB03_ST_CTL
CYREG_B0_UDB03_ST_CTL EQU 0x400068c6
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB04_ST_CTL
CYREG_B0_UDB04_ST_CTL EQU 0x400068c8
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB05_ST_CTL
CYREG_B0_UDB05_ST_CTL EQU 0x400068ca
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB06_ST_CTL
CYREG_B0_UDB06_ST_CTL EQU 0x400068cc
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB07_ST_CTL
CYREG_B0_UDB07_ST_CTL EQU 0x400068ce
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB08_ST_CTL
CYREG_B0_UDB08_ST_CTL EQU 0x400068d0
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB09_ST_CTL
CYREG_B0_UDB09_ST_CTL EQU 0x400068d2
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB10_ST_CTL
CYREG_B0_UDB10_ST_CTL EQU 0x400068d4
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB11_ST_CTL
CYREG_B0_UDB11_ST_CTL EQU 0x400068d6
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB12_ST_CTL
CYREG_B0_UDB12_ST_CTL EQU 0x400068d8
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB13_ST_CTL
CYREG_B0_UDB13_ST_CTL EQU 0x400068da
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB14_ST_CTL
CYREG_B0_UDB14_ST_CTL EQU 0x400068dc
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB15_ST_CTL
CYREG_B0_UDB15_ST_CTL EQU 0x400068de
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB00_MSK_ACTL
CYREG_B0_UDB00_MSK_ACTL EQU 0x40006900
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB01_MSK_ACTL
CYREG_B0_UDB01_MSK_ACTL EQU 0x40006902
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB02_MSK_ACTL
CYREG_B0_UDB02_MSK_ACTL EQU 0x40006904
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB03_MSK_ACTL
CYREG_B0_UDB03_MSK_ACTL EQU 0x40006906
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB04_MSK_ACTL
CYREG_B0_UDB04_MSK_ACTL EQU 0x40006908
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB05_MSK_ACTL
CYREG_B0_UDB05_MSK_ACTL EQU 0x4000690a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB06_MSK_ACTL
CYREG_B0_UDB06_MSK_ACTL EQU 0x4000690c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB07_MSK_ACTL
CYREG_B0_UDB07_MSK_ACTL EQU 0x4000690e
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB08_MSK_ACTL
CYREG_B0_UDB08_MSK_ACTL EQU 0x40006910
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB09_MSK_ACTL
CYREG_B0_UDB09_MSK_ACTL EQU 0x40006912
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB10_MSK_ACTL
CYREG_B0_UDB10_MSK_ACTL EQU 0x40006914
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB11_MSK_ACTL
CYREG_B0_UDB11_MSK_ACTL EQU 0x40006916
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB12_MSK_ACTL
CYREG_B0_UDB12_MSK_ACTL EQU 0x40006918
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB13_MSK_ACTL
CYREG_B0_UDB13_MSK_ACTL EQU 0x4000691a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB14_MSK_ACTL
CYREG_B0_UDB14_MSK_ACTL EQU 0x4000691c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB15_MSK_ACTL
CYREG_B0_UDB15_MSK_ACTL EQU 0x4000691e
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB00_MC_00
CYREG_B0_UDB00_MC_00 EQU 0x40006940
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB01_MC_00
CYREG_B0_UDB01_MC_00 EQU 0x40006942
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB02_MC_00
CYREG_B0_UDB02_MC_00 EQU 0x40006944
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB03_MC_00
CYREG_B0_UDB03_MC_00 EQU 0x40006946
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB04_MC_00
CYREG_B0_UDB04_MC_00 EQU 0x40006948
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB05_MC_00
CYREG_B0_UDB05_MC_00 EQU 0x4000694a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB06_MC_00
CYREG_B0_UDB06_MC_00 EQU 0x4000694c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB07_MC_00
CYREG_B0_UDB07_MC_00 EQU 0x4000694e
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB08_MC_00
CYREG_B0_UDB08_MC_00 EQU 0x40006950
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB09_MC_00
CYREG_B0_UDB09_MC_00 EQU 0x40006952
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB10_MC_00
CYREG_B0_UDB10_MC_00 EQU 0x40006954
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB11_MC_00
CYREG_B0_UDB11_MC_00 EQU 0x40006956
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB12_MC_00
CYREG_B0_UDB12_MC_00 EQU 0x40006958
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB13_MC_00
CYREG_B0_UDB13_MC_00 EQU 0x4000695a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB14_MC_00
CYREG_B0_UDB14_MC_00 EQU 0x4000695c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB15_MC_00
CYREG_B0_UDB15_MC_00 EQU 0x4000695e
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B1_BASE
CYDEV_UWRK_UWRK16_CAT_B1_BASE EQU 0x40006a00
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B1_SIZE
CYDEV_UWRK_UWRK16_CAT_B1_SIZE EQU 0x00000160
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB04_A0_A1
CYREG_B1_UDB04_A0_A1 EQU 0x40006a08
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB05_A0_A1
CYREG_B1_UDB05_A0_A1 EQU 0x40006a0a
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB06_A0_A1
CYREG_B1_UDB06_A0_A1 EQU 0x40006a0c
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB07_A0_A1
CYREG_B1_UDB07_A0_A1 EQU 0x40006a0e
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB08_A0_A1
CYREG_B1_UDB08_A0_A1 EQU 0x40006a10
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB09_A0_A1
CYREG_B1_UDB09_A0_A1 EQU 0x40006a12
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB10_A0_A1
CYREG_B1_UDB10_A0_A1 EQU 0x40006a14
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB11_A0_A1
CYREG_B1_UDB11_A0_A1 EQU 0x40006a16
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB04_D0_D1
CYREG_B1_UDB04_D0_D1 EQU 0x40006a48
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB05_D0_D1
CYREG_B1_UDB05_D0_D1 EQU 0x40006a4a
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB06_D0_D1
CYREG_B1_UDB06_D0_D1 EQU 0x40006a4c
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB07_D0_D1
CYREG_B1_UDB07_D0_D1 EQU 0x40006a4e
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB08_D0_D1
CYREG_B1_UDB08_D0_D1 EQU 0x40006a50
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB09_D0_D1
CYREG_B1_UDB09_D0_D1 EQU 0x40006a52
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB10_D0_D1
CYREG_B1_UDB10_D0_D1 EQU 0x40006a54
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB11_D0_D1
CYREG_B1_UDB11_D0_D1 EQU 0x40006a56
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB04_F0_F1
CYREG_B1_UDB04_F0_F1 EQU 0x40006a88
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB05_F0_F1
CYREG_B1_UDB05_F0_F1 EQU 0x40006a8a
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB06_F0_F1
CYREG_B1_UDB06_F0_F1 EQU 0x40006a8c
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB07_F0_F1
