MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cydevicerv_trm.inc
CYREG_B1_UDB07_F0_F1 EQU 0x40006a8e
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB08_F0_F1
CYREG_B1_UDB08_F0_F1 EQU 0x40006a90
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB09_F0_F1
CYREG_B1_UDB09_F0_F1 EQU 0x40006a92
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB10_F0_F1
CYREG_B1_UDB10_F0_F1 EQU 0x40006a94
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB11_F0_F1
CYREG_B1_UDB11_F0_F1 EQU 0x40006a96
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB04_ST_CTL
CYREG_B1_UDB04_ST_CTL EQU 0x40006ac8
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB05_ST_CTL
CYREG_B1_UDB05_ST_CTL EQU 0x40006aca
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB06_ST_CTL
CYREG_B1_UDB06_ST_CTL EQU 0x40006acc
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB07_ST_CTL
CYREG_B1_UDB07_ST_CTL EQU 0x40006ace
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB08_ST_CTL
CYREG_B1_UDB08_ST_CTL EQU 0x40006ad0
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB09_ST_CTL
CYREG_B1_UDB09_ST_CTL EQU 0x40006ad2
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB10_ST_CTL
CYREG_B1_UDB10_ST_CTL EQU 0x40006ad4
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB11_ST_CTL
CYREG_B1_UDB11_ST_CTL EQU 0x40006ad6
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB04_MSK_ACTL
CYREG_B1_UDB04_MSK_ACTL EQU 0x40006b08
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB05_MSK_ACTL
CYREG_B1_UDB05_MSK_ACTL EQU 0x40006b0a
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB06_MSK_ACTL
CYREG_B1_UDB06_MSK_ACTL EQU 0x40006b0c
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB07_MSK_ACTL
CYREG_B1_UDB07_MSK_ACTL EQU 0x40006b0e
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB08_MSK_ACTL
CYREG_B1_UDB08_MSK_ACTL EQU 0x40006b10
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB09_MSK_ACTL
CYREG_B1_UDB09_MSK_ACTL EQU 0x40006b12
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB10_MSK_ACTL
CYREG_B1_UDB10_MSK_ACTL EQU 0x40006b14
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB11_MSK_ACTL
CYREG_B1_UDB11_MSK_ACTL EQU 0x40006b16
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB04_MC_00
CYREG_B1_UDB04_MC_00 EQU 0x40006b48
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB05_MC_00
CYREG_B1_UDB05_MC_00 EQU 0x40006b4a
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB06_MC_00
CYREG_B1_UDB06_MC_00 EQU 0x40006b4c
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB07_MC_00
CYREG_B1_UDB07_MC_00 EQU 0x40006b4e
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB08_MC_00
CYREG_B1_UDB08_MC_00 EQU 0x40006b50
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB09_MC_00
CYREG_B1_UDB09_MC_00 EQU 0x40006b52
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB10_MC_00
CYREG_B1_UDB10_MC_00 EQU 0x40006b54
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB11_MC_00
CYREG_B1_UDB11_MC_00 EQU 0x40006b56
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_BASE
CYDEV_UWRK_UWRK16_DEF_BASE EQU 0x40006800
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_SIZE
CYDEV_UWRK_UWRK16_DEF_SIZE EQU 0x0000075e
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B0_BASE
CYDEV_UWRK_UWRK16_DEF_B0_BASE EQU 0x40006800
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B0_SIZE
CYDEV_UWRK_UWRK16_DEF_B0_SIZE EQU 0x0000015e
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB00_01_A0
CYREG_B0_UDB00_01_A0 EQU 0x40006800
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB01_02_A0
CYREG_B0_UDB01_02_A0 EQU 0x40006802
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB02_03_A0
CYREG_B0_UDB02_03_A0 EQU 0x40006804
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB03_04_A0
CYREG_B0_UDB03_04_A0 EQU 0x40006806
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB04_05_A0
CYREG_B0_UDB04_05_A0 EQU 0x40006808
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB05_06_A0
CYREG_B0_UDB05_06_A0 EQU 0x4000680a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB06_07_A0
CYREG_B0_UDB06_07_A0 EQU 0x4000680c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB07_08_A0
CYREG_B0_UDB07_08_A0 EQU 0x4000680e
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB08_09_A0
CYREG_B0_UDB08_09_A0 EQU 0x40006810
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB09_10_A0
CYREG_B0_UDB09_10_A0 EQU 0x40006812
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB10_11_A0
CYREG_B0_UDB10_11_A0 EQU 0x40006814
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB11_12_A0
CYREG_B0_UDB11_12_A0 EQU 0x40006816
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB12_13_A0
CYREG_B0_UDB12_13_A0 EQU 0x40006818
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB13_14_A0
CYREG_B0_UDB13_14_A0 EQU 0x4000681a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB14_15_A0
CYREG_B0_UDB14_15_A0 EQU 0x4000681c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB00_01_A1
CYREG_B0_UDB00_01_A1 EQU 0x40006820
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB01_02_A1
CYREG_B0_UDB01_02_A1 EQU 0x40006822
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB02_03_A1
CYREG_B0_UDB02_03_A1 EQU 0x40006824
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB03_04_A1
CYREG_B0_UDB03_04_A1 EQU 0x40006826
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB04_05_A1
CYREG_B0_UDB04_05_A1 EQU 0x40006828
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB05_06_A1
CYREG_B0_UDB05_06_A1 EQU 0x4000682a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB06_07_A1
CYREG_B0_UDB06_07_A1 EQU 0x4000682c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB07_08_A1
CYREG_B0_UDB07_08_A1 EQU 0x4000682e
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB08_09_A1
CYREG_B0_UDB08_09_A1 EQU 0x40006830
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB09_10_A1
CYREG_B0_UDB09_10_A1 EQU 0x40006832
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB10_11_A1
CYREG_B0_UDB10_11_A1 EQU 0x40006834
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB11_12_A1
CYREG_B0_UDB11_12_A1 EQU 0x40006836
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB12_13_A1
CYREG_B0_UDB12_13_A1 EQU 0x40006838
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB13_14_A1
CYREG_B0_UDB13_14_A1 EQU 0x4000683a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB14_15_A1
CYREG_B0_UDB14_15_A1 EQU 0x4000683c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB00_01_D0
CYREG_B0_UDB00_01_D0 EQU 0x40006840
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB01_02_D0
CYREG_B0_UDB01_02_D0 EQU 0x40006842
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB02_03_D0
CYREG_B0_UDB02_03_D0 EQU 0x40006844
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB03_04_D0
CYREG_B0_UDB03_04_D0 EQU 0x40006846
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB04_05_D0
CYREG_B0_UDB04_05_D0 EQU 0x40006848
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB05_06_D0
CYREG_B0_UDB05_06_D0 EQU 0x4000684a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB06_07_D0
CYREG_B0_UDB06_07_D0 EQU 0x4000684c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB07_08_D0
CYREG_B0_UDB07_08_D0 EQU 0x4000684e
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB08_09_D0
CYREG_B0_UDB08_09_D0 EQU 0x40006850
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB09_10_D0
CYREG_B0_UDB09_10_D0 EQU 0x40006852
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB10_11_D0
CYREG_B0_UDB10_11_D0 EQU 0x40006854
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB11_12_D0
CYREG_B0_UDB11_12_D0 EQU 0x40006856
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB12_13_D0
CYREG_B0_UDB12_13_D0 EQU 0x40006858
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB13_14_D0
CYREG_B0_UDB13_14_D0 EQU 0x4000685a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB14_15_D0
CYREG_B0_UDB14_15_D0 EQU 0x4000685c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB00_01_D1
CYREG_B0_UDB00_01_D1 EQU 0x40006860
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB01_02_D1
CYREG_B0_UDB01_02_D1 EQU 0x40006862
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB02_03_D1
CYREG_B0_UDB02_03_D1 EQU 0x40006864
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB03_04_D1
CYREG_B0_UDB03_04_D1 EQU 0x40006866
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB04_05_D1
CYREG_B0_UDB04_05_D1 EQU 0x40006868
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB05_06_D1
CYREG_B0_UDB05_06_D1 EQU 0x4000686a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB06_07_D1
CYREG_B0_UDB06_07_D1 EQU 0x4000686c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB07_08_D1
CYREG_B0_UDB07_08_D1 EQU 0x4000686e
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB08_09_D1
CYREG_B0_UDB08_09_D1 EQU 0x40006870
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB09_10_D1
CYREG_B0_UDB09_10_D1 EQU 0x40006872
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB10_11_D1
CYREG_B0_UDB10_11_D1 EQU 0x40006874
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB11_12_D1
CYREG_B0_UDB11_12_D1 EQU 0x40006876
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB12_13_D1
CYREG_B0_UDB12_13_D1 EQU 0x40006878
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB13_14_D1
CYREG_B0_UDB13_14_D1 EQU 0x4000687a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB14_15_D1
CYREG_B0_UDB14_15_D1 EQU 0x4000687c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB00_01_F0
CYREG_B0_UDB00_01_F0 EQU 0x40006880
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB01_02_F0
CYREG_B0_UDB01_02_F0 EQU 0x40006882
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB02_03_F0
CYREG_B0_UDB02_03_F0 EQU 0x40006884
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB03_04_F0
CYREG_B0_UDB03_04_F0 EQU 0x40006886
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB04_05_F0
CYREG_B0_UDB04_05_F0 EQU 0x40006888
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB05_06_F0
CYREG_B0_UDB05_06_F0 EQU 0x4000688a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB06_07_F0
CYREG_B0_UDB06_07_F0 EQU 0x4000688c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB07_08_F0
CYREG_B0_UDB07_08_F0 EQU 0x4000688e
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB08_09_F0
CYREG_B0_UDB08_09_F0 EQU 0x40006890
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB09_10_F0
CYREG_B0_UDB09_10_F0 EQU 0x40006892
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB10_11_F0
CYREG_B0_UDB10_11_F0 EQU 0x40006894
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB11_12_F0
CYREG_B0_UDB11_12_F0 EQU 0x40006896
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB12_13_F0
CYREG_B0_UDB12_13_F0 EQU 0x40006898
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB13_14_F0
CYREG_B0_UDB13_14_F0 EQU 0x4000689a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB14_15_F0
CYREG_B0_UDB14_15_F0 EQU 0x4000689c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB00_01_F1
CYREG_B0_UDB00_01_F1 EQU 0x400068a0
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB01_02_F1
CYREG_B0_UDB01_02_F1 EQU 0x400068a2
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB02_03_F1
CYREG_B0_UDB02_03_F1 EQU 0x400068a4
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB03_04_F1
CYREG_B0_UDB03_04_F1 EQU 0x400068a6
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB04_05_F1
CYREG_B0_UDB04_05_F1 EQU 0x400068a8
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB05_06_F1
CYREG_B0_UDB05_06_F1 EQU 0x400068aa
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB06_07_F1
CYREG_B0_UDB06_07_F1 EQU 0x400068ac
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB07_08_F1
CYREG_B0_UDB07_08_F1 EQU 0x400068ae
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB08_09_F1
CYREG_B0_UDB08_09_F1 EQU 0x400068b0
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB09_10_F1
CYREG_B0_UDB09_10_F1 EQU 0x400068b2
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB10_11_F1
CYREG_B0_UDB10_11_F1 EQU 0x400068b4
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB11_12_F1
CYREG_B0_UDB11_12_F1 EQU 0x400068b6
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB12_13_F1
CYREG_B0_UDB12_13_F1 EQU 0x400068b8
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB13_14_F1
CYREG_B0_UDB13_14_F1 EQU 0x400068ba
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB14_15_F1
CYREG_B0_UDB14_15_F1 EQU 0x400068bc
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB00_01_ST
CYREG_B0_UDB00_01_ST EQU 0x400068c0
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB01_02_ST
CYREG_B0_UDB01_02_ST EQU 0x400068c2
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB02_03_ST
CYREG_B0_UDB02_03_ST EQU 0x400068c4
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB03_04_ST
CYREG_B0_UDB03_04_ST EQU 0x400068c6
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB04_05_ST
CYREG_B0_UDB04_05_ST EQU 0x400068c8
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB05_06_ST
CYREG_B0_UDB05_06_ST EQU 0x400068ca
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB06_07_ST
CYREG_B0_UDB06_07_ST EQU 0x400068cc
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB07_08_ST
CYREG_B0_UDB07_08_ST EQU 0x400068ce
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB08_09_ST
CYREG_B0_UDB08_09_ST EQU 0x400068d0
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB09_10_ST
CYREG_B0_UDB09_10_ST EQU 0x400068d2
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB10_11_ST
CYREG_B0_UDB10_11_ST EQU 0x400068d4
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB11_12_ST
CYREG_B0_UDB11_12_ST EQU 0x400068d6
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB12_13_ST
CYREG_B0_UDB12_13_ST EQU 0x400068d8
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB13_14_ST
CYREG_B0_UDB13_14_ST EQU 0x400068da
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB14_15_ST
CYREG_B0_UDB14_15_ST EQU 0x400068dc
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB00_01_CTL
CYREG_B0_UDB00_01_CTL EQU 0x400068e0
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB01_02_CTL
CYREG_B0_UDB01_02_CTL EQU 0x400068e2
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB02_03_CTL
CYREG_B0_UDB02_03_CTL EQU 0x400068e4
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB03_04_CTL
CYREG_B0_UDB03_04_CTL EQU 0x400068e6
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB04_05_CTL
CYREG_B0_UDB04_05_CTL EQU 0x400068e8
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB05_06_CTL
CYREG_B0_UDB05_06_CTL EQU 0x400068ea
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB06_07_CTL
CYREG_B0_UDB06_07_CTL EQU 0x400068ec
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB07_08_CTL
CYREG_B0_UDB07_08_CTL EQU 0x400068ee
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB08_09_CTL
CYREG_B0_UDB08_09_CTL EQU 0x400068f0
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB09_10_CTL
CYREG_B0_UDB09_10_CTL EQU 0x400068f2
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB10_11_CTL
CYREG_B0_UDB10_11_CTL EQU 0x400068f4
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB11_12_CTL
CYREG_B0_UDB11_12_CTL EQU 0x400068f6
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB12_13_CTL
CYREG_B0_UDB12_13_CTL EQU 0x400068f8
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB13_14_CTL
CYREG_B0_UDB13_14_CTL EQU 0x400068fa
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB14_15_CTL
CYREG_B0_UDB14_15_CTL EQU 0x400068fc
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB00_01_MSK
CYREG_B0_UDB00_01_MSK EQU 0x40006900
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB01_02_MSK
CYREG_B0_UDB01_02_MSK EQU 0x40006902
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB02_03_MSK
CYREG_B0_UDB02_03_MSK EQU 0x40006904
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB03_04_MSK
CYREG_B0_UDB03_04_MSK EQU 0x40006906
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB04_05_MSK
CYREG_B0_UDB04_05_MSK EQU 0x40006908
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB05_06_MSK
CYREG_B0_UDB05_06_MSK EQU 0x4000690a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB06_07_MSK
CYREG_B0_UDB06_07_MSK EQU 0x4000690c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB07_08_MSK
CYREG_B0_UDB07_08_MSK EQU 0x4000690e
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB08_09_MSK
CYREG_B0_UDB08_09_MSK EQU 0x40006910
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB09_10_MSK
CYREG_B0_UDB09_10_MSK EQU 0x40006912
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB10_11_MSK
CYREG_B0_UDB10_11_MSK EQU 0x40006914
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB11_12_MSK
CYREG_B0_UDB11_12_MSK EQU 0x40006916
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB12_13_MSK
CYREG_B0_UDB12_13_MSK EQU 0x40006918
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB13_14_MSK
CYREG_B0_UDB13_14_MSK EQU 0x4000691a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB14_15_MSK
CYREG_B0_UDB14_15_MSK EQU 0x4000691c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB00_01_ACTL
CYREG_B0_UDB00_01_ACTL EQU 0x40006920
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB01_02_ACTL
CYREG_B0_UDB01_02_ACTL EQU 0x40006922
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB02_03_ACTL
CYREG_B0_UDB02_03_ACTL EQU 0x40006924
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB03_04_ACTL
CYREG_B0_UDB03_04_ACTL EQU 0x40006926
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB04_05_ACTL
CYREG_B0_UDB04_05_ACTL EQU 0x40006928
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB05_06_ACTL
CYREG_B0_UDB05_06_ACTL EQU 0x4000692a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB06_07_ACTL
CYREG_B0_UDB06_07_ACTL EQU 0x4000692c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB07_08_ACTL
CYREG_B0_UDB07_08_ACTL EQU 0x4000692e
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB08_09_ACTL
CYREG_B0_UDB08_09_ACTL EQU 0x40006930
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB09_10_ACTL
CYREG_B0_UDB09_10_ACTL EQU 0x40006932
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB10_11_ACTL
CYREG_B0_UDB10_11_ACTL EQU 0x40006934
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB11_12_ACTL
CYREG_B0_UDB11_12_ACTL EQU 0x40006936
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB12_13_ACTL
CYREG_B0_UDB12_13_ACTL EQU 0x40006938
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB13_14_ACTL
CYREG_B0_UDB13_14_ACTL EQU 0x4000693a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB14_15_ACTL
CYREG_B0_UDB14_15_ACTL EQU 0x4000693c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB00_01_MC
CYREG_B0_UDB00_01_MC EQU 0x40006940
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB01_02_MC
CYREG_B0_UDB01_02_MC EQU 0x40006942
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB02_03_MC
CYREG_B0_UDB02_03_MC EQU 0x40006944
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB03_04_MC
CYREG_B0_UDB03_04_MC EQU 0x40006946
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB04_05_MC
CYREG_B0_UDB04_05_MC EQU 0x40006948
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB05_06_MC
CYREG_B0_UDB05_06_MC EQU 0x4000694a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB06_07_MC
CYREG_B0_UDB06_07_MC EQU 0x4000694c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB07_08_MC
CYREG_B0_UDB07_08_MC EQU 0x4000694e
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB08_09_MC
CYREG_B0_UDB08_09_MC EQU 0x40006950
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB09_10_MC
CYREG_B0_UDB09_10_MC EQU 0x40006952
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB10_11_MC
CYREG_B0_UDB10_11_MC EQU 0x40006954
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB11_12_MC
CYREG_B0_UDB11_12_MC EQU 0x40006956
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB12_13_MC
CYREG_B0_UDB12_13_MC EQU 0x40006958
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB13_14_MC
CYREG_B0_UDB13_14_MC EQU 0x4000695a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_UDB14_15_MC
CYREG_B0_UDB14_15_MC EQU 0x4000695c
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_BASE
CYDEV_UWRK_UWRK16_DEF_B1_BASE EQU 0x40006a00
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_SIZE
CYDEV_UWRK_UWRK16_DEF_B1_SIZE EQU 0x0000015e
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB04_05_A0
CYREG_B1_UDB04_05_A0 EQU 0x40006a08
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB05_06_A0
CYREG_B1_UDB05_06_A0 EQU 0x40006a0a
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB06_07_A0
CYREG_B1_UDB06_07_A0 EQU 0x40006a0c
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB07_08_A0
CYREG_B1_UDB07_08_A0 EQU 0x40006a0e
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB08_09_A0
CYREG_B1_UDB08_09_A0 EQU 0x40006a10
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB09_10_A0
CYREG_B1_UDB09_10_A0 EQU 0x40006a12
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB10_11_A0
CYREG_B1_UDB10_11_A0 EQU 0x40006a14
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB11_12_A0
CYREG_B1_UDB11_12_A0 EQU 0x40006a16
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB04_05_A1
CYREG_B1_UDB04_05_A1 EQU 0x40006a28
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB05_06_A1
CYREG_B1_UDB05_06_A1 EQU 0x40006a2a
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB06_07_A1
CYREG_B1_UDB06_07_A1 EQU 0x40006a2c
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB07_08_A1
CYREG_B1_UDB07_08_A1 EQU 0x40006a2e
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB08_09_A1
CYREG_B1_UDB08_09_A1 EQU 0x40006a30
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB09_10_A1
CYREG_B1_UDB09_10_A1 EQU 0x40006a32
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB10_11_A1
CYREG_B1_UDB10_11_A1 EQU 0x40006a34
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB11_12_A1
CYREG_B1_UDB11_12_A1 EQU 0x40006a36
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB04_05_D0
CYREG_B1_UDB04_05_D0 EQU 0x40006a48
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB05_06_D0
CYREG_B1_UDB05_06_D0 EQU 0x40006a4a
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB06_07_D0
CYREG_B1_UDB06_07_D0 EQU 0x40006a4c
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB07_08_D0
CYREG_B1_UDB07_08_D0 EQU 0x40006a4e
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB08_09_D0
CYREG_B1_UDB08_09_D0 EQU 0x40006a50
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB09_10_D0
CYREG_B1_UDB09_10_D0 EQU 0x40006a52
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB10_11_D0
CYREG_B1_UDB10_11_D0 EQU 0x40006a54
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB11_12_D0
CYREG_B1_UDB11_12_D0 EQU 0x40006a56
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB04_05_D1
CYREG_B1_UDB04_05_D1 EQU 0x40006a68
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB05_06_D1
CYREG_B1_UDB05_06_D1 EQU 0x40006a6a
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB06_07_D1
CYREG_B1_UDB06_07_D1 EQU 0x40006a6c
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB07_08_D1
CYREG_B1_UDB07_08_D1 EQU 0x40006a6e
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB08_09_D1
CYREG_B1_UDB08_09_D1 EQU 0x40006a70
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB09_10_D1
CYREG_B1_UDB09_10_D1 EQU 0x40006a72
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB10_11_D1
CYREG_B1_UDB10_11_D1 EQU 0x40006a74
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB11_12_D1
CYREG_B1_UDB11_12_D1 EQU 0x40006a76
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB04_05_F0
CYREG_B1_UDB04_05_F0 EQU 0x40006a88
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB05_06_F0
CYREG_B1_UDB05_06_F0 EQU 0x40006a8a
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB06_07_F0
CYREG_B1_UDB06_07_F0 EQU 0x40006a8c
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB07_08_F0
CYREG_B1_UDB07_08_F0 EQU 0x40006a8e
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB08_09_F0
CYREG_B1_UDB08_09_F0 EQU 0x40006a90
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB09_10_F0
CYREG_B1_UDB09_10_F0 EQU 0x40006a92
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB10_11_F0
CYREG_B1_UDB10_11_F0 EQU 0x40006a94
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB11_12_F0
CYREG_B1_UDB11_12_F0 EQU 0x40006a96
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB04_05_F1
CYREG_B1_UDB04_05_F1 EQU 0x40006aa8
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB05_06_F1
CYREG_B1_UDB05_06_F1 EQU 0x40006aaa
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB06_07_F1
CYREG_B1_UDB06_07_F1 EQU 0x40006aac
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB07_08_F1
CYREG_B1_UDB07_08_F1 EQU 0x40006aae
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB08_09_F1
CYREG_B1_UDB08_09_F1 EQU 0x40006ab0
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB09_10_F1
CYREG_B1_UDB09_10_F1 EQU 0x40006ab2
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB10_11_F1
CYREG_B1_UDB10_11_F1 EQU 0x40006ab4
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB11_12_F1
CYREG_B1_UDB11_12_F1 EQU 0x40006ab6
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB04_05_ST
CYREG_B1_UDB04_05_ST EQU 0x40006ac8
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB05_06_ST
CYREG_B1_UDB05_06_ST EQU 0x40006aca
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB06_07_ST
CYREG_B1_UDB06_07_ST EQU 0x40006acc
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB07_08_ST
CYREG_B1_UDB07_08_ST EQU 0x40006ace
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB08_09_ST
CYREG_B1_UDB08_09_ST EQU 0x40006ad0
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB09_10_ST
CYREG_B1_UDB09_10_ST EQU 0x40006ad2
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB10_11_ST
CYREG_B1_UDB10_11_ST EQU 0x40006ad4
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB11_12_ST
CYREG_B1_UDB11_12_ST EQU 0x40006ad6
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB04_05_CTL
CYREG_B1_UDB04_05_CTL EQU 0x40006ae8
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB05_06_CTL
CYREG_B1_UDB05_06_CTL EQU 0x40006aea
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB06_07_CTL
CYREG_B1_UDB06_07_CTL EQU 0x40006aec
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB07_08_CTL
CYREG_B1_UDB07_08_CTL EQU 0x40006aee
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB08_09_CTL
CYREG_B1_UDB08_09_CTL EQU 0x40006af0
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB09_10_CTL
CYREG_B1_UDB09_10_CTL EQU 0x40006af2
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB10_11_CTL
CYREG_B1_UDB10_11_CTL EQU 0x40006af4
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB11_12_CTL
CYREG_B1_UDB11_12_CTL EQU 0x40006af6
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB04_05_MSK
CYREG_B1_UDB04_05_MSK EQU 0x40006b08
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB05_06_MSK
CYREG_B1_UDB05_06_MSK EQU 0x40006b0a
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB06_07_MSK
CYREG_B1_UDB06_07_MSK EQU 0x40006b0c
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB07_08_MSK
CYREG_B1_UDB07_08_MSK EQU 0x40006b0e
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB08_09_MSK
CYREG_B1_UDB08_09_MSK EQU 0x40006b10
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB09_10_MSK
