MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cydevicerv_trm.inc
CYREG_B1_UDB09_10_MSK EQU 0x40006b12
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB10_11_MSK
CYREG_B1_UDB10_11_MSK EQU 0x40006b14
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB11_12_MSK
CYREG_B1_UDB11_12_MSK EQU 0x40006b16
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB04_05_ACTL
CYREG_B1_UDB04_05_ACTL EQU 0x40006b28
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB05_06_ACTL
CYREG_B1_UDB05_06_ACTL EQU 0x40006b2a
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB06_07_ACTL
CYREG_B1_UDB06_07_ACTL EQU 0x40006b2c
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB07_08_ACTL
CYREG_B1_UDB07_08_ACTL EQU 0x40006b2e
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB08_09_ACTL
CYREG_B1_UDB08_09_ACTL EQU 0x40006b30
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB09_10_ACTL
CYREG_B1_UDB09_10_ACTL EQU 0x40006b32
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB10_11_ACTL
CYREG_B1_UDB10_11_ACTL EQU 0x40006b34
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB11_12_ACTL
CYREG_B1_UDB11_12_ACTL EQU 0x40006b36
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB04_05_MC
CYREG_B1_UDB04_05_MC EQU 0x40006b48
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB05_06_MC
CYREG_B1_UDB05_06_MC EQU 0x40006b4a
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB06_07_MC
CYREG_B1_UDB06_07_MC EQU 0x40006b4c
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB07_08_MC
CYREG_B1_UDB07_08_MC EQU 0x40006b4e
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB08_09_MC
CYREG_B1_UDB08_09_MC EQU 0x40006b50
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB09_10_MC
CYREG_B1_UDB09_10_MC EQU 0x40006b52
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB10_11_MC
CYREG_B1_UDB10_11_MC EQU 0x40006b54
    ENDIF
    IF :LNOT::DEF:CYREG_B1_UDB11_12_MC
CYREG_B1_UDB11_12_MC EQU 0x40006b56
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_BASE
CYDEV_PHUB_BASE EQU 0x40007000
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_SIZE
CYDEV_PHUB_SIZE EQU 0x00000c00
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CFG
CYREG_PHUB_CFG EQU 0x40007000
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_ERR
CYREG_PHUB_ERR EQU 0x40007004
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_ERR_ADR
CYREG_PHUB_ERR_ADR EQU 0x40007008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH0_BASE
CYDEV_PHUB_CH0_BASE EQU 0x40007010
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH0_SIZE
CYDEV_PHUB_CH0_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH0_BASIC_CFG
CYREG_PHUB_CH0_BASIC_CFG EQU 0x40007010
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH0_ACTION
CYREG_PHUB_CH0_ACTION EQU 0x40007014
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH0_BASIC_STATUS
CYREG_PHUB_CH0_BASIC_STATUS EQU 0x40007018
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH1_BASE
CYDEV_PHUB_CH1_BASE EQU 0x40007020
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH1_SIZE
CYDEV_PHUB_CH1_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH1_BASIC_CFG
CYREG_PHUB_CH1_BASIC_CFG EQU 0x40007020
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH1_ACTION
CYREG_PHUB_CH1_ACTION EQU 0x40007024
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH1_BASIC_STATUS
CYREG_PHUB_CH1_BASIC_STATUS EQU 0x40007028
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH2_BASE
CYDEV_PHUB_CH2_BASE EQU 0x40007030
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH2_SIZE
CYDEV_PHUB_CH2_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH2_BASIC_CFG
CYREG_PHUB_CH2_BASIC_CFG EQU 0x40007030
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH2_ACTION
CYREG_PHUB_CH2_ACTION EQU 0x40007034
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH2_BASIC_STATUS
CYREG_PHUB_CH2_BASIC_STATUS EQU 0x40007038
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH3_BASE
CYDEV_PHUB_CH3_BASE EQU 0x40007040
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH3_SIZE
CYDEV_PHUB_CH3_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH3_BASIC_CFG
CYREG_PHUB_CH3_BASIC_CFG EQU 0x40007040
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH3_ACTION
CYREG_PHUB_CH3_ACTION EQU 0x40007044
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH3_BASIC_STATUS
CYREG_PHUB_CH3_BASIC_STATUS EQU 0x40007048
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH4_BASE
CYDEV_PHUB_CH4_BASE EQU 0x40007050
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH4_SIZE
CYDEV_PHUB_CH4_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH4_BASIC_CFG
CYREG_PHUB_CH4_BASIC_CFG EQU 0x40007050
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH4_ACTION
CYREG_PHUB_CH4_ACTION EQU 0x40007054
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH4_BASIC_STATUS
CYREG_PHUB_CH4_BASIC_STATUS EQU 0x40007058
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH5_BASE
CYDEV_PHUB_CH5_BASE EQU 0x40007060
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH5_SIZE
CYDEV_PHUB_CH5_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH5_BASIC_CFG
CYREG_PHUB_CH5_BASIC_CFG EQU 0x40007060
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH5_ACTION
CYREG_PHUB_CH5_ACTION EQU 0x40007064
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH5_BASIC_STATUS
CYREG_PHUB_CH5_BASIC_STATUS EQU 0x40007068
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH6_BASE
CYDEV_PHUB_CH6_BASE EQU 0x40007070
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH6_SIZE
CYDEV_PHUB_CH6_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH6_BASIC_CFG
CYREG_PHUB_CH6_BASIC_CFG EQU 0x40007070
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH6_ACTION
CYREG_PHUB_CH6_ACTION EQU 0x40007074
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH6_BASIC_STATUS
CYREG_PHUB_CH6_BASIC_STATUS EQU 0x40007078
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH7_BASE
CYDEV_PHUB_CH7_BASE EQU 0x40007080
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH7_SIZE
CYDEV_PHUB_CH7_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH7_BASIC_CFG
CYREG_PHUB_CH7_BASIC_CFG EQU 0x40007080
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH7_ACTION
CYREG_PHUB_CH7_ACTION EQU 0x40007084
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH7_BASIC_STATUS
CYREG_PHUB_CH7_BASIC_STATUS EQU 0x40007088
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH8_BASE
CYDEV_PHUB_CH8_BASE EQU 0x40007090
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH8_SIZE
CYDEV_PHUB_CH8_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH8_BASIC_CFG
CYREG_PHUB_CH8_BASIC_CFG EQU 0x40007090
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH8_ACTION
CYREG_PHUB_CH8_ACTION EQU 0x40007094
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH8_BASIC_STATUS
CYREG_PHUB_CH8_BASIC_STATUS EQU 0x40007098
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH9_BASE
CYDEV_PHUB_CH9_BASE EQU 0x400070a0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH9_SIZE
CYDEV_PHUB_CH9_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH9_BASIC_CFG
CYREG_PHUB_CH9_BASIC_CFG EQU 0x400070a0
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH9_ACTION
CYREG_PHUB_CH9_ACTION EQU 0x400070a4
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH9_BASIC_STATUS
CYREG_PHUB_CH9_BASIC_STATUS EQU 0x400070a8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH10_BASE
CYDEV_PHUB_CH10_BASE EQU 0x400070b0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH10_SIZE
CYDEV_PHUB_CH10_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH10_BASIC_CFG
CYREG_PHUB_CH10_BASIC_CFG EQU 0x400070b0
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH10_ACTION
CYREG_PHUB_CH10_ACTION EQU 0x400070b4
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH10_BASIC_STATUS
CYREG_PHUB_CH10_BASIC_STATUS EQU 0x400070b8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH11_BASE
CYDEV_PHUB_CH11_BASE EQU 0x400070c0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH11_SIZE
CYDEV_PHUB_CH11_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH11_BASIC_CFG
CYREG_PHUB_CH11_BASIC_CFG EQU 0x400070c0
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH11_ACTION
CYREG_PHUB_CH11_ACTION EQU 0x400070c4
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH11_BASIC_STATUS
CYREG_PHUB_CH11_BASIC_STATUS EQU 0x400070c8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH12_BASE
CYDEV_PHUB_CH12_BASE EQU 0x400070d0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH12_SIZE
CYDEV_PHUB_CH12_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH12_BASIC_CFG
CYREG_PHUB_CH12_BASIC_CFG EQU 0x400070d0
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH12_ACTION
CYREG_PHUB_CH12_ACTION EQU 0x400070d4
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH12_BASIC_STATUS
CYREG_PHUB_CH12_BASIC_STATUS EQU 0x400070d8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH13_BASE
CYDEV_PHUB_CH13_BASE EQU 0x400070e0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH13_SIZE
CYDEV_PHUB_CH13_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH13_BASIC_CFG
CYREG_PHUB_CH13_BASIC_CFG EQU 0x400070e0
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH13_ACTION
CYREG_PHUB_CH13_ACTION EQU 0x400070e4
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH13_BASIC_STATUS
CYREG_PHUB_CH13_BASIC_STATUS EQU 0x400070e8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH14_BASE
CYDEV_PHUB_CH14_BASE EQU 0x400070f0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH14_SIZE
CYDEV_PHUB_CH14_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH14_BASIC_CFG
CYREG_PHUB_CH14_BASIC_CFG EQU 0x400070f0
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH14_ACTION
CYREG_PHUB_CH14_ACTION EQU 0x400070f4
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH14_BASIC_STATUS
CYREG_PHUB_CH14_BASIC_STATUS EQU 0x400070f8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH15_BASE
CYDEV_PHUB_CH15_BASE EQU 0x40007100
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH15_SIZE
CYDEV_PHUB_CH15_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH15_BASIC_CFG
CYREG_PHUB_CH15_BASIC_CFG EQU 0x40007100
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH15_ACTION
CYREG_PHUB_CH15_ACTION EQU 0x40007104
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH15_BASIC_STATUS
CYREG_PHUB_CH15_BASIC_STATUS EQU 0x40007108
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH16_BASE
CYDEV_PHUB_CH16_BASE EQU 0x40007110
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH16_SIZE
CYDEV_PHUB_CH16_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH16_BASIC_CFG
CYREG_PHUB_CH16_BASIC_CFG EQU 0x40007110
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH16_ACTION
CYREG_PHUB_CH16_ACTION EQU 0x40007114
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH16_BASIC_STATUS
CYREG_PHUB_CH16_BASIC_STATUS EQU 0x40007118
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH17_BASE
CYDEV_PHUB_CH17_BASE EQU 0x40007120
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH17_SIZE
CYDEV_PHUB_CH17_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH17_BASIC_CFG
CYREG_PHUB_CH17_BASIC_CFG EQU 0x40007120
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH17_ACTION
CYREG_PHUB_CH17_ACTION EQU 0x40007124
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH17_BASIC_STATUS
CYREG_PHUB_CH17_BASIC_STATUS EQU 0x40007128
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH18_BASE
CYDEV_PHUB_CH18_BASE EQU 0x40007130
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH18_SIZE
CYDEV_PHUB_CH18_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH18_BASIC_CFG
CYREG_PHUB_CH18_BASIC_CFG EQU 0x40007130
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH18_ACTION
CYREG_PHUB_CH18_ACTION EQU 0x40007134
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH18_BASIC_STATUS
CYREG_PHUB_CH18_BASIC_STATUS EQU 0x40007138
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH19_BASE
CYDEV_PHUB_CH19_BASE EQU 0x40007140
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH19_SIZE
CYDEV_PHUB_CH19_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH19_BASIC_CFG
CYREG_PHUB_CH19_BASIC_CFG EQU 0x40007140
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH19_ACTION
CYREG_PHUB_CH19_ACTION EQU 0x40007144
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH19_BASIC_STATUS
CYREG_PHUB_CH19_BASIC_STATUS EQU 0x40007148
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH20_BASE
CYDEV_PHUB_CH20_BASE EQU 0x40007150
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH20_SIZE
CYDEV_PHUB_CH20_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH20_BASIC_CFG
CYREG_PHUB_CH20_BASIC_CFG EQU 0x40007150
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH20_ACTION
CYREG_PHUB_CH20_ACTION EQU 0x40007154
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH20_BASIC_STATUS
CYREG_PHUB_CH20_BASIC_STATUS EQU 0x40007158
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH21_BASE
CYDEV_PHUB_CH21_BASE EQU 0x40007160
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH21_SIZE
CYDEV_PHUB_CH21_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH21_BASIC_CFG
CYREG_PHUB_CH21_BASIC_CFG EQU 0x40007160
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH21_ACTION
CYREG_PHUB_CH21_ACTION EQU 0x40007164
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH21_BASIC_STATUS
CYREG_PHUB_CH21_BASIC_STATUS EQU 0x40007168
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH22_BASE
CYDEV_PHUB_CH22_BASE EQU 0x40007170
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH22_SIZE
CYDEV_PHUB_CH22_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH22_BASIC_CFG
CYREG_PHUB_CH22_BASIC_CFG EQU 0x40007170
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH22_ACTION
CYREG_PHUB_CH22_ACTION EQU 0x40007174
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH22_BASIC_STATUS
CYREG_PHUB_CH22_BASIC_STATUS EQU 0x40007178
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH23_BASE
CYDEV_PHUB_CH23_BASE EQU 0x40007180
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH23_SIZE
CYDEV_PHUB_CH23_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH23_BASIC_CFG
CYREG_PHUB_CH23_BASIC_CFG EQU 0x40007180
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH23_ACTION
CYREG_PHUB_CH23_ACTION EQU 0x40007184
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CH23_BASIC_STATUS
CYREG_PHUB_CH23_BASIC_STATUS EQU 0x40007188
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM0_BASE
CYDEV_PHUB_CFGMEM0_BASE EQU 0x40007600
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM0_SIZE
CYDEV_PHUB_CFGMEM0_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CFGMEM0_CFG0
CYREG_PHUB_CFGMEM0_CFG0 EQU 0x40007600
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CFGMEM0_CFG1
CYREG_PHUB_CFGMEM0_CFG1 EQU 0x40007604
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM1_BASE
CYDEV_PHUB_CFGMEM1_BASE EQU 0x40007608
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM1_SIZE
CYDEV_PHUB_CFGMEM1_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CFGMEM1_CFG0
CYREG_PHUB_CFGMEM1_CFG0 EQU 0x40007608
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CFGMEM1_CFG1
CYREG_PHUB_CFGMEM1_CFG1 EQU 0x4000760c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM2_BASE
CYDEV_PHUB_CFGMEM2_BASE EQU 0x40007610
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM2_SIZE
CYDEV_PHUB_CFGMEM2_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CFGMEM2_CFG0
CYREG_PHUB_CFGMEM2_CFG0 EQU 0x40007610
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CFGMEM2_CFG1
CYREG_PHUB_CFGMEM2_CFG1 EQU 0x40007614
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM3_BASE
CYDEV_PHUB_CFGMEM3_BASE EQU 0x40007618
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM3_SIZE
CYDEV_PHUB_CFGMEM3_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CFGMEM3_CFG0
CYREG_PHUB_CFGMEM3_CFG0 EQU 0x40007618
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CFGMEM3_CFG1
CYREG_PHUB_CFGMEM3_CFG1 EQU 0x4000761c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM4_BASE
CYDEV_PHUB_CFGMEM4_BASE EQU 0x40007620
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM4_SIZE
CYDEV_PHUB_CFGMEM4_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CFGMEM4_CFG0
CYREG_PHUB_CFGMEM4_CFG0 EQU 0x40007620
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CFGMEM4_CFG1
CYREG_PHUB_CFGMEM4_CFG1 EQU 0x40007624
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM5_BASE
CYDEV_PHUB_CFGMEM5_BASE EQU 0x40007628
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM5_SIZE
CYDEV_PHUB_CFGMEM5_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CFGMEM5_CFG0
CYREG_PHUB_CFGMEM5_CFG0 EQU 0x40007628
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CFGMEM5_CFG1
CYREG_PHUB_CFGMEM5_CFG1 EQU 0x4000762c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM6_BASE
CYDEV_PHUB_CFGMEM6_BASE EQU 0x40007630
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM6_SIZE
CYDEV_PHUB_CFGMEM6_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CFGMEM6_CFG0
CYREG_PHUB_CFGMEM6_CFG0 EQU 0x40007630
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CFGMEM6_CFG1
CYREG_PHUB_CFGMEM6_CFG1 EQU 0x40007634
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM7_BASE
CYDEV_PHUB_CFGMEM7_BASE EQU 0x40007638
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM7_SIZE
CYDEV_PHUB_CFGMEM7_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CFGMEM7_CFG0
CYREG_PHUB_CFGMEM7_CFG0 EQU 0x40007638
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CFGMEM7_CFG1
CYREG_PHUB_CFGMEM7_CFG1 EQU 0x4000763c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM8_BASE
CYDEV_PHUB_CFGMEM8_BASE EQU 0x40007640
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM8_SIZE
CYDEV_PHUB_CFGMEM8_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CFGMEM8_CFG0
CYREG_PHUB_CFGMEM8_CFG0 EQU 0x40007640
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CFGMEM8_CFG1
CYREG_PHUB_CFGMEM8_CFG1 EQU 0x40007644
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM9_BASE
CYDEV_PHUB_CFGMEM9_BASE EQU 0x40007648
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM9_SIZE
CYDEV_PHUB_CFGMEM9_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CFGMEM9_CFG0
CYREG_PHUB_CFGMEM9_CFG0 EQU 0x40007648
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CFGMEM9_CFG1
CYREG_PHUB_CFGMEM9_CFG1 EQU 0x4000764c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM10_BASE
CYDEV_PHUB_CFGMEM10_BASE EQU 0x40007650
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM10_SIZE
CYDEV_PHUB_CFGMEM10_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CFGMEM10_CFG0
CYREG_PHUB_CFGMEM10_CFG0 EQU 0x40007650
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CFGMEM10_CFG1
CYREG_PHUB_CFGMEM10_CFG1 EQU 0x40007654
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM11_BASE
CYDEV_PHUB_CFGMEM11_BASE EQU 0x40007658
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM11_SIZE
CYDEV_PHUB_CFGMEM11_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CFGMEM11_CFG0
CYREG_PHUB_CFGMEM11_CFG0 EQU 0x40007658
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CFGMEM11_CFG1
CYREG_PHUB_CFGMEM11_CFG1 EQU 0x4000765c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM12_BASE
CYDEV_PHUB_CFGMEM12_BASE EQU 0x40007660
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM12_SIZE
CYDEV_PHUB_CFGMEM12_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CFGMEM12_CFG0
CYREG_PHUB_CFGMEM12_CFG0 EQU 0x40007660
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CFGMEM12_CFG1
CYREG_PHUB_CFGMEM12_CFG1 EQU 0x40007664
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM13_BASE
CYDEV_PHUB_CFGMEM13_BASE EQU 0x40007668
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM13_SIZE
CYDEV_PHUB_CFGMEM13_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CFGMEM13_CFG0
CYREG_PHUB_CFGMEM13_CFG0 EQU 0x40007668
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CFGMEM13_CFG1
CYREG_PHUB_CFGMEM13_CFG1 EQU 0x4000766c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM14_BASE
CYDEV_PHUB_CFGMEM14_BASE EQU 0x40007670
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM14_SIZE
CYDEV_PHUB_CFGMEM14_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CFGMEM14_CFG0
CYREG_PHUB_CFGMEM14_CFG0 EQU 0x40007670
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CFGMEM14_CFG1
CYREG_PHUB_CFGMEM14_CFG1 EQU 0x40007674
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM15_BASE
CYDEV_PHUB_CFGMEM15_BASE EQU 0x40007678
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM15_SIZE
CYDEV_PHUB_CFGMEM15_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CFGMEM15_CFG0
CYREG_PHUB_CFGMEM15_CFG0 EQU 0x40007678
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CFGMEM15_CFG1
CYREG_PHUB_CFGMEM15_CFG1 EQU 0x4000767c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM16_BASE
CYDEV_PHUB_CFGMEM16_BASE EQU 0x40007680
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM16_SIZE
CYDEV_PHUB_CFGMEM16_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CFGMEM16_CFG0
CYREG_PHUB_CFGMEM16_CFG0 EQU 0x40007680
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CFGMEM16_CFG1
CYREG_PHUB_CFGMEM16_CFG1 EQU 0x40007684
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM17_BASE
CYDEV_PHUB_CFGMEM17_BASE EQU 0x40007688
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM17_SIZE
CYDEV_PHUB_CFGMEM17_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CFGMEM17_CFG0
CYREG_PHUB_CFGMEM17_CFG0 EQU 0x40007688
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CFGMEM17_CFG1
CYREG_PHUB_CFGMEM17_CFG1 EQU 0x4000768c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM18_BASE
CYDEV_PHUB_CFGMEM18_BASE EQU 0x40007690
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM18_SIZE
CYDEV_PHUB_CFGMEM18_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CFGMEM18_CFG0
CYREG_PHUB_CFGMEM18_CFG0 EQU 0x40007690
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CFGMEM18_CFG1
CYREG_PHUB_CFGMEM18_CFG1 EQU 0x40007694
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM19_BASE
CYDEV_PHUB_CFGMEM19_BASE EQU 0x40007698
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM19_SIZE
CYDEV_PHUB_CFGMEM19_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CFGMEM19_CFG0
CYREG_PHUB_CFGMEM19_CFG0 EQU 0x40007698
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CFGMEM19_CFG1
CYREG_PHUB_CFGMEM19_CFG1 EQU 0x4000769c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM20_BASE
CYDEV_PHUB_CFGMEM20_BASE EQU 0x400076a0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM20_SIZE
CYDEV_PHUB_CFGMEM20_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CFGMEM20_CFG0
CYREG_PHUB_CFGMEM20_CFG0 EQU 0x400076a0
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CFGMEM20_CFG1
CYREG_PHUB_CFGMEM20_CFG1 EQU 0x400076a4
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM21_BASE
CYDEV_PHUB_CFGMEM21_BASE EQU 0x400076a8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM21_SIZE
CYDEV_PHUB_CFGMEM21_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CFGMEM21_CFG0
CYREG_PHUB_CFGMEM21_CFG0 EQU 0x400076a8
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CFGMEM21_CFG1
CYREG_PHUB_CFGMEM21_CFG1 EQU 0x400076ac
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM22_BASE
CYDEV_PHUB_CFGMEM22_BASE EQU 0x400076b0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM22_SIZE
CYDEV_PHUB_CFGMEM22_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CFGMEM22_CFG0
CYREG_PHUB_CFGMEM22_CFG0 EQU 0x400076b0
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CFGMEM22_CFG1
CYREG_PHUB_CFGMEM22_CFG1 EQU 0x400076b4
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM23_BASE
CYDEV_PHUB_CFGMEM23_BASE EQU 0x400076b8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM23_SIZE
CYDEV_PHUB_CFGMEM23_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CFGMEM23_CFG0
CYREG_PHUB_CFGMEM23_CFG0 EQU 0x400076b8
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_CFGMEM23_CFG1
CYREG_PHUB_CFGMEM23_CFG1 EQU 0x400076bc
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM0_BASE
CYDEV_PHUB_TDMEM0_BASE EQU 0x40007800
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM0_SIZE
CYDEV_PHUB_TDMEM0_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM0_ORIG_TD0
CYREG_PHUB_TDMEM0_ORIG_TD0 EQU 0x40007800
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM0_ORIG_TD1
CYREG_PHUB_TDMEM0_ORIG_TD1 EQU 0x40007804
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM1_BASE
CYDEV_PHUB_TDMEM1_BASE EQU 0x40007808
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM1_SIZE
CYDEV_PHUB_TDMEM1_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM1_ORIG_TD0
CYREG_PHUB_TDMEM1_ORIG_TD0 EQU 0x40007808
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM1_ORIG_TD1
CYREG_PHUB_TDMEM1_ORIG_TD1 EQU 0x4000780c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM2_BASE
CYDEV_PHUB_TDMEM2_BASE EQU 0x40007810
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM2_SIZE
CYDEV_PHUB_TDMEM2_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM2_ORIG_TD0
CYREG_PHUB_TDMEM2_ORIG_TD0 EQU 0x40007810
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM2_ORIG_TD1
CYREG_PHUB_TDMEM2_ORIG_TD1 EQU 0x40007814
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM3_BASE
CYDEV_PHUB_TDMEM3_BASE EQU 0x40007818
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM3_SIZE
CYDEV_PHUB_TDMEM3_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM3_ORIG_TD0
CYREG_PHUB_TDMEM3_ORIG_TD0 EQU 0x40007818
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM3_ORIG_TD1
CYREG_PHUB_TDMEM3_ORIG_TD1 EQU 0x4000781c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM4_BASE
CYDEV_PHUB_TDMEM4_BASE EQU 0x40007820
