MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cydevicerv_trm.inc
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM4_SIZE
CYDEV_PHUB_TDMEM4_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM4_ORIG_TD0
CYREG_PHUB_TDMEM4_ORIG_TD0 EQU 0x40007820
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM4_ORIG_TD1
CYREG_PHUB_TDMEM4_ORIG_TD1 EQU 0x40007824
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM5_BASE
CYDEV_PHUB_TDMEM5_BASE EQU 0x40007828
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM5_SIZE
CYDEV_PHUB_TDMEM5_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM5_ORIG_TD0
CYREG_PHUB_TDMEM5_ORIG_TD0 EQU 0x40007828
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM5_ORIG_TD1
CYREG_PHUB_TDMEM5_ORIG_TD1 EQU 0x4000782c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM6_BASE
CYDEV_PHUB_TDMEM6_BASE EQU 0x40007830
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM6_SIZE
CYDEV_PHUB_TDMEM6_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM6_ORIG_TD0
CYREG_PHUB_TDMEM6_ORIG_TD0 EQU 0x40007830
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM6_ORIG_TD1
CYREG_PHUB_TDMEM6_ORIG_TD1 EQU 0x40007834
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM7_BASE
CYDEV_PHUB_TDMEM7_BASE EQU 0x40007838
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM7_SIZE
CYDEV_PHUB_TDMEM7_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM7_ORIG_TD0
CYREG_PHUB_TDMEM7_ORIG_TD0 EQU 0x40007838
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM7_ORIG_TD1
CYREG_PHUB_TDMEM7_ORIG_TD1 EQU 0x4000783c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM8_BASE
CYDEV_PHUB_TDMEM8_BASE EQU 0x40007840
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM8_SIZE
CYDEV_PHUB_TDMEM8_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM8_ORIG_TD0
CYREG_PHUB_TDMEM8_ORIG_TD0 EQU 0x40007840
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM8_ORIG_TD1
CYREG_PHUB_TDMEM8_ORIG_TD1 EQU 0x40007844
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM9_BASE
CYDEV_PHUB_TDMEM9_BASE EQU 0x40007848
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM9_SIZE
CYDEV_PHUB_TDMEM9_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM9_ORIG_TD0
CYREG_PHUB_TDMEM9_ORIG_TD0 EQU 0x40007848
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM9_ORIG_TD1
CYREG_PHUB_TDMEM9_ORIG_TD1 EQU 0x4000784c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM10_BASE
CYDEV_PHUB_TDMEM10_BASE EQU 0x40007850
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM10_SIZE
CYDEV_PHUB_TDMEM10_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM10_ORIG_TD0
CYREG_PHUB_TDMEM10_ORIG_TD0 EQU 0x40007850
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM10_ORIG_TD1
CYREG_PHUB_TDMEM10_ORIG_TD1 EQU 0x40007854
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM11_BASE
CYDEV_PHUB_TDMEM11_BASE EQU 0x40007858
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM11_SIZE
CYDEV_PHUB_TDMEM11_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM11_ORIG_TD0
CYREG_PHUB_TDMEM11_ORIG_TD0 EQU 0x40007858
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM11_ORIG_TD1
CYREG_PHUB_TDMEM11_ORIG_TD1 EQU 0x4000785c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM12_BASE
CYDEV_PHUB_TDMEM12_BASE EQU 0x40007860
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM12_SIZE
CYDEV_PHUB_TDMEM12_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM12_ORIG_TD0
CYREG_PHUB_TDMEM12_ORIG_TD0 EQU 0x40007860
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM12_ORIG_TD1
CYREG_PHUB_TDMEM12_ORIG_TD1 EQU 0x40007864
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM13_BASE
CYDEV_PHUB_TDMEM13_BASE EQU 0x40007868
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM13_SIZE
CYDEV_PHUB_TDMEM13_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM13_ORIG_TD0
CYREG_PHUB_TDMEM13_ORIG_TD0 EQU 0x40007868
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM13_ORIG_TD1
CYREG_PHUB_TDMEM13_ORIG_TD1 EQU 0x4000786c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM14_BASE
CYDEV_PHUB_TDMEM14_BASE EQU 0x40007870
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM14_SIZE
CYDEV_PHUB_TDMEM14_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM14_ORIG_TD0
CYREG_PHUB_TDMEM14_ORIG_TD0 EQU 0x40007870
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM14_ORIG_TD1
CYREG_PHUB_TDMEM14_ORIG_TD1 EQU 0x40007874
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM15_BASE
CYDEV_PHUB_TDMEM15_BASE EQU 0x40007878
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM15_SIZE
CYDEV_PHUB_TDMEM15_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM15_ORIG_TD0
CYREG_PHUB_TDMEM15_ORIG_TD0 EQU 0x40007878
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM15_ORIG_TD1
CYREG_PHUB_TDMEM15_ORIG_TD1 EQU 0x4000787c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM16_BASE
CYDEV_PHUB_TDMEM16_BASE EQU 0x40007880
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM16_SIZE
CYDEV_PHUB_TDMEM16_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM16_ORIG_TD0
CYREG_PHUB_TDMEM16_ORIG_TD0 EQU 0x40007880
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM16_ORIG_TD1
CYREG_PHUB_TDMEM16_ORIG_TD1 EQU 0x40007884
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM17_BASE
CYDEV_PHUB_TDMEM17_BASE EQU 0x40007888
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM17_SIZE
CYDEV_PHUB_TDMEM17_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM17_ORIG_TD0
CYREG_PHUB_TDMEM17_ORIG_TD0 EQU 0x40007888
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM17_ORIG_TD1
CYREG_PHUB_TDMEM17_ORIG_TD1 EQU 0x4000788c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM18_BASE
CYDEV_PHUB_TDMEM18_BASE EQU 0x40007890
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM18_SIZE
CYDEV_PHUB_TDMEM18_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM18_ORIG_TD0
CYREG_PHUB_TDMEM18_ORIG_TD0 EQU 0x40007890
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM18_ORIG_TD1
CYREG_PHUB_TDMEM18_ORIG_TD1 EQU 0x40007894
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM19_BASE
CYDEV_PHUB_TDMEM19_BASE EQU 0x40007898
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM19_SIZE
CYDEV_PHUB_TDMEM19_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM19_ORIG_TD0
CYREG_PHUB_TDMEM19_ORIG_TD0 EQU 0x40007898
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM19_ORIG_TD1
CYREG_PHUB_TDMEM19_ORIG_TD1 EQU 0x4000789c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM20_BASE
CYDEV_PHUB_TDMEM20_BASE EQU 0x400078a0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM20_SIZE
CYDEV_PHUB_TDMEM20_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM20_ORIG_TD0
CYREG_PHUB_TDMEM20_ORIG_TD0 EQU 0x400078a0
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM20_ORIG_TD1
CYREG_PHUB_TDMEM20_ORIG_TD1 EQU 0x400078a4
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM21_BASE
CYDEV_PHUB_TDMEM21_BASE EQU 0x400078a8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM21_SIZE
CYDEV_PHUB_TDMEM21_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM21_ORIG_TD0
CYREG_PHUB_TDMEM21_ORIG_TD0 EQU 0x400078a8
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM21_ORIG_TD1
CYREG_PHUB_TDMEM21_ORIG_TD1 EQU 0x400078ac
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM22_BASE
CYDEV_PHUB_TDMEM22_BASE EQU 0x400078b0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM22_SIZE
CYDEV_PHUB_TDMEM22_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM22_ORIG_TD0
CYREG_PHUB_TDMEM22_ORIG_TD0 EQU 0x400078b0
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM22_ORIG_TD1
CYREG_PHUB_TDMEM22_ORIG_TD1 EQU 0x400078b4
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM23_BASE
CYDEV_PHUB_TDMEM23_BASE EQU 0x400078b8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM23_SIZE
CYDEV_PHUB_TDMEM23_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM23_ORIG_TD0
CYREG_PHUB_TDMEM23_ORIG_TD0 EQU 0x400078b8
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM23_ORIG_TD1
CYREG_PHUB_TDMEM23_ORIG_TD1 EQU 0x400078bc
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM24_BASE
CYDEV_PHUB_TDMEM24_BASE EQU 0x400078c0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM24_SIZE
CYDEV_PHUB_TDMEM24_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM24_ORIG_TD0
CYREG_PHUB_TDMEM24_ORIG_TD0 EQU 0x400078c0
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM24_ORIG_TD1
CYREG_PHUB_TDMEM24_ORIG_TD1 EQU 0x400078c4
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM25_BASE
CYDEV_PHUB_TDMEM25_BASE EQU 0x400078c8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM25_SIZE
CYDEV_PHUB_TDMEM25_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM25_ORIG_TD0
CYREG_PHUB_TDMEM25_ORIG_TD0 EQU 0x400078c8
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM25_ORIG_TD1
CYREG_PHUB_TDMEM25_ORIG_TD1 EQU 0x400078cc
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM26_BASE
CYDEV_PHUB_TDMEM26_BASE EQU 0x400078d0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM26_SIZE
CYDEV_PHUB_TDMEM26_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM26_ORIG_TD0
CYREG_PHUB_TDMEM26_ORIG_TD0 EQU 0x400078d0
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM26_ORIG_TD1
CYREG_PHUB_TDMEM26_ORIG_TD1 EQU 0x400078d4
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM27_BASE
CYDEV_PHUB_TDMEM27_BASE EQU 0x400078d8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM27_SIZE
CYDEV_PHUB_TDMEM27_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM27_ORIG_TD0
CYREG_PHUB_TDMEM27_ORIG_TD0 EQU 0x400078d8
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM27_ORIG_TD1
CYREG_PHUB_TDMEM27_ORIG_TD1 EQU 0x400078dc
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM28_BASE
CYDEV_PHUB_TDMEM28_BASE EQU 0x400078e0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM28_SIZE
CYDEV_PHUB_TDMEM28_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM28_ORIG_TD0
CYREG_PHUB_TDMEM28_ORIG_TD0 EQU 0x400078e0
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM28_ORIG_TD1
CYREG_PHUB_TDMEM28_ORIG_TD1 EQU 0x400078e4
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM29_BASE
CYDEV_PHUB_TDMEM29_BASE EQU 0x400078e8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM29_SIZE
CYDEV_PHUB_TDMEM29_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM29_ORIG_TD0
CYREG_PHUB_TDMEM29_ORIG_TD0 EQU 0x400078e8
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM29_ORIG_TD1
CYREG_PHUB_TDMEM29_ORIG_TD1 EQU 0x400078ec
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM30_BASE
CYDEV_PHUB_TDMEM30_BASE EQU 0x400078f0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM30_SIZE
CYDEV_PHUB_TDMEM30_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM30_ORIG_TD0
CYREG_PHUB_TDMEM30_ORIG_TD0 EQU 0x400078f0
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM30_ORIG_TD1
CYREG_PHUB_TDMEM30_ORIG_TD1 EQU 0x400078f4
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM31_BASE
CYDEV_PHUB_TDMEM31_BASE EQU 0x400078f8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM31_SIZE
CYDEV_PHUB_TDMEM31_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM31_ORIG_TD0
CYREG_PHUB_TDMEM31_ORIG_TD0 EQU 0x400078f8
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM31_ORIG_TD1
CYREG_PHUB_TDMEM31_ORIG_TD1 EQU 0x400078fc
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM32_BASE
CYDEV_PHUB_TDMEM32_BASE EQU 0x40007900
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM32_SIZE
CYDEV_PHUB_TDMEM32_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM32_ORIG_TD0
CYREG_PHUB_TDMEM32_ORIG_TD0 EQU 0x40007900
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM32_ORIG_TD1
CYREG_PHUB_TDMEM32_ORIG_TD1 EQU 0x40007904
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM33_BASE
CYDEV_PHUB_TDMEM33_BASE EQU 0x40007908
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM33_SIZE
CYDEV_PHUB_TDMEM33_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM33_ORIG_TD0
CYREG_PHUB_TDMEM33_ORIG_TD0 EQU 0x40007908
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM33_ORIG_TD1
CYREG_PHUB_TDMEM33_ORIG_TD1 EQU 0x4000790c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM34_BASE
CYDEV_PHUB_TDMEM34_BASE EQU 0x40007910
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM34_SIZE
CYDEV_PHUB_TDMEM34_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM34_ORIG_TD0
CYREG_PHUB_TDMEM34_ORIG_TD0 EQU 0x40007910
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM34_ORIG_TD1
CYREG_PHUB_TDMEM34_ORIG_TD1 EQU 0x40007914
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM35_BASE
CYDEV_PHUB_TDMEM35_BASE EQU 0x40007918
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM35_SIZE
CYDEV_PHUB_TDMEM35_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM35_ORIG_TD0
CYREG_PHUB_TDMEM35_ORIG_TD0 EQU 0x40007918
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM35_ORIG_TD1
CYREG_PHUB_TDMEM35_ORIG_TD1 EQU 0x4000791c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM36_BASE
CYDEV_PHUB_TDMEM36_BASE EQU 0x40007920
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM36_SIZE
CYDEV_PHUB_TDMEM36_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM36_ORIG_TD0
CYREG_PHUB_TDMEM36_ORIG_TD0 EQU 0x40007920
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM36_ORIG_TD1
CYREG_PHUB_TDMEM36_ORIG_TD1 EQU 0x40007924
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM37_BASE
CYDEV_PHUB_TDMEM37_BASE EQU 0x40007928
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM37_SIZE
CYDEV_PHUB_TDMEM37_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM37_ORIG_TD0
CYREG_PHUB_TDMEM37_ORIG_TD0 EQU 0x40007928
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM37_ORIG_TD1
CYREG_PHUB_TDMEM37_ORIG_TD1 EQU 0x4000792c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM38_BASE
CYDEV_PHUB_TDMEM38_BASE EQU 0x40007930
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM38_SIZE
CYDEV_PHUB_TDMEM38_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM38_ORIG_TD0
CYREG_PHUB_TDMEM38_ORIG_TD0 EQU 0x40007930
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM38_ORIG_TD1
CYREG_PHUB_TDMEM38_ORIG_TD1 EQU 0x40007934
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM39_BASE
CYDEV_PHUB_TDMEM39_BASE EQU 0x40007938
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM39_SIZE
CYDEV_PHUB_TDMEM39_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM39_ORIG_TD0
CYREG_PHUB_TDMEM39_ORIG_TD0 EQU 0x40007938
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM39_ORIG_TD1
CYREG_PHUB_TDMEM39_ORIG_TD1 EQU 0x4000793c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM40_BASE
CYDEV_PHUB_TDMEM40_BASE EQU 0x40007940
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM40_SIZE
CYDEV_PHUB_TDMEM40_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM40_ORIG_TD0
CYREG_PHUB_TDMEM40_ORIG_TD0 EQU 0x40007940
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM40_ORIG_TD1
CYREG_PHUB_TDMEM40_ORIG_TD1 EQU 0x40007944
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM41_BASE
CYDEV_PHUB_TDMEM41_BASE EQU 0x40007948
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM41_SIZE
CYDEV_PHUB_TDMEM41_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM41_ORIG_TD0
CYREG_PHUB_TDMEM41_ORIG_TD0 EQU 0x40007948
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM41_ORIG_TD1
CYREG_PHUB_TDMEM41_ORIG_TD1 EQU 0x4000794c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM42_BASE
CYDEV_PHUB_TDMEM42_BASE EQU 0x40007950
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM42_SIZE
CYDEV_PHUB_TDMEM42_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM42_ORIG_TD0
CYREG_PHUB_TDMEM42_ORIG_TD0 EQU 0x40007950
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM42_ORIG_TD1
CYREG_PHUB_TDMEM42_ORIG_TD1 EQU 0x40007954
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM43_BASE
CYDEV_PHUB_TDMEM43_BASE EQU 0x40007958
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM43_SIZE
CYDEV_PHUB_TDMEM43_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM43_ORIG_TD0
CYREG_PHUB_TDMEM43_ORIG_TD0 EQU 0x40007958
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM43_ORIG_TD1
CYREG_PHUB_TDMEM43_ORIG_TD1 EQU 0x4000795c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM44_BASE
CYDEV_PHUB_TDMEM44_BASE EQU 0x40007960
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM44_SIZE
CYDEV_PHUB_TDMEM44_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM44_ORIG_TD0
CYREG_PHUB_TDMEM44_ORIG_TD0 EQU 0x40007960
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM44_ORIG_TD1
CYREG_PHUB_TDMEM44_ORIG_TD1 EQU 0x40007964
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM45_BASE
CYDEV_PHUB_TDMEM45_BASE EQU 0x40007968
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM45_SIZE
CYDEV_PHUB_TDMEM45_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM45_ORIG_TD0
CYREG_PHUB_TDMEM45_ORIG_TD0 EQU 0x40007968
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM45_ORIG_TD1
CYREG_PHUB_TDMEM45_ORIG_TD1 EQU 0x4000796c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM46_BASE
CYDEV_PHUB_TDMEM46_BASE EQU 0x40007970
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM46_SIZE
CYDEV_PHUB_TDMEM46_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM46_ORIG_TD0
CYREG_PHUB_TDMEM46_ORIG_TD0 EQU 0x40007970
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM46_ORIG_TD1
CYREG_PHUB_TDMEM46_ORIG_TD1 EQU 0x40007974
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM47_BASE
CYDEV_PHUB_TDMEM47_BASE EQU 0x40007978
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM47_SIZE
CYDEV_PHUB_TDMEM47_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM47_ORIG_TD0
CYREG_PHUB_TDMEM47_ORIG_TD0 EQU 0x40007978
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM47_ORIG_TD1
CYREG_PHUB_TDMEM47_ORIG_TD1 EQU 0x4000797c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM48_BASE
CYDEV_PHUB_TDMEM48_BASE EQU 0x40007980
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM48_SIZE
CYDEV_PHUB_TDMEM48_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM48_ORIG_TD0
CYREG_PHUB_TDMEM48_ORIG_TD0 EQU 0x40007980
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM48_ORIG_TD1
CYREG_PHUB_TDMEM48_ORIG_TD1 EQU 0x40007984
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM49_BASE
CYDEV_PHUB_TDMEM49_BASE EQU 0x40007988
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM49_SIZE
CYDEV_PHUB_TDMEM49_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM49_ORIG_TD0
CYREG_PHUB_TDMEM49_ORIG_TD0 EQU 0x40007988
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM49_ORIG_TD1
CYREG_PHUB_TDMEM49_ORIG_TD1 EQU 0x4000798c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM50_BASE
CYDEV_PHUB_TDMEM50_BASE EQU 0x40007990
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM50_SIZE
CYDEV_PHUB_TDMEM50_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM50_ORIG_TD0
CYREG_PHUB_TDMEM50_ORIG_TD0 EQU 0x40007990
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM50_ORIG_TD1
CYREG_PHUB_TDMEM50_ORIG_TD1 EQU 0x40007994
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM51_BASE
CYDEV_PHUB_TDMEM51_BASE EQU 0x40007998
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM51_SIZE
CYDEV_PHUB_TDMEM51_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM51_ORIG_TD0
CYREG_PHUB_TDMEM51_ORIG_TD0 EQU 0x40007998
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM51_ORIG_TD1
CYREG_PHUB_TDMEM51_ORIG_TD1 EQU 0x4000799c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM52_BASE
CYDEV_PHUB_TDMEM52_BASE EQU 0x400079a0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM52_SIZE
CYDEV_PHUB_TDMEM52_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM52_ORIG_TD0
CYREG_PHUB_TDMEM52_ORIG_TD0 EQU 0x400079a0
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM52_ORIG_TD1
CYREG_PHUB_TDMEM52_ORIG_TD1 EQU 0x400079a4
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM53_BASE
CYDEV_PHUB_TDMEM53_BASE EQU 0x400079a8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM53_SIZE
CYDEV_PHUB_TDMEM53_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM53_ORIG_TD0
CYREG_PHUB_TDMEM53_ORIG_TD0 EQU 0x400079a8
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM53_ORIG_TD1
CYREG_PHUB_TDMEM53_ORIG_TD1 EQU 0x400079ac
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM54_BASE
CYDEV_PHUB_TDMEM54_BASE EQU 0x400079b0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM54_SIZE
CYDEV_PHUB_TDMEM54_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM54_ORIG_TD0
CYREG_PHUB_TDMEM54_ORIG_TD0 EQU 0x400079b0
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM54_ORIG_TD1
CYREG_PHUB_TDMEM54_ORIG_TD1 EQU 0x400079b4
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM55_BASE
CYDEV_PHUB_TDMEM55_BASE EQU 0x400079b8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM55_SIZE
CYDEV_PHUB_TDMEM55_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM55_ORIG_TD0
CYREG_PHUB_TDMEM55_ORIG_TD0 EQU 0x400079b8
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM55_ORIG_TD1
CYREG_PHUB_TDMEM55_ORIG_TD1 EQU 0x400079bc
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM56_BASE
CYDEV_PHUB_TDMEM56_BASE EQU 0x400079c0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM56_SIZE
CYDEV_PHUB_TDMEM56_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM56_ORIG_TD0
CYREG_PHUB_TDMEM56_ORIG_TD0 EQU 0x400079c0
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM56_ORIG_TD1
CYREG_PHUB_TDMEM56_ORIG_TD1 EQU 0x400079c4
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM57_BASE
CYDEV_PHUB_TDMEM57_BASE EQU 0x400079c8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM57_SIZE
CYDEV_PHUB_TDMEM57_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM57_ORIG_TD0
CYREG_PHUB_TDMEM57_ORIG_TD0 EQU 0x400079c8
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM57_ORIG_TD1
CYREG_PHUB_TDMEM57_ORIG_TD1 EQU 0x400079cc
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM58_BASE
CYDEV_PHUB_TDMEM58_BASE EQU 0x400079d0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM58_SIZE
CYDEV_PHUB_TDMEM58_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM58_ORIG_TD0
CYREG_PHUB_TDMEM58_ORIG_TD0 EQU 0x400079d0
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM58_ORIG_TD1
CYREG_PHUB_TDMEM58_ORIG_TD1 EQU 0x400079d4
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM59_BASE
CYDEV_PHUB_TDMEM59_BASE EQU 0x400079d8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM59_SIZE
CYDEV_PHUB_TDMEM59_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM59_ORIG_TD0
CYREG_PHUB_TDMEM59_ORIG_TD0 EQU 0x400079d8
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM59_ORIG_TD1
CYREG_PHUB_TDMEM59_ORIG_TD1 EQU 0x400079dc
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM60_BASE
CYDEV_PHUB_TDMEM60_BASE EQU 0x400079e0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM60_SIZE
CYDEV_PHUB_TDMEM60_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM60_ORIG_TD0
CYREG_PHUB_TDMEM60_ORIG_TD0 EQU 0x400079e0
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM60_ORIG_TD1
CYREG_PHUB_TDMEM60_ORIG_TD1 EQU 0x400079e4
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM61_BASE
CYDEV_PHUB_TDMEM61_BASE EQU 0x400079e8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM61_SIZE
CYDEV_PHUB_TDMEM61_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM61_ORIG_TD0
CYREG_PHUB_TDMEM61_ORIG_TD0 EQU 0x400079e8
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM61_ORIG_TD1
CYREG_PHUB_TDMEM61_ORIG_TD1 EQU 0x400079ec
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM62_BASE
CYDEV_PHUB_TDMEM62_BASE EQU 0x400079f0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM62_SIZE
CYDEV_PHUB_TDMEM62_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM62_ORIG_TD0
CYREG_PHUB_TDMEM62_ORIG_TD0 EQU 0x400079f0
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM62_ORIG_TD1
CYREG_PHUB_TDMEM62_ORIG_TD1 EQU 0x400079f4
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM63_BASE
CYDEV_PHUB_TDMEM63_BASE EQU 0x400079f8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM63_SIZE
CYDEV_PHUB_TDMEM63_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM63_ORIG_TD0
CYREG_PHUB_TDMEM63_ORIG_TD0 EQU 0x400079f8
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM63_ORIG_TD1
CYREG_PHUB_TDMEM63_ORIG_TD1 EQU 0x400079fc
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM64_BASE
CYDEV_PHUB_TDMEM64_BASE EQU 0x40007a00
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM64_SIZE
CYDEV_PHUB_TDMEM64_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM64_ORIG_TD0
CYREG_PHUB_TDMEM64_ORIG_TD0 EQU 0x40007a00
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM64_ORIG_TD1
CYREG_PHUB_TDMEM64_ORIG_TD1 EQU 0x40007a04
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM65_BASE
CYDEV_PHUB_TDMEM65_BASE EQU 0x40007a08
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM65_SIZE
CYDEV_PHUB_TDMEM65_SIZE EQU 0x00000008
    ENDIF
