MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cydevicerv_trm.inc
CYDEV_PHUB_TDMEM126_BASE EQU 0x40007bf0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM126_SIZE
CYDEV_PHUB_TDMEM126_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM126_ORIG_TD0
CYREG_PHUB_TDMEM126_ORIG_TD0 EQU 0x40007bf0
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM126_ORIG_TD1
CYREG_PHUB_TDMEM126_ORIG_TD1 EQU 0x40007bf4
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM127_BASE
CYDEV_PHUB_TDMEM127_BASE EQU 0x40007bf8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM127_SIZE
CYDEV_PHUB_TDMEM127_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM127_ORIG_TD0
CYREG_PHUB_TDMEM127_ORIG_TD0 EQU 0x40007bf8
    ENDIF
    IF :LNOT::DEF:CYREG_PHUB_TDMEM127_ORIG_TD1
CYREG_PHUB_TDMEM127_ORIG_TD1 EQU 0x40007bfc
    ENDIF
    IF :LNOT::DEF:CYDEV_EE_BASE
CYDEV_EE_BASE EQU 0x40008000
    ENDIF
    IF :LNOT::DEF:CYDEV_EE_SIZE
CYDEV_EE_SIZE EQU 0x00000800
    ENDIF
    IF :LNOT::DEF:CYREG_EE_DATA_MBASE
CYREG_EE_DATA_MBASE EQU 0x40008000
    ENDIF
    IF :LNOT::DEF:CYREG_EE_DATA_MSIZE
CYREG_EE_DATA_MSIZE EQU 0x00000800
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_BASE
CYDEV_CAN0_BASE EQU 0x4000a000
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_SIZE
CYDEV_CAN0_SIZE EQU 0x000002a0
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_CSR_BASE
CYDEV_CAN0_CSR_BASE EQU 0x4000a000
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_CSR_SIZE
CYDEV_CAN0_CSR_SIZE EQU 0x00000018
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_CSR_INT_SR
CYREG_CAN0_CSR_INT_SR EQU 0x4000a000
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_CSR_INT_EN
CYREG_CAN0_CSR_INT_EN EQU 0x4000a004
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_CSR_BUF_SR
CYREG_CAN0_CSR_BUF_SR EQU 0x4000a008
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_CSR_ERR_SR
CYREG_CAN0_CSR_ERR_SR EQU 0x4000a00c
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_CSR_CMD
CYREG_CAN0_CSR_CMD EQU 0x4000a010
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_CSR_CFG
CYREG_CAN0_CSR_CFG EQU 0x4000a014
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX0_BASE
CYDEV_CAN0_TX0_BASE EQU 0x4000a020
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX0_SIZE
CYDEV_CAN0_TX0_SIZE EQU 0x00000010
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_TX0_CMD
CYREG_CAN0_TX0_CMD EQU 0x4000a020
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_TX0_ID
CYREG_CAN0_TX0_ID EQU 0x4000a024
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_TX0_DH
CYREG_CAN0_TX0_DH EQU 0x4000a028
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_TX0_DL
CYREG_CAN0_TX0_DL EQU 0x4000a02c
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX1_BASE
CYDEV_CAN0_TX1_BASE EQU 0x4000a030
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX1_SIZE
CYDEV_CAN0_TX1_SIZE EQU 0x00000010
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_TX1_CMD
CYREG_CAN0_TX1_CMD EQU 0x4000a030
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_TX1_ID
CYREG_CAN0_TX1_ID EQU 0x4000a034
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_TX1_DH
CYREG_CAN0_TX1_DH EQU 0x4000a038
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_TX1_DL
CYREG_CAN0_TX1_DL EQU 0x4000a03c
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX2_BASE
CYDEV_CAN0_TX2_BASE EQU 0x4000a040
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX2_SIZE
CYDEV_CAN0_TX2_SIZE EQU 0x00000010
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_TX2_CMD
CYREG_CAN0_TX2_CMD EQU 0x4000a040
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_TX2_ID
CYREG_CAN0_TX2_ID EQU 0x4000a044
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_TX2_DH
CYREG_CAN0_TX2_DH EQU 0x4000a048
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_TX2_DL
CYREG_CAN0_TX2_DL EQU 0x4000a04c
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX3_BASE
CYDEV_CAN0_TX3_BASE EQU 0x4000a050
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX3_SIZE
CYDEV_CAN0_TX3_SIZE EQU 0x00000010
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_TX3_CMD
CYREG_CAN0_TX3_CMD EQU 0x4000a050
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_TX3_ID
CYREG_CAN0_TX3_ID EQU 0x4000a054
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_TX3_DH
CYREG_CAN0_TX3_DH EQU 0x4000a058
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_TX3_DL
CYREG_CAN0_TX3_DL EQU 0x4000a05c
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX4_BASE
CYDEV_CAN0_TX4_BASE EQU 0x4000a060
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX4_SIZE
CYDEV_CAN0_TX4_SIZE EQU 0x00000010
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_TX4_CMD
CYREG_CAN0_TX4_CMD EQU 0x4000a060
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_TX4_ID
CYREG_CAN0_TX4_ID EQU 0x4000a064
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_TX4_DH
CYREG_CAN0_TX4_DH EQU 0x4000a068
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_TX4_DL
CYREG_CAN0_TX4_DL EQU 0x4000a06c
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX5_BASE
CYDEV_CAN0_TX5_BASE EQU 0x4000a070
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX5_SIZE
CYDEV_CAN0_TX5_SIZE EQU 0x00000010
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_TX5_CMD
CYREG_CAN0_TX5_CMD EQU 0x4000a070
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_TX5_ID
CYREG_CAN0_TX5_ID EQU 0x4000a074
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_TX5_DH
CYREG_CAN0_TX5_DH EQU 0x4000a078
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_TX5_DL
CYREG_CAN0_TX5_DL EQU 0x4000a07c
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX6_BASE
CYDEV_CAN0_TX6_BASE EQU 0x4000a080
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX6_SIZE
CYDEV_CAN0_TX6_SIZE EQU 0x00000010
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_TX6_CMD
CYREG_CAN0_TX6_CMD EQU 0x4000a080
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_TX6_ID
CYREG_CAN0_TX6_ID EQU 0x4000a084
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_TX6_DH
CYREG_CAN0_TX6_DH EQU 0x4000a088
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_TX6_DL
CYREG_CAN0_TX6_DL EQU 0x4000a08c
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX7_BASE
CYDEV_CAN0_TX7_BASE EQU 0x4000a090
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX7_SIZE
CYDEV_CAN0_TX7_SIZE EQU 0x00000010
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_TX7_CMD
CYREG_CAN0_TX7_CMD EQU 0x4000a090
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_TX7_ID
CYREG_CAN0_TX7_ID EQU 0x4000a094
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_TX7_DH
CYREG_CAN0_TX7_DH EQU 0x4000a098
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_TX7_DL
CYREG_CAN0_TX7_DL EQU 0x4000a09c
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX0_BASE
CYDEV_CAN0_RX0_BASE EQU 0x4000a0a0
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX0_SIZE
CYDEV_CAN0_RX0_SIZE EQU 0x00000020
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX0_CMD
CYREG_CAN0_RX0_CMD EQU 0x4000a0a0
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX0_ID
CYREG_CAN0_RX0_ID EQU 0x4000a0a4
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX0_DH
CYREG_CAN0_RX0_DH EQU 0x4000a0a8
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX0_DL
CYREG_CAN0_RX0_DL EQU 0x4000a0ac
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX0_AMR
CYREG_CAN0_RX0_AMR EQU 0x4000a0b0
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX0_ACR
CYREG_CAN0_RX0_ACR EQU 0x4000a0b4
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX0_AMRD
CYREG_CAN0_RX0_AMRD EQU 0x4000a0b8
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX0_ACRD
CYREG_CAN0_RX0_ACRD EQU 0x4000a0bc
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX1_BASE
CYDEV_CAN0_RX1_BASE EQU 0x4000a0c0
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX1_SIZE
CYDEV_CAN0_RX1_SIZE EQU 0x00000020
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX1_CMD
CYREG_CAN0_RX1_CMD EQU 0x4000a0c0
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX1_ID
CYREG_CAN0_RX1_ID EQU 0x4000a0c4
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX1_DH
CYREG_CAN0_RX1_DH EQU 0x4000a0c8
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX1_DL
CYREG_CAN0_RX1_DL EQU 0x4000a0cc
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX1_AMR
CYREG_CAN0_RX1_AMR EQU 0x4000a0d0
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX1_ACR
CYREG_CAN0_RX1_ACR EQU 0x4000a0d4
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX1_AMRD
CYREG_CAN0_RX1_AMRD EQU 0x4000a0d8
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX1_ACRD
CYREG_CAN0_RX1_ACRD EQU 0x4000a0dc
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX2_BASE
CYDEV_CAN0_RX2_BASE EQU 0x4000a0e0
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX2_SIZE
CYDEV_CAN0_RX2_SIZE EQU 0x00000020
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX2_CMD
CYREG_CAN0_RX2_CMD EQU 0x4000a0e0
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX2_ID
CYREG_CAN0_RX2_ID EQU 0x4000a0e4
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX2_DH
CYREG_CAN0_RX2_DH EQU 0x4000a0e8
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX2_DL
CYREG_CAN0_RX2_DL EQU 0x4000a0ec
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX2_AMR
CYREG_CAN0_RX2_AMR EQU 0x4000a0f0
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX2_ACR
CYREG_CAN0_RX2_ACR EQU 0x4000a0f4
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX2_AMRD
CYREG_CAN0_RX2_AMRD EQU 0x4000a0f8
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX2_ACRD
CYREG_CAN0_RX2_ACRD EQU 0x4000a0fc
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX3_BASE
CYDEV_CAN0_RX3_BASE EQU 0x4000a100
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX3_SIZE
CYDEV_CAN0_RX3_SIZE EQU 0x00000020
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX3_CMD
CYREG_CAN0_RX3_CMD EQU 0x4000a100
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX3_ID
CYREG_CAN0_RX3_ID EQU 0x4000a104
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX3_DH
CYREG_CAN0_RX3_DH EQU 0x4000a108
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX3_DL
CYREG_CAN0_RX3_DL EQU 0x4000a10c
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX3_AMR
CYREG_CAN0_RX3_AMR EQU 0x4000a110
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX3_ACR
CYREG_CAN0_RX3_ACR EQU 0x4000a114
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX3_AMRD
CYREG_CAN0_RX3_AMRD EQU 0x4000a118
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX3_ACRD
CYREG_CAN0_RX3_ACRD EQU 0x4000a11c
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX4_BASE
CYDEV_CAN0_RX4_BASE EQU 0x4000a120
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX4_SIZE
CYDEV_CAN0_RX4_SIZE EQU 0x00000020
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX4_CMD
CYREG_CAN0_RX4_CMD EQU 0x4000a120
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX4_ID
CYREG_CAN0_RX4_ID EQU 0x4000a124
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX4_DH
CYREG_CAN0_RX4_DH EQU 0x4000a128
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX4_DL
CYREG_CAN0_RX4_DL EQU 0x4000a12c
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX4_AMR
CYREG_CAN0_RX4_AMR EQU 0x4000a130
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX4_ACR
CYREG_CAN0_RX4_ACR EQU 0x4000a134
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX4_AMRD
CYREG_CAN0_RX4_AMRD EQU 0x4000a138
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX4_ACRD
CYREG_CAN0_RX4_ACRD EQU 0x4000a13c
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX5_BASE
CYDEV_CAN0_RX5_BASE EQU 0x4000a140
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX5_SIZE
CYDEV_CAN0_RX5_SIZE EQU 0x00000020
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX5_CMD
CYREG_CAN0_RX5_CMD EQU 0x4000a140
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX5_ID
CYREG_CAN0_RX5_ID EQU 0x4000a144
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX5_DH
CYREG_CAN0_RX5_DH EQU 0x4000a148
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX5_DL
CYREG_CAN0_RX5_DL EQU 0x4000a14c
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX5_AMR
CYREG_CAN0_RX5_AMR EQU 0x4000a150
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX5_ACR
CYREG_CAN0_RX5_ACR EQU 0x4000a154
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX5_AMRD
CYREG_CAN0_RX5_AMRD EQU 0x4000a158
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX5_ACRD
CYREG_CAN0_RX5_ACRD EQU 0x4000a15c
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX6_BASE
CYDEV_CAN0_RX6_BASE EQU 0x4000a160
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX6_SIZE
CYDEV_CAN0_RX6_SIZE EQU 0x00000020
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX6_CMD
CYREG_CAN0_RX6_CMD EQU 0x4000a160
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX6_ID
CYREG_CAN0_RX6_ID EQU 0x4000a164
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX6_DH
CYREG_CAN0_RX6_DH EQU 0x4000a168
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX6_DL
CYREG_CAN0_RX6_DL EQU 0x4000a16c
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX6_AMR
CYREG_CAN0_RX6_AMR EQU 0x4000a170
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX6_ACR
CYREG_CAN0_RX6_ACR EQU 0x4000a174
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX6_AMRD
CYREG_CAN0_RX6_AMRD EQU 0x4000a178
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX6_ACRD
CYREG_CAN0_RX6_ACRD EQU 0x4000a17c
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX7_BASE
CYDEV_CAN0_RX7_BASE EQU 0x4000a180
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX7_SIZE
CYDEV_CAN0_RX7_SIZE EQU 0x00000020
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX7_CMD
CYREG_CAN0_RX7_CMD EQU 0x4000a180
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX7_ID
CYREG_CAN0_RX7_ID EQU 0x4000a184
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX7_DH
CYREG_CAN0_RX7_DH EQU 0x4000a188
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX7_DL
CYREG_CAN0_RX7_DL EQU 0x4000a18c
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX7_AMR
CYREG_CAN0_RX7_AMR EQU 0x4000a190
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX7_ACR
CYREG_CAN0_RX7_ACR EQU 0x4000a194
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX7_AMRD
CYREG_CAN0_RX7_AMRD EQU 0x4000a198
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX7_ACRD
CYREG_CAN0_RX7_ACRD EQU 0x4000a19c
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX8_BASE
CYDEV_CAN0_RX8_BASE EQU 0x4000a1a0
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX8_SIZE
CYDEV_CAN0_RX8_SIZE EQU 0x00000020
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX8_CMD
CYREG_CAN0_RX8_CMD EQU 0x4000a1a0
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX8_ID
CYREG_CAN0_RX8_ID EQU 0x4000a1a4
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX8_DH
CYREG_CAN0_RX8_DH EQU 0x4000a1a8
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX8_DL
CYREG_CAN0_RX8_DL EQU 0x4000a1ac
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX8_AMR
CYREG_CAN0_RX8_AMR EQU 0x4000a1b0
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX8_ACR
CYREG_CAN0_RX8_ACR EQU 0x4000a1b4
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX8_AMRD
CYREG_CAN0_RX8_AMRD EQU 0x4000a1b8
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX8_ACRD
CYREG_CAN0_RX8_ACRD EQU 0x4000a1bc
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX9_BASE
CYDEV_CAN0_RX9_BASE EQU 0x4000a1c0
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX9_SIZE
CYDEV_CAN0_RX9_SIZE EQU 0x00000020
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX9_CMD
CYREG_CAN0_RX9_CMD EQU 0x4000a1c0
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX9_ID
CYREG_CAN0_RX9_ID EQU 0x4000a1c4
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX9_DH
CYREG_CAN0_RX9_DH EQU 0x4000a1c8
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX9_DL
CYREG_CAN0_RX9_DL EQU 0x4000a1cc
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX9_AMR
CYREG_CAN0_RX9_AMR EQU 0x4000a1d0
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX9_ACR
CYREG_CAN0_RX9_ACR EQU 0x4000a1d4
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX9_AMRD
CYREG_CAN0_RX9_AMRD EQU 0x4000a1d8
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX9_ACRD
CYREG_CAN0_RX9_ACRD EQU 0x4000a1dc
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX10_BASE
CYDEV_CAN0_RX10_BASE EQU 0x4000a1e0
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX10_SIZE
CYDEV_CAN0_RX10_SIZE EQU 0x00000020
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX10_CMD
CYREG_CAN0_RX10_CMD EQU 0x4000a1e0
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX10_ID
CYREG_CAN0_RX10_ID EQU 0x4000a1e4
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX10_DH
CYREG_CAN0_RX10_DH EQU 0x4000a1e8
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX10_DL
CYREG_CAN0_RX10_DL EQU 0x4000a1ec
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX10_AMR
CYREG_CAN0_RX10_AMR EQU 0x4000a1f0
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX10_ACR
CYREG_CAN0_RX10_ACR EQU 0x4000a1f4
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX10_AMRD
CYREG_CAN0_RX10_AMRD EQU 0x4000a1f8
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX10_ACRD
CYREG_CAN0_RX10_ACRD EQU 0x4000a1fc
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX11_BASE
CYDEV_CAN0_RX11_BASE EQU 0x4000a200
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX11_SIZE
CYDEV_CAN0_RX11_SIZE EQU 0x00000020
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX11_CMD
CYREG_CAN0_RX11_CMD EQU 0x4000a200
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX11_ID
CYREG_CAN0_RX11_ID EQU 0x4000a204
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX11_DH
CYREG_CAN0_RX11_DH EQU 0x4000a208
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX11_DL
CYREG_CAN0_RX11_DL EQU 0x4000a20c
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX11_AMR
CYREG_CAN0_RX11_AMR EQU 0x4000a210
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX11_ACR
CYREG_CAN0_RX11_ACR EQU 0x4000a214
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX11_AMRD
CYREG_CAN0_RX11_AMRD EQU 0x4000a218
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX11_ACRD
CYREG_CAN0_RX11_ACRD EQU 0x4000a21c
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX12_BASE
CYDEV_CAN0_RX12_BASE EQU 0x4000a220
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX12_SIZE
CYDEV_CAN0_RX12_SIZE EQU 0x00000020
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX12_CMD
CYREG_CAN0_RX12_CMD EQU 0x4000a220
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX12_ID
CYREG_CAN0_RX12_ID EQU 0x4000a224
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX12_DH
CYREG_CAN0_RX12_DH EQU 0x4000a228
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX12_DL
CYREG_CAN0_RX12_DL EQU 0x4000a22c
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX12_AMR
CYREG_CAN0_RX12_AMR EQU 0x4000a230
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX12_ACR
CYREG_CAN0_RX12_ACR EQU 0x4000a234
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX12_AMRD
CYREG_CAN0_RX12_AMRD EQU 0x4000a238
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX12_ACRD
CYREG_CAN0_RX12_ACRD EQU 0x4000a23c
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX13_BASE
CYDEV_CAN0_RX13_BASE EQU 0x4000a240
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX13_SIZE
CYDEV_CAN0_RX13_SIZE EQU 0x00000020
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX13_CMD
CYREG_CAN0_RX13_CMD EQU 0x4000a240
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX13_ID
CYREG_CAN0_RX13_ID EQU 0x4000a244
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX13_DH
CYREG_CAN0_RX13_DH EQU 0x4000a248
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX13_DL
CYREG_CAN0_RX13_DL EQU 0x4000a24c
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX13_AMR
CYREG_CAN0_RX13_AMR EQU 0x4000a250
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX13_ACR
CYREG_CAN0_RX13_ACR EQU 0x4000a254
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX13_AMRD
CYREG_CAN0_RX13_AMRD EQU 0x4000a258
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX13_ACRD
CYREG_CAN0_RX13_ACRD EQU 0x4000a25c
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX14_BASE
CYDEV_CAN0_RX14_BASE EQU 0x4000a260
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX14_SIZE
CYDEV_CAN0_RX14_SIZE EQU 0x00000020
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX14_CMD
CYREG_CAN0_RX14_CMD EQU 0x4000a260
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX14_ID
CYREG_CAN0_RX14_ID EQU 0x4000a264
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX14_DH
CYREG_CAN0_RX14_DH EQU 0x4000a268
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX14_DL
CYREG_CAN0_RX14_DL EQU 0x4000a26c
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX14_AMR
CYREG_CAN0_RX14_AMR EQU 0x4000a270
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX14_ACR
CYREG_CAN0_RX14_ACR EQU 0x4000a274
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX14_AMRD
CYREG_CAN0_RX14_AMRD EQU 0x4000a278
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX14_ACRD
CYREG_CAN0_RX14_ACRD EQU 0x4000a27c
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX15_BASE
CYDEV_CAN0_RX15_BASE EQU 0x4000a280
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX15_SIZE
CYDEV_CAN0_RX15_SIZE EQU 0x00000020
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX15_CMD
CYREG_CAN0_RX15_CMD EQU 0x4000a280
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX15_ID
CYREG_CAN0_RX15_ID EQU 0x4000a284
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX15_DH
CYREG_CAN0_RX15_DH EQU 0x4000a288
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX15_DL
CYREG_CAN0_RX15_DL EQU 0x4000a28c
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX15_AMR
CYREG_CAN0_RX15_AMR EQU 0x4000a290
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX15_ACR
CYREG_CAN0_RX15_ACR EQU 0x4000a294
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX15_AMRD
CYREG_CAN0_RX15_AMRD EQU 0x4000a298
    ENDIF
    IF :LNOT::DEF:CYREG_CAN0_RX15_ACRD
CYREG_CAN0_RX15_ACRD EQU 0x4000a29c
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_BASE
CYDEV_DFB0_BASE EQU 0x4000c000
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_SIZE
CYDEV_DFB0_SIZE EQU 0x000007b5
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_DPA_SRAM_BASE
CYDEV_DFB0_DPA_SRAM_BASE EQU 0x4000c000
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_DPA_SRAM_SIZE
CYDEV_DFB0_DPA_SRAM_SIZE EQU 0x00000200
    ENDIF
    IF :LNOT::DEF:CYREG_DFB0_DPA_SRAM_DATA_MBASE
CYREG_DFB0_DPA_SRAM_DATA_MBASE EQU 0x4000c000
    ENDIF
    IF :LNOT::DEF:CYREG_DFB0_DPA_SRAM_DATA_MSIZE
CYREG_DFB0_DPA_SRAM_DATA_MSIZE EQU 0x00000200
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_DPB_SRAM_BASE
CYDEV_DFB0_DPB_SRAM_BASE EQU 0x4000c200
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_DPB_SRAM_SIZE
CYDEV_DFB0_DPB_SRAM_SIZE EQU 0x00000200
    ENDIF
    IF :LNOT::DEF:CYREG_DFB0_DPB_SRAM_DATA_MBASE
CYREG_DFB0_DPB_SRAM_DATA_MBASE EQU 0x4000c200
    ENDIF
    IF :LNOT::DEF:CYREG_DFB0_DPB_SRAM_DATA_MSIZE
CYREG_DFB0_DPB_SRAM_DATA_MSIZE EQU 0x00000200
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_CSA_SRAM_BASE
CYDEV_DFB0_CSA_SRAM_BASE EQU 0x4000c400
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_CSA_SRAM_SIZE
CYDEV_DFB0_CSA_SRAM_SIZE EQU 0x00000100
    ENDIF
    IF :LNOT::DEF:CYREG_DFB0_CSA_SRAM_DATA_MBASE
CYREG_DFB0_CSA_SRAM_DATA_MBASE EQU 0x4000c400
    ENDIF
    IF :LNOT::DEF:CYREG_DFB0_CSA_SRAM_DATA_MSIZE
CYREG_DFB0_CSA_SRAM_DATA_MSIZE EQU 0x00000100
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_CSB_SRAM_BASE
CYDEV_DFB0_CSB_SRAM_BASE EQU 0x4000c500
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_CSB_SRAM_SIZE
CYDEV_DFB0_CSB_SRAM_SIZE EQU 0x00000100
    ENDIF
    IF :LNOT::DEF:CYREG_DFB0_CSB_SRAM_DATA_MBASE
CYREG_DFB0_CSB_SRAM_DATA_MBASE EQU 0x4000c500
    ENDIF
    IF :LNOT::DEF:CYREG_DFB0_CSB_SRAM_DATA_MSIZE
CYREG_DFB0_CSB_SRAM_DATA_MSIZE EQU 0x00000100
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_FSM_SRAM_BASE
CYDEV_DFB0_FSM_SRAM_BASE EQU 0x4000c600
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_FSM_SRAM_SIZE
CYDEV_DFB0_FSM_SRAM_SIZE EQU 0x00000100
    ENDIF
    IF :LNOT::DEF:CYREG_DFB0_FSM_SRAM_DATA_MBASE
CYREG_DFB0_FSM_SRAM_DATA_MBASE EQU 0x4000c600
    ENDIF
    IF :LNOT::DEF:CYREG_DFB0_FSM_SRAM_DATA_MSIZE
CYREG_DFB0_FSM_SRAM_DATA_MSIZE EQU 0x00000100
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_ACU_SRAM_BASE
CYDEV_DFB0_ACU_SRAM_BASE EQU 0x4000c700
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_ACU_SRAM_SIZE
CYDEV_DFB0_ACU_SRAM_SIZE EQU 0x00000040
    ENDIF
    IF :LNOT::DEF:CYREG_DFB0_ACU_SRAM_DATA_MBASE
CYREG_DFB0_ACU_SRAM_DATA_MBASE EQU 0x4000c700
    ENDIF
    IF :LNOT::DEF:CYREG_DFB0_ACU_SRAM_DATA_MSIZE
CYREG_DFB0_ACU_SRAM_DATA_MSIZE EQU 0x00000040
    ENDIF
    IF :LNOT::DEF:CYREG_DFB0_CR
CYREG_DFB0_CR EQU 0x4000c780
    ENDIF
    IF :LNOT::DEF:CYREG_DFB0_SR
CYREG_DFB0_SR EQU 0x4000c784
    ENDIF
    IF :LNOT::DEF:CYREG_DFB0_RAM_EN
CYREG_DFB0_RAM_EN EQU 0x4000c788
    ENDIF
    IF :LNOT::DEF:CYREG_DFB0_RAM_DIR
CYREG_DFB0_RAM_DIR EQU 0x4000c78c
    ENDIF
    IF :LNOT::DEF:CYREG_DFB0_SEMA
CYREG_DFB0_SEMA EQU 0x4000c790
    ENDIF
    IF :LNOT::DEF:CYREG_DFB0_DSI_CTRL
CYREG_DFB0_DSI_CTRL EQU 0x4000c794
    ENDIF
    IF :LNOT::DEF:CYREG_DFB0_INT_CTRL
CYREG_DFB0_INT_CTRL EQU 0x4000c798
    ENDIF
    IF :LNOT::DEF:CYREG_DFB0_DMA_CTRL
CYREG_DFB0_DMA_CTRL EQU 0x4000c79c
    ENDIF
    IF :LNOT::DEF:CYREG_DFB0_STAGEA
CYREG_DFB0_STAGEA EQU 0x4000c7a0
    ENDIF
    IF :LNOT::DEF:CYREG_DFB0_STAGEAM
CYREG_DFB0_STAGEAM EQU 0x4000c7a1
    ENDIF
    IF :LNOT::DEF:CYREG_DFB0_STAGEAH
CYREG_DFB0_STAGEAH EQU 0x4000c7a2
    ENDIF
    IF :LNOT::DEF:CYREG_DFB0_STAGEB
CYREG_DFB0_STAGEB EQU 0x4000c7a4
    ENDIF
    IF :LNOT::DEF:CYREG_DFB0_STAGEBM
CYREG_DFB0_STAGEBM EQU 0x4000c7a5
    ENDIF
    IF :LNOT::DEF:CYREG_DFB0_STAGEBH
CYREG_DFB0_STAGEBH EQU 0x4000c7a6
    ENDIF
    IF :LNOT::DEF:CYREG_DFB0_HOLDA
CYREG_DFB0_HOLDA EQU 0x4000c7a8
    ENDIF
    IF :LNOT::DEF:CYREG_DFB0_HOLDAM
CYREG_DFB0_HOLDAM EQU 0x4000c7a9
    ENDIF
    IF :LNOT::DEF:CYREG_DFB0_HOLDAH
CYREG_DFB0_HOLDAH EQU 0x4000c7aa
    ENDIF
    IF :LNOT::DEF:CYREG_DFB0_HOLDAS
CYREG_DFB0_HOLDAS EQU 0x4000c7ab
    ENDIF
    IF :LNOT::DEF:CYREG_DFB0_HOLDB
CYREG_DFB0_HOLDB EQU 0x4000c7ac
    ENDIF
    IF :LNOT::DEF:CYREG_DFB0_HOLDBM
CYREG_DFB0_HOLDBM EQU 0x4000c7ad
    ENDIF
    IF :LNOT::DEF:CYREG_DFB0_HOLDBH
CYREG_DFB0_HOLDBH EQU 0x4000c7ae
    ENDIF
    IF :LNOT::DEF:CYREG_DFB0_HOLDBS
CYREG_DFB0_HOLDBS EQU 0x4000c7af
    ENDIF
    IF :LNOT::DEF:CYREG_DFB0_COHER
