MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cydevicerv_trm.inc
CYREG_DFB0_COHER EQU 0x4000c7b0
    ENDIF
    IF :LNOT::DEF:CYREG_DFB0_DALIGN
CYREG_DFB0_DALIGN EQU 0x4000c7b4
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_BASE
CYDEV_UCFG_BASE EQU 0x40010000
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_SIZE
CYDEV_UCFG_SIZE EQU 0x00005040
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_BASE
CYDEV_UCFG_B0_BASE EQU 0x40010000
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_SIZE
CYDEV_UCFG_B0_SIZE EQU 0x00000fef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_BASE
CYDEV_UCFG_B0_P0_BASE EQU 0x40010000
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_SIZE
CYDEV_UCFG_B0_P0_SIZE EQU 0x000001ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_BASE
CYDEV_UCFG_B0_P0_U0_BASE EQU 0x40010000
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_SIZE
CYDEV_UCFG_B0_P0_U0_SIZE EQU 0x00000070
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_PLD_IT0
CYREG_B0_P0_U0_PLD_IT0 EQU 0x40010000
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_PLD_IT1
CYREG_B0_P0_U0_PLD_IT1 EQU 0x40010004
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_PLD_IT2
CYREG_B0_P0_U0_PLD_IT2 EQU 0x40010008
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_PLD_IT3
CYREG_B0_P0_U0_PLD_IT3 EQU 0x4001000c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_PLD_IT4
CYREG_B0_P0_U0_PLD_IT4 EQU 0x40010010
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_PLD_IT5
CYREG_B0_P0_U0_PLD_IT5 EQU 0x40010014
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_PLD_IT6
CYREG_B0_P0_U0_PLD_IT6 EQU 0x40010018
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_PLD_IT7
CYREG_B0_P0_U0_PLD_IT7 EQU 0x4001001c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_PLD_IT8
CYREG_B0_P0_U0_PLD_IT8 EQU 0x40010020
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_PLD_IT9
CYREG_B0_P0_U0_PLD_IT9 EQU 0x40010024
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_PLD_IT10
CYREG_B0_P0_U0_PLD_IT10 EQU 0x40010028
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_PLD_IT11
CYREG_B0_P0_U0_PLD_IT11 EQU 0x4001002c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_PLD_ORT0
CYREG_B0_P0_U0_PLD_ORT0 EQU 0x40010030
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_PLD_ORT1
CYREG_B0_P0_U0_PLD_ORT1 EQU 0x40010032
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_PLD_ORT2
CYREG_B0_P0_U0_PLD_ORT2 EQU 0x40010034
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_PLD_ORT3
CYREG_B0_P0_U0_PLD_ORT3 EQU 0x40010036
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_MC_CFG_CEN_CONST
CYREG_B0_P0_U0_MC_CFG_CEN_CONST EQU 0x40010038
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_MC_CFG_XORFB
CYREG_B0_P0_U0_MC_CFG_XORFB EQU 0x4001003a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_MC_CFG_SET_RESET
CYREG_B0_P0_U0_MC_CFG_SET_RESET EQU 0x4001003c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_MC_CFG_BYPASS
CYREG_B0_P0_U0_MC_CFG_BYPASS EQU 0x4001003e
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_CFG0
CYREG_B0_P0_U0_CFG0 EQU 0x40010040
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_CFG1
CYREG_B0_P0_U0_CFG1 EQU 0x40010041
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_CFG2
CYREG_B0_P0_U0_CFG2 EQU 0x40010042
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_CFG3
CYREG_B0_P0_U0_CFG3 EQU 0x40010043
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_CFG4
CYREG_B0_P0_U0_CFG4 EQU 0x40010044
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_CFG5
CYREG_B0_P0_U0_CFG5 EQU 0x40010045
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_CFG6
CYREG_B0_P0_U0_CFG6 EQU 0x40010046
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_CFG7
CYREG_B0_P0_U0_CFG7 EQU 0x40010047
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_CFG8
CYREG_B0_P0_U0_CFG8 EQU 0x40010048
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_CFG9
CYREG_B0_P0_U0_CFG9 EQU 0x40010049
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_CFG10
CYREG_B0_P0_U0_CFG10 EQU 0x4001004a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_CFG11
CYREG_B0_P0_U0_CFG11 EQU 0x4001004b
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_CFG12
CYREG_B0_P0_U0_CFG12 EQU 0x4001004c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_CFG13
CYREG_B0_P0_U0_CFG13 EQU 0x4001004d
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_CFG14
CYREG_B0_P0_U0_CFG14 EQU 0x4001004e
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_CFG15
CYREG_B0_P0_U0_CFG15 EQU 0x4001004f
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_CFG16
CYREG_B0_P0_U0_CFG16 EQU 0x40010050
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_CFG20
CYREG_B0_P0_U0_CFG20 EQU 0x40010054
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_CFG21
CYREG_B0_P0_U0_CFG21 EQU 0x40010055
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_CFG22
CYREG_B0_P0_U0_CFG22 EQU 0x40010056
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_CFG23
CYREG_B0_P0_U0_CFG23 EQU 0x40010057
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_CFG24
CYREG_B0_P0_U0_CFG24 EQU 0x40010058
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_CFG25
CYREG_B0_P0_U0_CFG25 EQU 0x40010059
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_CFG26
CYREG_B0_P0_U0_CFG26 EQU 0x4001005a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_CFG27
CYREG_B0_P0_U0_CFG27 EQU 0x4001005b
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_CFG28
CYREG_B0_P0_U0_CFG28 EQU 0x4001005c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_CFG29
CYREG_B0_P0_U0_CFG29 EQU 0x4001005d
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_CFG30
CYREG_B0_P0_U0_CFG30 EQU 0x4001005e
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_CFG31
CYREG_B0_P0_U0_CFG31 EQU 0x4001005f
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_DCFG0
CYREG_B0_P0_U0_DCFG0 EQU 0x40010060
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_DCFG1
CYREG_B0_P0_U0_DCFG1 EQU 0x40010062
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_DCFG2
CYREG_B0_P0_U0_DCFG2 EQU 0x40010064
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_DCFG3
CYREG_B0_P0_U0_DCFG3 EQU 0x40010066
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_DCFG4
CYREG_B0_P0_U0_DCFG4 EQU 0x40010068
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_DCFG5
CYREG_B0_P0_U0_DCFG5 EQU 0x4001006a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_DCFG6
CYREG_B0_P0_U0_DCFG6 EQU 0x4001006c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U0_DCFG7
CYREG_B0_P0_U0_DCFG7 EQU 0x4001006e
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_BASE
CYDEV_UCFG_B0_P0_U1_BASE EQU 0x40010080
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_SIZE
CYDEV_UCFG_B0_P0_U1_SIZE EQU 0x00000070
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_PLD_IT0
CYREG_B0_P0_U1_PLD_IT0 EQU 0x40010080
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_PLD_IT1
CYREG_B0_P0_U1_PLD_IT1 EQU 0x40010084
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_PLD_IT2
CYREG_B0_P0_U1_PLD_IT2 EQU 0x40010088
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_PLD_IT3
CYREG_B0_P0_U1_PLD_IT3 EQU 0x4001008c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_PLD_IT4
CYREG_B0_P0_U1_PLD_IT4 EQU 0x40010090
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_PLD_IT5
CYREG_B0_P0_U1_PLD_IT5 EQU 0x40010094
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_PLD_IT6
CYREG_B0_P0_U1_PLD_IT6 EQU 0x40010098
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_PLD_IT7
CYREG_B0_P0_U1_PLD_IT7 EQU 0x4001009c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_PLD_IT8
CYREG_B0_P0_U1_PLD_IT8 EQU 0x400100a0
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_PLD_IT9
CYREG_B0_P0_U1_PLD_IT9 EQU 0x400100a4
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_PLD_IT10
CYREG_B0_P0_U1_PLD_IT10 EQU 0x400100a8
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_PLD_IT11
CYREG_B0_P0_U1_PLD_IT11 EQU 0x400100ac
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_PLD_ORT0
CYREG_B0_P0_U1_PLD_ORT0 EQU 0x400100b0
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_PLD_ORT1
CYREG_B0_P0_U1_PLD_ORT1 EQU 0x400100b2
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_PLD_ORT2
CYREG_B0_P0_U1_PLD_ORT2 EQU 0x400100b4
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_PLD_ORT3
CYREG_B0_P0_U1_PLD_ORT3 EQU 0x400100b6
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_MC_CFG_CEN_CONST
CYREG_B0_P0_U1_MC_CFG_CEN_CONST EQU 0x400100b8
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_MC_CFG_XORFB
CYREG_B0_P0_U1_MC_CFG_XORFB EQU 0x400100ba
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_MC_CFG_SET_RESET
CYREG_B0_P0_U1_MC_CFG_SET_RESET EQU 0x400100bc
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_MC_CFG_BYPASS
CYREG_B0_P0_U1_MC_CFG_BYPASS EQU 0x400100be
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_CFG0
CYREG_B0_P0_U1_CFG0 EQU 0x400100c0
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_CFG1
CYREG_B0_P0_U1_CFG1 EQU 0x400100c1
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_CFG2
CYREG_B0_P0_U1_CFG2 EQU 0x400100c2
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_CFG3
CYREG_B0_P0_U1_CFG3 EQU 0x400100c3
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_CFG4
CYREG_B0_P0_U1_CFG4 EQU 0x400100c4
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_CFG5
CYREG_B0_P0_U1_CFG5 EQU 0x400100c5
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_CFG6
CYREG_B0_P0_U1_CFG6 EQU 0x400100c6
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_CFG7
CYREG_B0_P0_U1_CFG7 EQU 0x400100c7
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_CFG8
CYREG_B0_P0_U1_CFG8 EQU 0x400100c8
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_CFG9
CYREG_B0_P0_U1_CFG9 EQU 0x400100c9
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_CFG10
CYREG_B0_P0_U1_CFG10 EQU 0x400100ca
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_CFG11
CYREG_B0_P0_U1_CFG11 EQU 0x400100cb
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_CFG12
CYREG_B0_P0_U1_CFG12 EQU 0x400100cc
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_CFG13
CYREG_B0_P0_U1_CFG13 EQU 0x400100cd
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_CFG14
CYREG_B0_P0_U1_CFG14 EQU 0x400100ce
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_CFG15
CYREG_B0_P0_U1_CFG15 EQU 0x400100cf
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_CFG16
CYREG_B0_P0_U1_CFG16 EQU 0x400100d0
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_CFG20
CYREG_B0_P0_U1_CFG20 EQU 0x400100d4
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_CFG21
CYREG_B0_P0_U1_CFG21 EQU 0x400100d5
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_CFG22
CYREG_B0_P0_U1_CFG22 EQU 0x400100d6
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_CFG23
CYREG_B0_P0_U1_CFG23 EQU 0x400100d7
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_CFG24
CYREG_B0_P0_U1_CFG24 EQU 0x400100d8
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_CFG25
CYREG_B0_P0_U1_CFG25 EQU 0x400100d9
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_CFG26
CYREG_B0_P0_U1_CFG26 EQU 0x400100da
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_CFG27
CYREG_B0_P0_U1_CFG27 EQU 0x400100db
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_CFG28
CYREG_B0_P0_U1_CFG28 EQU 0x400100dc
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_CFG29
CYREG_B0_P0_U1_CFG29 EQU 0x400100dd
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_CFG30
CYREG_B0_P0_U1_CFG30 EQU 0x400100de
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_CFG31
CYREG_B0_P0_U1_CFG31 EQU 0x400100df
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_DCFG0
CYREG_B0_P0_U1_DCFG0 EQU 0x400100e0
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_DCFG1
CYREG_B0_P0_U1_DCFG1 EQU 0x400100e2
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_DCFG2
CYREG_B0_P0_U1_DCFG2 EQU 0x400100e4
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_DCFG3
CYREG_B0_P0_U1_DCFG3 EQU 0x400100e6
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_DCFG4
CYREG_B0_P0_U1_DCFG4 EQU 0x400100e8
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_DCFG5
CYREG_B0_P0_U1_DCFG5 EQU 0x400100ea
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_DCFG6
CYREG_B0_P0_U1_DCFG6 EQU 0x400100ec
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P0_U1_DCFG7
CYREG_B0_P0_U1_DCFG7 EQU 0x400100ee
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_ROUTE_BASE
CYDEV_UCFG_B0_P0_ROUTE_BASE EQU 0x40010100
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_ROUTE_SIZE
CYDEV_UCFG_B0_P0_ROUTE_SIZE EQU 0x000000ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_BASE
CYDEV_UCFG_B0_P1_BASE EQU 0x40010200
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_SIZE
CYDEV_UCFG_B0_P1_SIZE EQU 0x000001ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_BASE
CYDEV_UCFG_B0_P1_U0_BASE EQU 0x40010200
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_SIZE
CYDEV_UCFG_B0_P1_U0_SIZE EQU 0x00000070
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_PLD_IT0
CYREG_B0_P1_U0_PLD_IT0 EQU 0x40010200
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_PLD_IT1
CYREG_B0_P1_U0_PLD_IT1 EQU 0x40010204
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_PLD_IT2
CYREG_B0_P1_U0_PLD_IT2 EQU 0x40010208
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_PLD_IT3
CYREG_B0_P1_U0_PLD_IT3 EQU 0x4001020c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_PLD_IT4
CYREG_B0_P1_U0_PLD_IT4 EQU 0x40010210
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_PLD_IT5
CYREG_B0_P1_U0_PLD_IT5 EQU 0x40010214
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_PLD_IT6
CYREG_B0_P1_U0_PLD_IT6 EQU 0x40010218
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_PLD_IT7
CYREG_B0_P1_U0_PLD_IT7 EQU 0x4001021c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_PLD_IT8
CYREG_B0_P1_U0_PLD_IT8 EQU 0x40010220
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_PLD_IT9
CYREG_B0_P1_U0_PLD_IT9 EQU 0x40010224
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_PLD_IT10
CYREG_B0_P1_U0_PLD_IT10 EQU 0x40010228
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_PLD_IT11
CYREG_B0_P1_U0_PLD_IT11 EQU 0x4001022c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_PLD_ORT0
CYREG_B0_P1_U0_PLD_ORT0 EQU 0x40010230
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_PLD_ORT1
CYREG_B0_P1_U0_PLD_ORT1 EQU 0x40010232
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_PLD_ORT2
CYREG_B0_P1_U0_PLD_ORT2 EQU 0x40010234
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_PLD_ORT3
CYREG_B0_P1_U0_PLD_ORT3 EQU 0x40010236
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_MC_CFG_CEN_CONST
CYREG_B0_P1_U0_MC_CFG_CEN_CONST EQU 0x40010238
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_MC_CFG_XORFB
CYREG_B0_P1_U0_MC_CFG_XORFB EQU 0x4001023a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_MC_CFG_SET_RESET
CYREG_B0_P1_U0_MC_CFG_SET_RESET EQU 0x4001023c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_MC_CFG_BYPASS
CYREG_B0_P1_U0_MC_CFG_BYPASS EQU 0x4001023e
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_CFG0
CYREG_B0_P1_U0_CFG0 EQU 0x40010240
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_CFG1
CYREG_B0_P1_U0_CFG1 EQU 0x40010241
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_CFG2
CYREG_B0_P1_U0_CFG2 EQU 0x40010242
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_CFG3
CYREG_B0_P1_U0_CFG3 EQU 0x40010243
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_CFG4
CYREG_B0_P1_U0_CFG4 EQU 0x40010244
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_CFG5
CYREG_B0_P1_U0_CFG5 EQU 0x40010245
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_CFG6
CYREG_B0_P1_U0_CFG6 EQU 0x40010246
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_CFG7
CYREG_B0_P1_U0_CFG7 EQU 0x40010247
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_CFG8
CYREG_B0_P1_U0_CFG8 EQU 0x40010248
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_CFG9
CYREG_B0_P1_U0_CFG9 EQU 0x40010249
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_CFG10
CYREG_B0_P1_U0_CFG10 EQU 0x4001024a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_CFG11
CYREG_B0_P1_U0_CFG11 EQU 0x4001024b
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_CFG12
CYREG_B0_P1_U0_CFG12 EQU 0x4001024c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_CFG13
CYREG_B0_P1_U0_CFG13 EQU 0x4001024d
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_CFG14
CYREG_B0_P1_U0_CFG14 EQU 0x4001024e
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_CFG15
CYREG_B0_P1_U0_CFG15 EQU 0x4001024f
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_CFG16
CYREG_B0_P1_U0_CFG16 EQU 0x40010250
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_CFG20
CYREG_B0_P1_U0_CFG20 EQU 0x40010254
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_CFG21
CYREG_B0_P1_U0_CFG21 EQU 0x40010255
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_CFG22
CYREG_B0_P1_U0_CFG22 EQU 0x40010256
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_CFG23
CYREG_B0_P1_U0_CFG23 EQU 0x40010257
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_CFG24
CYREG_B0_P1_U0_CFG24 EQU 0x40010258
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_CFG25
CYREG_B0_P1_U0_CFG25 EQU 0x40010259
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_CFG26
CYREG_B0_P1_U0_CFG26 EQU 0x4001025a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_CFG27
CYREG_B0_P1_U0_CFG27 EQU 0x4001025b
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_CFG28
CYREG_B0_P1_U0_CFG28 EQU 0x4001025c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_CFG29
CYREG_B0_P1_U0_CFG29 EQU 0x4001025d
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_CFG30
CYREG_B0_P1_U0_CFG30 EQU 0x4001025e
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_CFG31
CYREG_B0_P1_U0_CFG31 EQU 0x4001025f
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_DCFG0
CYREG_B0_P1_U0_DCFG0 EQU 0x40010260
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_DCFG1
CYREG_B0_P1_U0_DCFG1 EQU 0x40010262
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_DCFG2
CYREG_B0_P1_U0_DCFG2 EQU 0x40010264
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_DCFG3
CYREG_B0_P1_U0_DCFG3 EQU 0x40010266
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_DCFG4
CYREG_B0_P1_U0_DCFG4 EQU 0x40010268
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_DCFG5
CYREG_B0_P1_U0_DCFG5 EQU 0x4001026a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_DCFG6
CYREG_B0_P1_U0_DCFG6 EQU 0x4001026c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U0_DCFG7
CYREG_B0_P1_U0_DCFG7 EQU 0x4001026e
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_BASE
CYDEV_UCFG_B0_P1_U1_BASE EQU 0x40010280
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_SIZE
CYDEV_UCFG_B0_P1_U1_SIZE EQU 0x00000070
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_PLD_IT0
CYREG_B0_P1_U1_PLD_IT0 EQU 0x40010280
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_PLD_IT1
CYREG_B0_P1_U1_PLD_IT1 EQU 0x40010284
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_PLD_IT2
CYREG_B0_P1_U1_PLD_IT2 EQU 0x40010288
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_PLD_IT3
CYREG_B0_P1_U1_PLD_IT3 EQU 0x4001028c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_PLD_IT4
CYREG_B0_P1_U1_PLD_IT4 EQU 0x40010290
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_PLD_IT5
CYREG_B0_P1_U1_PLD_IT5 EQU 0x40010294
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_PLD_IT6
CYREG_B0_P1_U1_PLD_IT6 EQU 0x40010298
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_PLD_IT7
CYREG_B0_P1_U1_PLD_IT7 EQU 0x4001029c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_PLD_IT8
CYREG_B0_P1_U1_PLD_IT8 EQU 0x400102a0
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_PLD_IT9
CYREG_B0_P1_U1_PLD_IT9 EQU 0x400102a4
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_PLD_IT10
CYREG_B0_P1_U1_PLD_IT10 EQU 0x400102a8
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_PLD_IT11
CYREG_B0_P1_U1_PLD_IT11 EQU 0x400102ac
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_PLD_ORT0
CYREG_B0_P1_U1_PLD_ORT0 EQU 0x400102b0
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_PLD_ORT1
CYREG_B0_P1_U1_PLD_ORT1 EQU 0x400102b2
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_PLD_ORT2
CYREG_B0_P1_U1_PLD_ORT2 EQU 0x400102b4
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_PLD_ORT3
CYREG_B0_P1_U1_PLD_ORT3 EQU 0x400102b6
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_MC_CFG_CEN_CONST
CYREG_B0_P1_U1_MC_CFG_CEN_CONST EQU 0x400102b8
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_MC_CFG_XORFB
CYREG_B0_P1_U1_MC_CFG_XORFB EQU 0x400102ba
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_MC_CFG_SET_RESET
CYREG_B0_P1_U1_MC_CFG_SET_RESET EQU 0x400102bc
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_MC_CFG_BYPASS
CYREG_B0_P1_U1_MC_CFG_BYPASS EQU 0x400102be
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_CFG0
CYREG_B0_P1_U1_CFG0 EQU 0x400102c0
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_CFG1
CYREG_B0_P1_U1_CFG1 EQU 0x400102c1
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_CFG2
CYREG_B0_P1_U1_CFG2 EQU 0x400102c2
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_CFG3
CYREG_B0_P1_U1_CFG3 EQU 0x400102c3
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_CFG4
CYREG_B0_P1_U1_CFG4 EQU 0x400102c4
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_CFG5
CYREG_B0_P1_U1_CFG5 EQU 0x400102c5
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_CFG6
CYREG_B0_P1_U1_CFG6 EQU 0x400102c6
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_CFG7
CYREG_B0_P1_U1_CFG7 EQU 0x400102c7
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_CFG8
CYREG_B0_P1_U1_CFG8 EQU 0x400102c8
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_CFG9
CYREG_B0_P1_U1_CFG9 EQU 0x400102c9
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_CFG10
CYREG_B0_P1_U1_CFG10 EQU 0x400102ca
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_CFG11
CYREG_B0_P1_U1_CFG11 EQU 0x400102cb
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_CFG12
CYREG_B0_P1_U1_CFG12 EQU 0x400102cc
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_CFG13
CYREG_B0_P1_U1_CFG13 EQU 0x400102cd
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_CFG14
CYREG_B0_P1_U1_CFG14 EQU 0x400102ce
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_CFG15
CYREG_B0_P1_U1_CFG15 EQU 0x400102cf
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_CFG16
CYREG_B0_P1_U1_CFG16 EQU 0x400102d0
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_CFG20
CYREG_B0_P1_U1_CFG20 EQU 0x400102d4
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_CFG21
CYREG_B0_P1_U1_CFG21 EQU 0x400102d5
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_CFG22
CYREG_B0_P1_U1_CFG22 EQU 0x400102d6
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_CFG23
CYREG_B0_P1_U1_CFG23 EQU 0x400102d7
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_CFG24
CYREG_B0_P1_U1_CFG24 EQU 0x400102d8
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_CFG25
CYREG_B0_P1_U1_CFG25 EQU 0x400102d9
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_CFG26
CYREG_B0_P1_U1_CFG26 EQU 0x400102da
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_CFG27
CYREG_B0_P1_U1_CFG27 EQU 0x400102db
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_CFG28
CYREG_B0_P1_U1_CFG28 EQU 0x400102dc
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_CFG29
CYREG_B0_P1_U1_CFG29 EQU 0x400102dd
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_CFG30
CYREG_B0_P1_U1_CFG30 EQU 0x400102de
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_CFG31
CYREG_B0_P1_U1_CFG31 EQU 0x400102df
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_DCFG0
CYREG_B0_P1_U1_DCFG0 EQU 0x400102e0
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_DCFG1
CYREG_B0_P1_U1_DCFG1 EQU 0x400102e2
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_DCFG2
CYREG_B0_P1_U1_DCFG2 EQU 0x400102e4
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_DCFG3
CYREG_B0_P1_U1_DCFG3 EQU 0x400102e6
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_DCFG4
CYREG_B0_P1_U1_DCFG4 EQU 0x400102e8
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_DCFG5
CYREG_B0_P1_U1_DCFG5 EQU 0x400102ea
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_DCFG6
CYREG_B0_P1_U1_DCFG6 EQU 0x400102ec
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P1_U1_DCFG7
CYREG_B0_P1_U1_DCFG7 EQU 0x400102ee
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_ROUTE_BASE
CYDEV_UCFG_B0_P1_ROUTE_BASE EQU 0x40010300
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_ROUTE_SIZE
CYDEV_UCFG_B0_P1_ROUTE_SIZE EQU 0x000000ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_BASE
CYDEV_UCFG_B0_P2_BASE EQU 0x40010400
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_SIZE
CYDEV_UCFG_B0_P2_SIZE EQU 0x000001ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_BASE
CYDEV_UCFG_B0_P2_U0_BASE EQU 0x40010400
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_SIZE
CYDEV_UCFG_B0_P2_U0_SIZE EQU 0x00000070
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P2_U0_PLD_IT0
CYREG_B0_P2_U0_PLD_IT0 EQU 0x40010400
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P2_U0_PLD_IT1
CYREG_B0_P2_U0_PLD_IT1 EQU 0x40010404
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P2_U0_PLD_IT2
CYREG_B0_P2_U0_PLD_IT2 EQU 0x40010408
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P2_U0_PLD_IT3
CYREG_B0_P2_U0_PLD_IT3 EQU 0x4001040c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P2_U0_PLD_IT4
CYREG_B0_P2_U0_PLD_IT4 EQU 0x40010410
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P2_U0_PLD_IT5
CYREG_B0_P2_U0_PLD_IT5 EQU 0x40010414
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P2_U0_PLD_IT6
CYREG_B0_P2_U0_PLD_IT6 EQU 0x40010418
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P2_U0_PLD_IT7
CYREG_B0_P2_U0_PLD_IT7 EQU 0x4001041c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P2_U0_PLD_IT8
CYREG_B0_P2_U0_PLD_IT8 EQU 0x40010420
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P2_U0_PLD_IT9
CYREG_B0_P2_U0_PLD_IT9 EQU 0x40010424
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P2_U0_PLD_IT10
CYREG_B0_P2_U0_PLD_IT10 EQU 0x40010428
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P2_U0_PLD_IT11
