MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cydevicerv_trm.inc
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U0_CFG12
CYREG_B0_P4_U0_CFG12 EQU 0x4001084c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U0_CFG13
CYREG_B0_P4_U0_CFG13 EQU 0x4001084d
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U0_CFG14
CYREG_B0_P4_U0_CFG14 EQU 0x4001084e
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U0_CFG15
CYREG_B0_P4_U0_CFG15 EQU 0x4001084f
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U0_CFG16
CYREG_B0_P4_U0_CFG16 EQU 0x40010850
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U0_CFG20
CYREG_B0_P4_U0_CFG20 EQU 0x40010854
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U0_CFG21
CYREG_B0_P4_U0_CFG21 EQU 0x40010855
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U0_CFG22
CYREG_B0_P4_U0_CFG22 EQU 0x40010856
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U0_CFG23
CYREG_B0_P4_U0_CFG23 EQU 0x40010857
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U0_CFG24
CYREG_B0_P4_U0_CFG24 EQU 0x40010858
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U0_CFG25
CYREG_B0_P4_U0_CFG25 EQU 0x40010859
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U0_CFG26
CYREG_B0_P4_U0_CFG26 EQU 0x4001085a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U0_CFG27
CYREG_B0_P4_U0_CFG27 EQU 0x4001085b
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U0_CFG28
CYREG_B0_P4_U0_CFG28 EQU 0x4001085c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U0_CFG29
CYREG_B0_P4_U0_CFG29 EQU 0x4001085d
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U0_CFG30
CYREG_B0_P4_U0_CFG30 EQU 0x4001085e
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U0_CFG31
CYREG_B0_P4_U0_CFG31 EQU 0x4001085f
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U0_DCFG0
CYREG_B0_P4_U0_DCFG0 EQU 0x40010860
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U0_DCFG1
CYREG_B0_P4_U0_DCFG1 EQU 0x40010862
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U0_DCFG2
CYREG_B0_P4_U0_DCFG2 EQU 0x40010864
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U0_DCFG3
CYREG_B0_P4_U0_DCFG3 EQU 0x40010866
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U0_DCFG4
CYREG_B0_P4_U0_DCFG4 EQU 0x40010868
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U0_DCFG5
CYREG_B0_P4_U0_DCFG5 EQU 0x4001086a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U0_DCFG6
CYREG_B0_P4_U0_DCFG6 EQU 0x4001086c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U0_DCFG7
CYREG_B0_P4_U0_DCFG7 EQU 0x4001086e
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_BASE
CYDEV_UCFG_B0_P4_U1_BASE EQU 0x40010880
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_SIZE
CYDEV_UCFG_B0_P4_U1_SIZE EQU 0x00000070
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_PLD_IT0
CYREG_B0_P4_U1_PLD_IT0 EQU 0x40010880
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_PLD_IT1
CYREG_B0_P4_U1_PLD_IT1 EQU 0x40010884
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_PLD_IT2
CYREG_B0_P4_U1_PLD_IT2 EQU 0x40010888
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_PLD_IT3
CYREG_B0_P4_U1_PLD_IT3 EQU 0x4001088c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_PLD_IT4
CYREG_B0_P4_U1_PLD_IT4 EQU 0x40010890
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_PLD_IT5
CYREG_B0_P4_U1_PLD_IT5 EQU 0x40010894
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_PLD_IT6
CYREG_B0_P4_U1_PLD_IT6 EQU 0x40010898
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_PLD_IT7
CYREG_B0_P4_U1_PLD_IT7 EQU 0x4001089c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_PLD_IT8
CYREG_B0_P4_U1_PLD_IT8 EQU 0x400108a0
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_PLD_IT9
CYREG_B0_P4_U1_PLD_IT9 EQU 0x400108a4
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_PLD_IT10
CYREG_B0_P4_U1_PLD_IT10 EQU 0x400108a8
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_PLD_IT11
CYREG_B0_P4_U1_PLD_IT11 EQU 0x400108ac
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_PLD_ORT0
CYREG_B0_P4_U1_PLD_ORT0 EQU 0x400108b0
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_PLD_ORT1
CYREG_B0_P4_U1_PLD_ORT1 EQU 0x400108b2
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_PLD_ORT2
CYREG_B0_P4_U1_PLD_ORT2 EQU 0x400108b4
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_PLD_ORT3
CYREG_B0_P4_U1_PLD_ORT3 EQU 0x400108b6
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_MC_CFG_CEN_CONST
CYREG_B0_P4_U1_MC_CFG_CEN_CONST EQU 0x400108b8
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_MC_CFG_XORFB
CYREG_B0_P4_U1_MC_CFG_XORFB EQU 0x400108ba
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_MC_CFG_SET_RESET
CYREG_B0_P4_U1_MC_CFG_SET_RESET EQU 0x400108bc
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_MC_CFG_BYPASS
CYREG_B0_P4_U1_MC_CFG_BYPASS EQU 0x400108be
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_CFG0
CYREG_B0_P4_U1_CFG0 EQU 0x400108c0
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_CFG1
CYREG_B0_P4_U1_CFG1 EQU 0x400108c1
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_CFG2
CYREG_B0_P4_U1_CFG2 EQU 0x400108c2
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_CFG3
CYREG_B0_P4_U1_CFG3 EQU 0x400108c3
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_CFG4
CYREG_B0_P4_U1_CFG4 EQU 0x400108c4
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_CFG5
CYREG_B0_P4_U1_CFG5 EQU 0x400108c5
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_CFG6
CYREG_B0_P4_U1_CFG6 EQU 0x400108c6
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_CFG7
CYREG_B0_P4_U1_CFG7 EQU 0x400108c7
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_CFG8
CYREG_B0_P4_U1_CFG8 EQU 0x400108c8
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_CFG9
CYREG_B0_P4_U1_CFG9 EQU 0x400108c9
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_CFG10
CYREG_B0_P4_U1_CFG10 EQU 0x400108ca
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_CFG11
CYREG_B0_P4_U1_CFG11 EQU 0x400108cb
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_CFG12
CYREG_B0_P4_U1_CFG12 EQU 0x400108cc
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_CFG13
CYREG_B0_P4_U1_CFG13 EQU 0x400108cd
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_CFG14
CYREG_B0_P4_U1_CFG14 EQU 0x400108ce
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_CFG15
CYREG_B0_P4_U1_CFG15 EQU 0x400108cf
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_CFG16
CYREG_B0_P4_U1_CFG16 EQU 0x400108d0
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_CFG20
CYREG_B0_P4_U1_CFG20 EQU 0x400108d4
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_CFG21
CYREG_B0_P4_U1_CFG21 EQU 0x400108d5
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_CFG22
CYREG_B0_P4_U1_CFG22 EQU 0x400108d6
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_CFG23
CYREG_B0_P4_U1_CFG23 EQU 0x400108d7
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_CFG24
CYREG_B0_P4_U1_CFG24 EQU 0x400108d8
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_CFG25
CYREG_B0_P4_U1_CFG25 EQU 0x400108d9
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_CFG26
CYREG_B0_P4_U1_CFG26 EQU 0x400108da
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_CFG27
CYREG_B0_P4_U1_CFG27 EQU 0x400108db
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_CFG28
CYREG_B0_P4_U1_CFG28 EQU 0x400108dc
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_CFG29
CYREG_B0_P4_U1_CFG29 EQU 0x400108dd
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_CFG30
CYREG_B0_P4_U1_CFG30 EQU 0x400108de
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_CFG31
CYREG_B0_P4_U1_CFG31 EQU 0x400108df
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_DCFG0
CYREG_B0_P4_U1_DCFG0 EQU 0x400108e0
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_DCFG1
CYREG_B0_P4_U1_DCFG1 EQU 0x400108e2
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_DCFG2
CYREG_B0_P4_U1_DCFG2 EQU 0x400108e4
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_DCFG3
CYREG_B0_P4_U1_DCFG3 EQU 0x400108e6
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_DCFG4
CYREG_B0_P4_U1_DCFG4 EQU 0x400108e8
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_DCFG5
CYREG_B0_P4_U1_DCFG5 EQU 0x400108ea
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_DCFG6
CYREG_B0_P4_U1_DCFG6 EQU 0x400108ec
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P4_U1_DCFG7
CYREG_B0_P4_U1_DCFG7 EQU 0x400108ee
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_ROUTE_BASE
CYDEV_UCFG_B0_P4_ROUTE_BASE EQU 0x40010900
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_ROUTE_SIZE
CYDEV_UCFG_B0_P4_ROUTE_SIZE EQU 0x000000ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_BASE
CYDEV_UCFG_B0_P5_BASE EQU 0x40010a00
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_SIZE
CYDEV_UCFG_B0_P5_SIZE EQU 0x000001ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_BASE
CYDEV_UCFG_B0_P5_U0_BASE EQU 0x40010a00
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_SIZE
CYDEV_UCFG_B0_P5_U0_SIZE EQU 0x00000070
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_PLD_IT0
CYREG_B0_P5_U0_PLD_IT0 EQU 0x40010a00
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_PLD_IT1
CYREG_B0_P5_U0_PLD_IT1 EQU 0x40010a04
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_PLD_IT2
CYREG_B0_P5_U0_PLD_IT2 EQU 0x40010a08
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_PLD_IT3
CYREG_B0_P5_U0_PLD_IT3 EQU 0x40010a0c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_PLD_IT4
CYREG_B0_P5_U0_PLD_IT4 EQU 0x40010a10
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_PLD_IT5
CYREG_B0_P5_U0_PLD_IT5 EQU 0x40010a14
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_PLD_IT6
CYREG_B0_P5_U0_PLD_IT6 EQU 0x40010a18
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_PLD_IT7
CYREG_B0_P5_U0_PLD_IT7 EQU 0x40010a1c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_PLD_IT8
CYREG_B0_P5_U0_PLD_IT8 EQU 0x40010a20
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_PLD_IT9
CYREG_B0_P5_U0_PLD_IT9 EQU 0x40010a24
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_PLD_IT10
CYREG_B0_P5_U0_PLD_IT10 EQU 0x40010a28
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_PLD_IT11
CYREG_B0_P5_U0_PLD_IT11 EQU 0x40010a2c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_PLD_ORT0
CYREG_B0_P5_U0_PLD_ORT0 EQU 0x40010a30
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_PLD_ORT1
CYREG_B0_P5_U0_PLD_ORT1 EQU 0x40010a32
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_PLD_ORT2
CYREG_B0_P5_U0_PLD_ORT2 EQU 0x40010a34
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_PLD_ORT3
CYREG_B0_P5_U0_PLD_ORT3 EQU 0x40010a36
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_MC_CFG_CEN_CONST
CYREG_B0_P5_U0_MC_CFG_CEN_CONST EQU 0x40010a38
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_MC_CFG_XORFB
CYREG_B0_P5_U0_MC_CFG_XORFB EQU 0x40010a3a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_MC_CFG_SET_RESET
CYREG_B0_P5_U0_MC_CFG_SET_RESET EQU 0x40010a3c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_MC_CFG_BYPASS
CYREG_B0_P5_U0_MC_CFG_BYPASS EQU 0x40010a3e
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_CFG0
CYREG_B0_P5_U0_CFG0 EQU 0x40010a40
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_CFG1
CYREG_B0_P5_U0_CFG1 EQU 0x40010a41
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_CFG2
CYREG_B0_P5_U0_CFG2 EQU 0x40010a42
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_CFG3
CYREG_B0_P5_U0_CFG3 EQU 0x40010a43
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_CFG4
CYREG_B0_P5_U0_CFG4 EQU 0x40010a44
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_CFG5
CYREG_B0_P5_U0_CFG5 EQU 0x40010a45
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_CFG6
CYREG_B0_P5_U0_CFG6 EQU 0x40010a46
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_CFG7
CYREG_B0_P5_U0_CFG7 EQU 0x40010a47
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_CFG8
CYREG_B0_P5_U0_CFG8 EQU 0x40010a48
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_CFG9
CYREG_B0_P5_U0_CFG9 EQU 0x40010a49
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_CFG10
CYREG_B0_P5_U0_CFG10 EQU 0x40010a4a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_CFG11
CYREG_B0_P5_U0_CFG11 EQU 0x40010a4b
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_CFG12
CYREG_B0_P5_U0_CFG12 EQU 0x40010a4c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_CFG13
CYREG_B0_P5_U0_CFG13 EQU 0x40010a4d
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_CFG14
CYREG_B0_P5_U0_CFG14 EQU 0x40010a4e
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_CFG15
CYREG_B0_P5_U0_CFG15 EQU 0x40010a4f
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_CFG16
CYREG_B0_P5_U0_CFG16 EQU 0x40010a50
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_CFG20
CYREG_B0_P5_U0_CFG20 EQU 0x40010a54
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_CFG21
CYREG_B0_P5_U0_CFG21 EQU 0x40010a55
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_CFG22
CYREG_B0_P5_U0_CFG22 EQU 0x40010a56
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_CFG23
CYREG_B0_P5_U0_CFG23 EQU 0x40010a57
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_CFG24
CYREG_B0_P5_U0_CFG24 EQU 0x40010a58
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_CFG25
CYREG_B0_P5_U0_CFG25 EQU 0x40010a59
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_CFG26
CYREG_B0_P5_U0_CFG26 EQU 0x40010a5a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_CFG27
CYREG_B0_P5_U0_CFG27 EQU 0x40010a5b
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_CFG28
CYREG_B0_P5_U0_CFG28 EQU 0x40010a5c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_CFG29
CYREG_B0_P5_U0_CFG29 EQU 0x40010a5d
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_CFG30
CYREG_B0_P5_U0_CFG30 EQU 0x40010a5e
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_CFG31
CYREG_B0_P5_U0_CFG31 EQU 0x40010a5f
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_DCFG0
CYREG_B0_P5_U0_DCFG0 EQU 0x40010a60
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_DCFG1
CYREG_B0_P5_U0_DCFG1 EQU 0x40010a62
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_DCFG2
CYREG_B0_P5_U0_DCFG2 EQU 0x40010a64
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_DCFG3
CYREG_B0_P5_U0_DCFG3 EQU 0x40010a66
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_DCFG4
CYREG_B0_P5_U0_DCFG4 EQU 0x40010a68
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_DCFG5
CYREG_B0_P5_U0_DCFG5 EQU 0x40010a6a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_DCFG6
CYREG_B0_P5_U0_DCFG6 EQU 0x40010a6c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U0_DCFG7
CYREG_B0_P5_U0_DCFG7 EQU 0x40010a6e
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_BASE
CYDEV_UCFG_B0_P5_U1_BASE EQU 0x40010a80
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_SIZE
CYDEV_UCFG_B0_P5_U1_SIZE EQU 0x00000070
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_PLD_IT0
CYREG_B0_P5_U1_PLD_IT0 EQU 0x40010a80
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_PLD_IT1
CYREG_B0_P5_U1_PLD_IT1 EQU 0x40010a84
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_PLD_IT2
CYREG_B0_P5_U1_PLD_IT2 EQU 0x40010a88
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_PLD_IT3
CYREG_B0_P5_U1_PLD_IT3 EQU 0x40010a8c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_PLD_IT4
CYREG_B0_P5_U1_PLD_IT4 EQU 0x40010a90
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_PLD_IT5
CYREG_B0_P5_U1_PLD_IT5 EQU 0x40010a94
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_PLD_IT6
CYREG_B0_P5_U1_PLD_IT6 EQU 0x40010a98
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_PLD_IT7
CYREG_B0_P5_U1_PLD_IT7 EQU 0x40010a9c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_PLD_IT8
CYREG_B0_P5_U1_PLD_IT8 EQU 0x40010aa0
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_PLD_IT9
CYREG_B0_P5_U1_PLD_IT9 EQU 0x40010aa4
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_PLD_IT10
CYREG_B0_P5_U1_PLD_IT10 EQU 0x40010aa8
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_PLD_IT11
CYREG_B0_P5_U1_PLD_IT11 EQU 0x40010aac
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_PLD_ORT0
CYREG_B0_P5_U1_PLD_ORT0 EQU 0x40010ab0
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_PLD_ORT1
CYREG_B0_P5_U1_PLD_ORT1 EQU 0x40010ab2
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_PLD_ORT2
CYREG_B0_P5_U1_PLD_ORT2 EQU 0x40010ab4
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_PLD_ORT3
CYREG_B0_P5_U1_PLD_ORT3 EQU 0x40010ab6
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_MC_CFG_CEN_CONST
CYREG_B0_P5_U1_MC_CFG_CEN_CONST EQU 0x40010ab8
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_MC_CFG_XORFB
CYREG_B0_P5_U1_MC_CFG_XORFB EQU 0x40010aba
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_MC_CFG_SET_RESET
CYREG_B0_P5_U1_MC_CFG_SET_RESET EQU 0x40010abc
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_MC_CFG_BYPASS
CYREG_B0_P5_U1_MC_CFG_BYPASS EQU 0x40010abe
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_CFG0
CYREG_B0_P5_U1_CFG0 EQU 0x40010ac0
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_CFG1
CYREG_B0_P5_U1_CFG1 EQU 0x40010ac1
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_CFG2
CYREG_B0_P5_U1_CFG2 EQU 0x40010ac2
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_CFG3
CYREG_B0_P5_U1_CFG3 EQU 0x40010ac3
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_CFG4
CYREG_B0_P5_U1_CFG4 EQU 0x40010ac4
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_CFG5
CYREG_B0_P5_U1_CFG5 EQU 0x40010ac5
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_CFG6
CYREG_B0_P5_U1_CFG6 EQU 0x40010ac6
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_CFG7
CYREG_B0_P5_U1_CFG7 EQU 0x40010ac7
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_CFG8
CYREG_B0_P5_U1_CFG8 EQU 0x40010ac8
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_CFG9
CYREG_B0_P5_U1_CFG9 EQU 0x40010ac9
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_CFG10
CYREG_B0_P5_U1_CFG10 EQU 0x40010aca
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_CFG11
CYREG_B0_P5_U1_CFG11 EQU 0x40010acb
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_CFG12
CYREG_B0_P5_U1_CFG12 EQU 0x40010acc
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_CFG13
CYREG_B0_P5_U1_CFG13 EQU 0x40010acd
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_CFG14
CYREG_B0_P5_U1_CFG14 EQU 0x40010ace
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_CFG15
CYREG_B0_P5_U1_CFG15 EQU 0x40010acf
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_CFG16
CYREG_B0_P5_U1_CFG16 EQU 0x40010ad0
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_CFG20
CYREG_B0_P5_U1_CFG20 EQU 0x40010ad4
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_CFG21
CYREG_B0_P5_U1_CFG21 EQU 0x40010ad5
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_CFG22
CYREG_B0_P5_U1_CFG22 EQU 0x40010ad6
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_CFG23
CYREG_B0_P5_U1_CFG23 EQU 0x40010ad7
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_CFG24
CYREG_B0_P5_U1_CFG24 EQU 0x40010ad8
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_CFG25
CYREG_B0_P5_U1_CFG25 EQU 0x40010ad9
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_CFG26
CYREG_B0_P5_U1_CFG26 EQU 0x40010ada
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_CFG27
CYREG_B0_P5_U1_CFG27 EQU 0x40010adb
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_CFG28
CYREG_B0_P5_U1_CFG28 EQU 0x40010adc
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_CFG29
CYREG_B0_P5_U1_CFG29 EQU 0x40010add
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_CFG30
CYREG_B0_P5_U1_CFG30 EQU 0x40010ade
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_CFG31
CYREG_B0_P5_U1_CFG31 EQU 0x40010adf
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_DCFG0
CYREG_B0_P5_U1_DCFG0 EQU 0x40010ae0
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_DCFG1
CYREG_B0_P5_U1_DCFG1 EQU 0x40010ae2
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_DCFG2
CYREG_B0_P5_U1_DCFG2 EQU 0x40010ae4
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_DCFG3
CYREG_B0_P5_U1_DCFG3 EQU 0x40010ae6
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_DCFG4
CYREG_B0_P5_U1_DCFG4 EQU 0x40010ae8
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_DCFG5
CYREG_B0_P5_U1_DCFG5 EQU 0x40010aea
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_DCFG6
CYREG_B0_P5_U1_DCFG6 EQU 0x40010aec
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P5_U1_DCFG7
CYREG_B0_P5_U1_DCFG7 EQU 0x40010aee
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_ROUTE_BASE
CYDEV_UCFG_B0_P5_ROUTE_BASE EQU 0x40010b00
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_ROUTE_SIZE
CYDEV_UCFG_B0_P5_ROUTE_SIZE EQU 0x000000ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_BASE
CYDEV_UCFG_B0_P6_BASE EQU 0x40010c00
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_SIZE
CYDEV_UCFG_B0_P6_SIZE EQU 0x000001ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_BASE
CYDEV_UCFG_B0_P6_U0_BASE EQU 0x40010c00
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_SIZE
CYDEV_UCFG_B0_P6_U0_SIZE EQU 0x00000070
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_PLD_IT0
CYREG_B0_P6_U0_PLD_IT0 EQU 0x40010c00
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_PLD_IT1
CYREG_B0_P6_U0_PLD_IT1 EQU 0x40010c04
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_PLD_IT2
CYREG_B0_P6_U0_PLD_IT2 EQU 0x40010c08
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_PLD_IT3
CYREG_B0_P6_U0_PLD_IT3 EQU 0x40010c0c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_PLD_IT4
CYREG_B0_P6_U0_PLD_IT4 EQU 0x40010c10
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_PLD_IT5
CYREG_B0_P6_U0_PLD_IT5 EQU 0x40010c14
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_PLD_IT6
CYREG_B0_P6_U0_PLD_IT6 EQU 0x40010c18
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_PLD_IT7
CYREG_B0_P6_U0_PLD_IT7 EQU 0x40010c1c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_PLD_IT8
CYREG_B0_P6_U0_PLD_IT8 EQU 0x40010c20
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_PLD_IT9
CYREG_B0_P6_U0_PLD_IT9 EQU 0x40010c24
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_PLD_IT10
CYREG_B0_P6_U0_PLD_IT10 EQU 0x40010c28
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_PLD_IT11
CYREG_B0_P6_U0_PLD_IT11 EQU 0x40010c2c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_PLD_ORT0
CYREG_B0_P6_U0_PLD_ORT0 EQU 0x40010c30
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_PLD_ORT1
CYREG_B0_P6_U0_PLD_ORT1 EQU 0x40010c32
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_PLD_ORT2
CYREG_B0_P6_U0_PLD_ORT2 EQU 0x40010c34
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_PLD_ORT3
CYREG_B0_P6_U0_PLD_ORT3 EQU 0x40010c36
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_MC_CFG_CEN_CONST
CYREG_B0_P6_U0_MC_CFG_CEN_CONST EQU 0x40010c38
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_MC_CFG_XORFB
CYREG_B0_P6_U0_MC_CFG_XORFB EQU 0x40010c3a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_MC_CFG_SET_RESET
CYREG_B0_P6_U0_MC_CFG_SET_RESET EQU 0x40010c3c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_MC_CFG_BYPASS
CYREG_B0_P6_U0_MC_CFG_BYPASS EQU 0x40010c3e
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_CFG0
CYREG_B0_P6_U0_CFG0 EQU 0x40010c40
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_CFG1
CYREG_B0_P6_U0_CFG1 EQU 0x40010c41
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_CFG2
CYREG_B0_P6_U0_CFG2 EQU 0x40010c42
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_CFG3
CYREG_B0_P6_U0_CFG3 EQU 0x40010c43
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_CFG4
CYREG_B0_P6_U0_CFG4 EQU 0x40010c44
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_CFG5
CYREG_B0_P6_U0_CFG5 EQU 0x40010c45
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_CFG6
CYREG_B0_P6_U0_CFG6 EQU 0x40010c46
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_CFG7
CYREG_B0_P6_U0_CFG7 EQU 0x40010c47
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_CFG8
CYREG_B0_P6_U0_CFG8 EQU 0x40010c48
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_CFG9
CYREG_B0_P6_U0_CFG9 EQU 0x40010c49
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_CFG10
CYREG_B0_P6_U0_CFG10 EQU 0x40010c4a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_CFG11
CYREG_B0_P6_U0_CFG11 EQU 0x40010c4b
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_CFG12
CYREG_B0_P6_U0_CFG12 EQU 0x40010c4c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_CFG13
CYREG_B0_P6_U0_CFG13 EQU 0x40010c4d
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_CFG14
CYREG_B0_P6_U0_CFG14 EQU 0x40010c4e
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_CFG15
CYREG_B0_P6_U0_CFG15 EQU 0x40010c4f
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_CFG16
CYREG_B0_P6_U0_CFG16 EQU 0x40010c50
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_CFG20
CYREG_B0_P6_U0_CFG20 EQU 0x40010c54
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_CFG21
CYREG_B0_P6_U0_CFG21 EQU 0x40010c55
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_CFG22
CYREG_B0_P6_U0_CFG22 EQU 0x40010c56
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_CFG23
CYREG_B0_P6_U0_CFG23 EQU 0x40010c57
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_CFG24
CYREG_B0_P6_U0_CFG24 EQU 0x40010c58
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_CFG25
CYREG_B0_P6_U0_CFG25 EQU 0x40010c59
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_CFG26
CYREG_B0_P6_U0_CFG26 EQU 0x40010c5a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_CFG27
CYREG_B0_P6_U0_CFG27 EQU 0x40010c5b
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_CFG28
CYREG_B0_P6_U0_CFG28 EQU 0x40010c5c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_CFG29
CYREG_B0_P6_U0_CFG29 EQU 0x40010c5d
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_CFG30
CYREG_B0_P6_U0_CFG30 EQU 0x40010c5e
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_CFG31
CYREG_B0_P6_U0_CFG31 EQU 0x40010c5f
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_DCFG0
CYREG_B0_P6_U0_DCFG0 EQU 0x40010c60
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_DCFG1
CYREG_B0_P6_U0_DCFG1 EQU 0x40010c62
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_DCFG2
CYREG_B0_P6_U0_DCFG2 EQU 0x40010c64
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_DCFG3
CYREG_B0_P6_U0_DCFG3 EQU 0x40010c66
    ENDIF
