MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cydevicerv_trm.inc
    IF :LNOT::DEF:CYREG_B0_P6_U0_DCFG4
CYREG_B0_P6_U0_DCFG4 EQU 0x40010c68
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_DCFG5
CYREG_B0_P6_U0_DCFG5 EQU 0x40010c6a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_DCFG6
CYREG_B0_P6_U0_DCFG6 EQU 0x40010c6c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U0_DCFG7
CYREG_B0_P6_U0_DCFG7 EQU 0x40010c6e
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_BASE
CYDEV_UCFG_B0_P6_U1_BASE EQU 0x40010c80
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_SIZE
CYDEV_UCFG_B0_P6_U1_SIZE EQU 0x00000070
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_PLD_IT0
CYREG_B0_P6_U1_PLD_IT0 EQU 0x40010c80
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_PLD_IT1
CYREG_B0_P6_U1_PLD_IT1 EQU 0x40010c84
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_PLD_IT2
CYREG_B0_P6_U1_PLD_IT2 EQU 0x40010c88
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_PLD_IT3
CYREG_B0_P6_U1_PLD_IT3 EQU 0x40010c8c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_PLD_IT4
CYREG_B0_P6_U1_PLD_IT4 EQU 0x40010c90
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_PLD_IT5
CYREG_B0_P6_U1_PLD_IT5 EQU 0x40010c94
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_PLD_IT6
CYREG_B0_P6_U1_PLD_IT6 EQU 0x40010c98
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_PLD_IT7
CYREG_B0_P6_U1_PLD_IT7 EQU 0x40010c9c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_PLD_IT8
CYREG_B0_P6_U1_PLD_IT8 EQU 0x40010ca0
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_PLD_IT9
CYREG_B0_P6_U1_PLD_IT9 EQU 0x40010ca4
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_PLD_IT10
CYREG_B0_P6_U1_PLD_IT10 EQU 0x40010ca8
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_PLD_IT11
CYREG_B0_P6_U1_PLD_IT11 EQU 0x40010cac
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_PLD_ORT0
CYREG_B0_P6_U1_PLD_ORT0 EQU 0x40010cb0
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_PLD_ORT1
CYREG_B0_P6_U1_PLD_ORT1 EQU 0x40010cb2
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_PLD_ORT2
CYREG_B0_P6_U1_PLD_ORT2 EQU 0x40010cb4
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_PLD_ORT3
CYREG_B0_P6_U1_PLD_ORT3 EQU 0x40010cb6
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_MC_CFG_CEN_CONST
CYREG_B0_P6_U1_MC_CFG_CEN_CONST EQU 0x40010cb8
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_MC_CFG_XORFB
CYREG_B0_P6_U1_MC_CFG_XORFB EQU 0x40010cba
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_MC_CFG_SET_RESET
CYREG_B0_P6_U1_MC_CFG_SET_RESET EQU 0x40010cbc
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_MC_CFG_BYPASS
CYREG_B0_P6_U1_MC_CFG_BYPASS EQU 0x40010cbe
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_CFG0
CYREG_B0_P6_U1_CFG0 EQU 0x40010cc0
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_CFG1
CYREG_B0_P6_U1_CFG1 EQU 0x40010cc1
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_CFG2
CYREG_B0_P6_U1_CFG2 EQU 0x40010cc2
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_CFG3
CYREG_B0_P6_U1_CFG3 EQU 0x40010cc3
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_CFG4
CYREG_B0_P6_U1_CFG4 EQU 0x40010cc4
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_CFG5
CYREG_B0_P6_U1_CFG5 EQU 0x40010cc5
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_CFG6
CYREG_B0_P6_U1_CFG6 EQU 0x40010cc6
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_CFG7
CYREG_B0_P6_U1_CFG7 EQU 0x40010cc7
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_CFG8
CYREG_B0_P6_U1_CFG8 EQU 0x40010cc8
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_CFG9
CYREG_B0_P6_U1_CFG9 EQU 0x40010cc9
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_CFG10
CYREG_B0_P6_U1_CFG10 EQU 0x40010cca
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_CFG11
CYREG_B0_P6_U1_CFG11 EQU 0x40010ccb
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_CFG12
CYREG_B0_P6_U1_CFG12 EQU 0x40010ccc
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_CFG13
CYREG_B0_P6_U1_CFG13 EQU 0x40010ccd
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_CFG14
CYREG_B0_P6_U1_CFG14 EQU 0x40010cce
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_CFG15
CYREG_B0_P6_U1_CFG15 EQU 0x40010ccf
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_CFG16
CYREG_B0_P6_U1_CFG16 EQU 0x40010cd0
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_CFG20
CYREG_B0_P6_U1_CFG20 EQU 0x40010cd4
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_CFG21
CYREG_B0_P6_U1_CFG21 EQU 0x40010cd5
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_CFG22
CYREG_B0_P6_U1_CFG22 EQU 0x40010cd6
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_CFG23
CYREG_B0_P6_U1_CFG23 EQU 0x40010cd7
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_CFG24
CYREG_B0_P6_U1_CFG24 EQU 0x40010cd8
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_CFG25
CYREG_B0_P6_U1_CFG25 EQU 0x40010cd9
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_CFG26
CYREG_B0_P6_U1_CFG26 EQU 0x40010cda
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_CFG27
CYREG_B0_P6_U1_CFG27 EQU 0x40010cdb
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_CFG28
CYREG_B0_P6_U1_CFG28 EQU 0x40010cdc
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_CFG29
CYREG_B0_P6_U1_CFG29 EQU 0x40010cdd
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_CFG30
CYREG_B0_P6_U1_CFG30 EQU 0x40010cde
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_CFG31
CYREG_B0_P6_U1_CFG31 EQU 0x40010cdf
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_DCFG0
CYREG_B0_P6_U1_DCFG0 EQU 0x40010ce0
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_DCFG1
CYREG_B0_P6_U1_DCFG1 EQU 0x40010ce2
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_DCFG2
CYREG_B0_P6_U1_DCFG2 EQU 0x40010ce4
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_DCFG3
CYREG_B0_P6_U1_DCFG3 EQU 0x40010ce6
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_DCFG4
CYREG_B0_P6_U1_DCFG4 EQU 0x40010ce8
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_DCFG5
CYREG_B0_P6_U1_DCFG5 EQU 0x40010cea
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_DCFG6
CYREG_B0_P6_U1_DCFG6 EQU 0x40010cec
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P6_U1_DCFG7
CYREG_B0_P6_U1_DCFG7 EQU 0x40010cee
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_ROUTE_BASE
CYDEV_UCFG_B0_P6_ROUTE_BASE EQU 0x40010d00
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_ROUTE_SIZE
CYDEV_UCFG_B0_P6_ROUTE_SIZE EQU 0x000000ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P7_BASE
CYDEV_UCFG_B0_P7_BASE EQU 0x40010e00
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P7_SIZE
CYDEV_UCFG_B0_P7_SIZE EQU 0x000001ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P7_U0_BASE
CYDEV_UCFG_B0_P7_U0_BASE EQU 0x40010e00
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P7_U0_SIZE
CYDEV_UCFG_B0_P7_U0_SIZE EQU 0x00000070
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_PLD_IT0
CYREG_B0_P7_U0_PLD_IT0 EQU 0x40010e00
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_PLD_IT1
CYREG_B0_P7_U0_PLD_IT1 EQU 0x40010e04
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_PLD_IT2
CYREG_B0_P7_U0_PLD_IT2 EQU 0x40010e08
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_PLD_IT3
CYREG_B0_P7_U0_PLD_IT3 EQU 0x40010e0c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_PLD_IT4
CYREG_B0_P7_U0_PLD_IT4 EQU 0x40010e10
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_PLD_IT5
CYREG_B0_P7_U0_PLD_IT5 EQU 0x40010e14
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_PLD_IT6
CYREG_B0_P7_U0_PLD_IT6 EQU 0x40010e18
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_PLD_IT7
CYREG_B0_P7_U0_PLD_IT7 EQU 0x40010e1c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_PLD_IT8
CYREG_B0_P7_U0_PLD_IT8 EQU 0x40010e20
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_PLD_IT9
CYREG_B0_P7_U0_PLD_IT9 EQU 0x40010e24
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_PLD_IT10
CYREG_B0_P7_U0_PLD_IT10 EQU 0x40010e28
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_PLD_IT11
CYREG_B0_P7_U0_PLD_IT11 EQU 0x40010e2c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_PLD_ORT0
CYREG_B0_P7_U0_PLD_ORT0 EQU 0x40010e30
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_PLD_ORT1
CYREG_B0_P7_U0_PLD_ORT1 EQU 0x40010e32
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_PLD_ORT2
CYREG_B0_P7_U0_PLD_ORT2 EQU 0x40010e34
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_PLD_ORT3
CYREG_B0_P7_U0_PLD_ORT3 EQU 0x40010e36
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_MC_CFG_CEN_CONST
CYREG_B0_P7_U0_MC_CFG_CEN_CONST EQU 0x40010e38
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_MC_CFG_XORFB
CYREG_B0_P7_U0_MC_CFG_XORFB EQU 0x40010e3a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_MC_CFG_SET_RESET
CYREG_B0_P7_U0_MC_CFG_SET_RESET EQU 0x40010e3c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_MC_CFG_BYPASS
CYREG_B0_P7_U0_MC_CFG_BYPASS EQU 0x40010e3e
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_CFG0
CYREG_B0_P7_U0_CFG0 EQU 0x40010e40
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_CFG1
CYREG_B0_P7_U0_CFG1 EQU 0x40010e41
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_CFG2
CYREG_B0_P7_U0_CFG2 EQU 0x40010e42
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_CFG3
CYREG_B0_P7_U0_CFG3 EQU 0x40010e43
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_CFG4
CYREG_B0_P7_U0_CFG4 EQU 0x40010e44
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_CFG5
CYREG_B0_P7_U0_CFG5 EQU 0x40010e45
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_CFG6
CYREG_B0_P7_U0_CFG6 EQU 0x40010e46
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_CFG7
CYREG_B0_P7_U0_CFG7 EQU 0x40010e47
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_CFG8
CYREG_B0_P7_U0_CFG8 EQU 0x40010e48
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_CFG9
CYREG_B0_P7_U0_CFG9 EQU 0x40010e49
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_CFG10
CYREG_B0_P7_U0_CFG10 EQU 0x40010e4a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_CFG11
CYREG_B0_P7_U0_CFG11 EQU 0x40010e4b
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_CFG12
CYREG_B0_P7_U0_CFG12 EQU 0x40010e4c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_CFG13
CYREG_B0_P7_U0_CFG13 EQU 0x40010e4d
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_CFG14
CYREG_B0_P7_U0_CFG14 EQU 0x40010e4e
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_CFG15
CYREG_B0_P7_U0_CFG15 EQU 0x40010e4f
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_CFG16
CYREG_B0_P7_U0_CFG16 EQU 0x40010e50
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_CFG20
CYREG_B0_P7_U0_CFG20 EQU 0x40010e54
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_CFG21
CYREG_B0_P7_U0_CFG21 EQU 0x40010e55
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_CFG22
CYREG_B0_P7_U0_CFG22 EQU 0x40010e56
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_CFG23
CYREG_B0_P7_U0_CFG23 EQU 0x40010e57
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_CFG24
CYREG_B0_P7_U0_CFG24 EQU 0x40010e58
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_CFG25
CYREG_B0_P7_U0_CFG25 EQU 0x40010e59
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_CFG26
CYREG_B0_P7_U0_CFG26 EQU 0x40010e5a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_CFG27
CYREG_B0_P7_U0_CFG27 EQU 0x40010e5b
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_CFG28
CYREG_B0_P7_U0_CFG28 EQU 0x40010e5c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_CFG29
CYREG_B0_P7_U0_CFG29 EQU 0x40010e5d
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_CFG30
CYREG_B0_P7_U0_CFG30 EQU 0x40010e5e
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_CFG31
CYREG_B0_P7_U0_CFG31 EQU 0x40010e5f
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_DCFG0
CYREG_B0_P7_U0_DCFG0 EQU 0x40010e60
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_DCFG1
CYREG_B0_P7_U0_DCFG1 EQU 0x40010e62
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_DCFG2
CYREG_B0_P7_U0_DCFG2 EQU 0x40010e64
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_DCFG3
CYREG_B0_P7_U0_DCFG3 EQU 0x40010e66
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_DCFG4
CYREG_B0_P7_U0_DCFG4 EQU 0x40010e68
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_DCFG5
CYREG_B0_P7_U0_DCFG5 EQU 0x40010e6a
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_DCFG6
CYREG_B0_P7_U0_DCFG6 EQU 0x40010e6c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U0_DCFG7
CYREG_B0_P7_U0_DCFG7 EQU 0x40010e6e
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P7_U1_BASE
CYDEV_UCFG_B0_P7_U1_BASE EQU 0x40010e80
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P7_U1_SIZE
CYDEV_UCFG_B0_P7_U1_SIZE EQU 0x00000070
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_PLD_IT0
CYREG_B0_P7_U1_PLD_IT0 EQU 0x40010e80
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_PLD_IT1
CYREG_B0_P7_U1_PLD_IT1 EQU 0x40010e84
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_PLD_IT2
CYREG_B0_P7_U1_PLD_IT2 EQU 0x40010e88
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_PLD_IT3
CYREG_B0_P7_U1_PLD_IT3 EQU 0x40010e8c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_PLD_IT4
CYREG_B0_P7_U1_PLD_IT4 EQU 0x40010e90
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_PLD_IT5
CYREG_B0_P7_U1_PLD_IT5 EQU 0x40010e94
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_PLD_IT6
CYREG_B0_P7_U1_PLD_IT6 EQU 0x40010e98
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_PLD_IT7
CYREG_B0_P7_U1_PLD_IT7 EQU 0x40010e9c
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_PLD_IT8
CYREG_B0_P7_U1_PLD_IT8 EQU 0x40010ea0
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_PLD_IT9
CYREG_B0_P7_U1_PLD_IT9 EQU 0x40010ea4
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_PLD_IT10
CYREG_B0_P7_U1_PLD_IT10 EQU 0x40010ea8
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_PLD_IT11
CYREG_B0_P7_U1_PLD_IT11 EQU 0x40010eac
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_PLD_ORT0
CYREG_B0_P7_U1_PLD_ORT0 EQU 0x40010eb0
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_PLD_ORT1
CYREG_B0_P7_U1_PLD_ORT1 EQU 0x40010eb2
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_PLD_ORT2
CYREG_B0_P7_U1_PLD_ORT2 EQU 0x40010eb4
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_PLD_ORT3
CYREG_B0_P7_U1_PLD_ORT3 EQU 0x40010eb6
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_MC_CFG_CEN_CONST
CYREG_B0_P7_U1_MC_CFG_CEN_CONST EQU 0x40010eb8
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_MC_CFG_XORFB
CYREG_B0_P7_U1_MC_CFG_XORFB EQU 0x40010eba
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_MC_CFG_SET_RESET
CYREG_B0_P7_U1_MC_CFG_SET_RESET EQU 0x40010ebc
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_MC_CFG_BYPASS
CYREG_B0_P7_U1_MC_CFG_BYPASS EQU 0x40010ebe
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_CFG0
CYREG_B0_P7_U1_CFG0 EQU 0x40010ec0
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_CFG1
CYREG_B0_P7_U1_CFG1 EQU 0x40010ec1
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_CFG2
CYREG_B0_P7_U1_CFG2 EQU 0x40010ec2
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_CFG3
CYREG_B0_P7_U1_CFG3 EQU 0x40010ec3
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_CFG4
CYREG_B0_P7_U1_CFG4 EQU 0x40010ec4
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_CFG5
CYREG_B0_P7_U1_CFG5 EQU 0x40010ec5
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_CFG6
CYREG_B0_P7_U1_CFG6 EQU 0x40010ec6
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_CFG7
CYREG_B0_P7_U1_CFG7 EQU 0x40010ec7
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_CFG8
CYREG_B0_P7_U1_CFG8 EQU 0x40010ec8
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_CFG9
CYREG_B0_P7_U1_CFG9 EQU 0x40010ec9
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_CFG10
CYREG_B0_P7_U1_CFG10 EQU 0x40010eca
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_CFG11
CYREG_B0_P7_U1_CFG11 EQU 0x40010ecb
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_CFG12
CYREG_B0_P7_U1_CFG12 EQU 0x40010ecc
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_CFG13
CYREG_B0_P7_U1_CFG13 EQU 0x40010ecd
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_CFG14
CYREG_B0_P7_U1_CFG14 EQU 0x40010ece
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_CFG15
CYREG_B0_P7_U1_CFG15 EQU 0x40010ecf
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_CFG16
CYREG_B0_P7_U1_CFG16 EQU 0x40010ed0
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_CFG20
CYREG_B0_P7_U1_CFG20 EQU 0x40010ed4
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_CFG21
CYREG_B0_P7_U1_CFG21 EQU 0x40010ed5
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_CFG22
CYREG_B0_P7_U1_CFG22 EQU 0x40010ed6
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_CFG23
CYREG_B0_P7_U1_CFG23 EQU 0x40010ed7
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_CFG24
CYREG_B0_P7_U1_CFG24 EQU 0x40010ed8
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_CFG25
CYREG_B0_P7_U1_CFG25 EQU 0x40010ed9
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_CFG26
CYREG_B0_P7_U1_CFG26 EQU 0x40010eda
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_CFG27
CYREG_B0_P7_U1_CFG27 EQU 0x40010edb
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_CFG28
CYREG_B0_P7_U1_CFG28 EQU 0x40010edc
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_CFG29
CYREG_B0_P7_U1_CFG29 EQU 0x40010edd
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_CFG30
CYREG_B0_P7_U1_CFG30 EQU 0x40010ede
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_CFG31
CYREG_B0_P7_U1_CFG31 EQU 0x40010edf
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_DCFG0
CYREG_B0_P7_U1_DCFG0 EQU 0x40010ee0
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_DCFG1
CYREG_B0_P7_U1_DCFG1 EQU 0x40010ee2
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_DCFG2
CYREG_B0_P7_U1_DCFG2 EQU 0x40010ee4
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_DCFG3
CYREG_B0_P7_U1_DCFG3 EQU 0x40010ee6
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_DCFG4
CYREG_B0_P7_U1_DCFG4 EQU 0x40010ee8
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_DCFG5
CYREG_B0_P7_U1_DCFG5 EQU 0x40010eea
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_DCFG6
CYREG_B0_P7_U1_DCFG6 EQU 0x40010eec
    ENDIF
    IF :LNOT::DEF:CYREG_B0_P7_U1_DCFG7
CYREG_B0_P7_U1_DCFG7 EQU 0x40010eee
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P7_ROUTE_BASE
CYDEV_UCFG_B0_P7_ROUTE_BASE EQU 0x40010f00
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P7_ROUTE_SIZE
CYDEV_UCFG_B0_P7_ROUTE_SIZE EQU 0x000000ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_BASE
CYDEV_UCFG_B1_BASE EQU 0x40011000
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_SIZE
CYDEV_UCFG_B1_SIZE EQU 0x00000fef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P2_BASE
CYDEV_UCFG_B1_P2_BASE EQU 0x40011400
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P2_SIZE
CYDEV_UCFG_B1_P2_SIZE EQU 0x000001ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P2_U0_BASE
CYDEV_UCFG_B1_P2_U0_BASE EQU 0x40011400
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P2_U0_SIZE
CYDEV_UCFG_B1_P2_U0_SIZE EQU 0x00000070
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_PLD_IT0
CYREG_B1_P2_U0_PLD_IT0 EQU 0x40011400
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_PLD_IT1
CYREG_B1_P2_U0_PLD_IT1 EQU 0x40011404
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_PLD_IT2
CYREG_B1_P2_U0_PLD_IT2 EQU 0x40011408
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_PLD_IT3
CYREG_B1_P2_U0_PLD_IT3 EQU 0x4001140c
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_PLD_IT4
CYREG_B1_P2_U0_PLD_IT4 EQU 0x40011410
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_PLD_IT5
CYREG_B1_P2_U0_PLD_IT5 EQU 0x40011414
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_PLD_IT6
CYREG_B1_P2_U0_PLD_IT6 EQU 0x40011418
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_PLD_IT7
CYREG_B1_P2_U0_PLD_IT7 EQU 0x4001141c
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_PLD_IT8
CYREG_B1_P2_U0_PLD_IT8 EQU 0x40011420
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_PLD_IT9
CYREG_B1_P2_U0_PLD_IT9 EQU 0x40011424
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_PLD_IT10
CYREG_B1_P2_U0_PLD_IT10 EQU 0x40011428
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_PLD_IT11
CYREG_B1_P2_U0_PLD_IT11 EQU 0x4001142c
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_PLD_ORT0
CYREG_B1_P2_U0_PLD_ORT0 EQU 0x40011430
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_PLD_ORT1
CYREG_B1_P2_U0_PLD_ORT1 EQU 0x40011432
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_PLD_ORT2
CYREG_B1_P2_U0_PLD_ORT2 EQU 0x40011434
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_PLD_ORT3
CYREG_B1_P2_U0_PLD_ORT3 EQU 0x40011436
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_MC_CFG_CEN_CONST
CYREG_B1_P2_U0_MC_CFG_CEN_CONST EQU 0x40011438
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_MC_CFG_XORFB
CYREG_B1_P2_U0_MC_CFG_XORFB EQU 0x4001143a
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_MC_CFG_SET_RESET
CYREG_B1_P2_U0_MC_CFG_SET_RESET EQU 0x4001143c
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_MC_CFG_BYPASS
CYREG_B1_P2_U0_MC_CFG_BYPASS EQU 0x4001143e
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_CFG0
CYREG_B1_P2_U0_CFG0 EQU 0x40011440
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_CFG1
CYREG_B1_P2_U0_CFG1 EQU 0x40011441
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_CFG2
CYREG_B1_P2_U0_CFG2 EQU 0x40011442
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_CFG3
CYREG_B1_P2_U0_CFG3 EQU 0x40011443
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_CFG4
CYREG_B1_P2_U0_CFG4 EQU 0x40011444
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_CFG5
CYREG_B1_P2_U0_CFG5 EQU 0x40011445
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_CFG6
CYREG_B1_P2_U0_CFG6 EQU 0x40011446
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_CFG7
CYREG_B1_P2_U0_CFG7 EQU 0x40011447
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_CFG8
CYREG_B1_P2_U0_CFG8 EQU 0x40011448
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_CFG9
CYREG_B1_P2_U0_CFG9 EQU 0x40011449
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_CFG10
CYREG_B1_P2_U0_CFG10 EQU 0x4001144a
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_CFG11
CYREG_B1_P2_U0_CFG11 EQU 0x4001144b
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_CFG12
CYREG_B1_P2_U0_CFG12 EQU 0x4001144c
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_CFG13
CYREG_B1_P2_U0_CFG13 EQU 0x4001144d
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_CFG14
CYREG_B1_P2_U0_CFG14 EQU 0x4001144e
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_CFG15
CYREG_B1_P2_U0_CFG15 EQU 0x4001144f
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_CFG16
CYREG_B1_P2_U0_CFG16 EQU 0x40011450
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_CFG20
CYREG_B1_P2_U0_CFG20 EQU 0x40011454
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_CFG21
CYREG_B1_P2_U0_CFG21 EQU 0x40011455
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_CFG22
CYREG_B1_P2_U0_CFG22 EQU 0x40011456
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_CFG23
CYREG_B1_P2_U0_CFG23 EQU 0x40011457
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_CFG24
CYREG_B1_P2_U0_CFG24 EQU 0x40011458
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_CFG25
CYREG_B1_P2_U0_CFG25 EQU 0x40011459
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_CFG26
CYREG_B1_P2_U0_CFG26 EQU 0x4001145a
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_CFG27
CYREG_B1_P2_U0_CFG27 EQU 0x4001145b
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_CFG28
CYREG_B1_P2_U0_CFG28 EQU 0x4001145c
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_CFG29
CYREG_B1_P2_U0_CFG29 EQU 0x4001145d
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_CFG30
CYREG_B1_P2_U0_CFG30 EQU 0x4001145e
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_CFG31
CYREG_B1_P2_U0_CFG31 EQU 0x4001145f
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_DCFG0
CYREG_B1_P2_U0_DCFG0 EQU 0x40011460
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_DCFG1
CYREG_B1_P2_U0_DCFG1 EQU 0x40011462
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_DCFG2
CYREG_B1_P2_U0_DCFG2 EQU 0x40011464
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_DCFG3
CYREG_B1_P2_U0_DCFG3 EQU 0x40011466
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_DCFG4
CYREG_B1_P2_U0_DCFG4 EQU 0x40011468
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_DCFG5
CYREG_B1_P2_U0_DCFG5 EQU 0x4001146a
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_DCFG6
CYREG_B1_P2_U0_DCFG6 EQU 0x4001146c
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U0_DCFG7
CYREG_B1_P2_U0_DCFG7 EQU 0x4001146e
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P2_U1_BASE
CYDEV_UCFG_B1_P2_U1_BASE EQU 0x40011480
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P2_U1_SIZE
CYDEV_UCFG_B1_P2_U1_SIZE EQU 0x00000070
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_PLD_IT0
CYREG_B1_P2_U1_PLD_IT0 EQU 0x40011480
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_PLD_IT1
CYREG_B1_P2_U1_PLD_IT1 EQU 0x40011484
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_PLD_IT2
CYREG_B1_P2_U1_PLD_IT2 EQU 0x40011488
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_PLD_IT3
CYREG_B1_P2_U1_PLD_IT3 EQU 0x4001148c
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_PLD_IT4
CYREG_B1_P2_U1_PLD_IT4 EQU 0x40011490
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_PLD_IT5
CYREG_B1_P2_U1_PLD_IT5 EQU 0x40011494
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_PLD_IT6
CYREG_B1_P2_U1_PLD_IT6 EQU 0x40011498
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_PLD_IT7
CYREG_B1_P2_U1_PLD_IT7 EQU 0x4001149c
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_PLD_IT8
CYREG_B1_P2_U1_PLD_IT8 EQU 0x400114a0
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_PLD_IT9
CYREG_B1_P2_U1_PLD_IT9 EQU 0x400114a4
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_PLD_IT10
CYREG_B1_P2_U1_PLD_IT10 EQU 0x400114a8
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_PLD_IT11
CYREG_B1_P2_U1_PLD_IT11 EQU 0x400114ac
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_PLD_ORT0
