MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cydevicerv_trm.inc
CYREG_B1_P2_U1_PLD_ORT0 EQU 0x400114b0
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_PLD_ORT1
CYREG_B1_P2_U1_PLD_ORT1 EQU 0x400114b2
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_PLD_ORT2
CYREG_B1_P2_U1_PLD_ORT2 EQU 0x400114b4
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_PLD_ORT3
CYREG_B1_P2_U1_PLD_ORT3 EQU 0x400114b6
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_MC_CFG_CEN_CONST
CYREG_B1_P2_U1_MC_CFG_CEN_CONST EQU 0x400114b8
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_MC_CFG_XORFB
CYREG_B1_P2_U1_MC_CFG_XORFB EQU 0x400114ba
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_MC_CFG_SET_RESET
CYREG_B1_P2_U1_MC_CFG_SET_RESET EQU 0x400114bc
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_MC_CFG_BYPASS
CYREG_B1_P2_U1_MC_CFG_BYPASS EQU 0x400114be
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_CFG0
CYREG_B1_P2_U1_CFG0 EQU 0x400114c0
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_CFG1
CYREG_B1_P2_U1_CFG1 EQU 0x400114c1
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_CFG2
CYREG_B1_P2_U1_CFG2 EQU 0x400114c2
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_CFG3
CYREG_B1_P2_U1_CFG3 EQU 0x400114c3
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_CFG4
CYREG_B1_P2_U1_CFG4 EQU 0x400114c4
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_CFG5
CYREG_B1_P2_U1_CFG5 EQU 0x400114c5
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_CFG6
CYREG_B1_P2_U1_CFG6 EQU 0x400114c6
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_CFG7
CYREG_B1_P2_U1_CFG7 EQU 0x400114c7
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_CFG8
CYREG_B1_P2_U1_CFG8 EQU 0x400114c8
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_CFG9
CYREG_B1_P2_U1_CFG9 EQU 0x400114c9
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_CFG10
CYREG_B1_P2_U1_CFG10 EQU 0x400114ca
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_CFG11
CYREG_B1_P2_U1_CFG11 EQU 0x400114cb
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_CFG12
CYREG_B1_P2_U1_CFG12 EQU 0x400114cc
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_CFG13
CYREG_B1_P2_U1_CFG13 EQU 0x400114cd
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_CFG14
CYREG_B1_P2_U1_CFG14 EQU 0x400114ce
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_CFG15
CYREG_B1_P2_U1_CFG15 EQU 0x400114cf
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_CFG16
CYREG_B1_P2_U1_CFG16 EQU 0x400114d0
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_CFG20
CYREG_B1_P2_U1_CFG20 EQU 0x400114d4
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_CFG21
CYREG_B1_P2_U1_CFG21 EQU 0x400114d5
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_CFG22
CYREG_B1_P2_U1_CFG22 EQU 0x400114d6
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_CFG23
CYREG_B1_P2_U1_CFG23 EQU 0x400114d7
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_CFG24
CYREG_B1_P2_U1_CFG24 EQU 0x400114d8
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_CFG25
CYREG_B1_P2_U1_CFG25 EQU 0x400114d9
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_CFG26
CYREG_B1_P2_U1_CFG26 EQU 0x400114da
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_CFG27
CYREG_B1_P2_U1_CFG27 EQU 0x400114db
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_CFG28
CYREG_B1_P2_U1_CFG28 EQU 0x400114dc
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_CFG29
CYREG_B1_P2_U1_CFG29 EQU 0x400114dd
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_CFG30
CYREG_B1_P2_U1_CFG30 EQU 0x400114de
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_CFG31
CYREG_B1_P2_U1_CFG31 EQU 0x400114df
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_DCFG0
CYREG_B1_P2_U1_DCFG0 EQU 0x400114e0
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_DCFG1
CYREG_B1_P2_U1_DCFG1 EQU 0x400114e2
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_DCFG2
CYREG_B1_P2_U1_DCFG2 EQU 0x400114e4
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_DCFG3
CYREG_B1_P2_U1_DCFG3 EQU 0x400114e6
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_DCFG4
CYREG_B1_P2_U1_DCFG4 EQU 0x400114e8
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_DCFG5
CYREG_B1_P2_U1_DCFG5 EQU 0x400114ea
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_DCFG6
CYREG_B1_P2_U1_DCFG6 EQU 0x400114ec
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P2_U1_DCFG7
CYREG_B1_P2_U1_DCFG7 EQU 0x400114ee
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P2_ROUTE_BASE
CYDEV_UCFG_B1_P2_ROUTE_BASE EQU 0x40011500
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P2_ROUTE_SIZE
CYDEV_UCFG_B1_P2_ROUTE_SIZE EQU 0x000000ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P3_BASE
CYDEV_UCFG_B1_P3_BASE EQU 0x40011600
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P3_SIZE
CYDEV_UCFG_B1_P3_SIZE EQU 0x000001ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P3_U0_BASE
CYDEV_UCFG_B1_P3_U0_BASE EQU 0x40011600
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P3_U0_SIZE
CYDEV_UCFG_B1_P3_U0_SIZE EQU 0x00000070
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_PLD_IT0
CYREG_B1_P3_U0_PLD_IT0 EQU 0x40011600
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_PLD_IT1
CYREG_B1_P3_U0_PLD_IT1 EQU 0x40011604
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_PLD_IT2
CYREG_B1_P3_U0_PLD_IT2 EQU 0x40011608
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_PLD_IT3
CYREG_B1_P3_U0_PLD_IT3 EQU 0x4001160c
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_PLD_IT4
CYREG_B1_P3_U0_PLD_IT4 EQU 0x40011610
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_PLD_IT5
CYREG_B1_P3_U0_PLD_IT5 EQU 0x40011614
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_PLD_IT6
CYREG_B1_P3_U0_PLD_IT6 EQU 0x40011618
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_PLD_IT7
CYREG_B1_P3_U0_PLD_IT7 EQU 0x4001161c
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_PLD_IT8
CYREG_B1_P3_U0_PLD_IT8 EQU 0x40011620
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_PLD_IT9
CYREG_B1_P3_U0_PLD_IT9 EQU 0x40011624
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_PLD_IT10
CYREG_B1_P3_U0_PLD_IT10 EQU 0x40011628
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_PLD_IT11
CYREG_B1_P3_U0_PLD_IT11 EQU 0x4001162c
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_PLD_ORT0
CYREG_B1_P3_U0_PLD_ORT0 EQU 0x40011630
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_PLD_ORT1
CYREG_B1_P3_U0_PLD_ORT1 EQU 0x40011632
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_PLD_ORT2
CYREG_B1_P3_U0_PLD_ORT2 EQU 0x40011634
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_PLD_ORT3
CYREG_B1_P3_U0_PLD_ORT3 EQU 0x40011636
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_MC_CFG_CEN_CONST
CYREG_B1_P3_U0_MC_CFG_CEN_CONST EQU 0x40011638
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_MC_CFG_XORFB
CYREG_B1_P3_U0_MC_CFG_XORFB EQU 0x4001163a
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_MC_CFG_SET_RESET
CYREG_B1_P3_U0_MC_CFG_SET_RESET EQU 0x4001163c
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_MC_CFG_BYPASS
CYREG_B1_P3_U0_MC_CFG_BYPASS EQU 0x4001163e
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_CFG0
CYREG_B1_P3_U0_CFG0 EQU 0x40011640
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_CFG1
CYREG_B1_P3_U0_CFG1 EQU 0x40011641
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_CFG2
CYREG_B1_P3_U0_CFG2 EQU 0x40011642
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_CFG3
CYREG_B1_P3_U0_CFG3 EQU 0x40011643
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_CFG4
CYREG_B1_P3_U0_CFG4 EQU 0x40011644
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_CFG5
CYREG_B1_P3_U0_CFG5 EQU 0x40011645
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_CFG6
CYREG_B1_P3_U0_CFG6 EQU 0x40011646
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_CFG7
CYREG_B1_P3_U0_CFG7 EQU 0x40011647
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_CFG8
CYREG_B1_P3_U0_CFG8 EQU 0x40011648
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_CFG9
CYREG_B1_P3_U0_CFG9 EQU 0x40011649
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_CFG10
CYREG_B1_P3_U0_CFG10 EQU 0x4001164a
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_CFG11
CYREG_B1_P3_U0_CFG11 EQU 0x4001164b
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_CFG12
CYREG_B1_P3_U0_CFG12 EQU 0x4001164c
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_CFG13
CYREG_B1_P3_U0_CFG13 EQU 0x4001164d
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_CFG14
CYREG_B1_P3_U0_CFG14 EQU 0x4001164e
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_CFG15
CYREG_B1_P3_U0_CFG15 EQU 0x4001164f
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_CFG16
CYREG_B1_P3_U0_CFG16 EQU 0x40011650
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_CFG20
CYREG_B1_P3_U0_CFG20 EQU 0x40011654
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_CFG21
CYREG_B1_P3_U0_CFG21 EQU 0x40011655
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_CFG22
CYREG_B1_P3_U0_CFG22 EQU 0x40011656
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_CFG23
CYREG_B1_P3_U0_CFG23 EQU 0x40011657
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_CFG24
CYREG_B1_P3_U0_CFG24 EQU 0x40011658
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_CFG25
CYREG_B1_P3_U0_CFG25 EQU 0x40011659
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_CFG26
CYREG_B1_P3_U0_CFG26 EQU 0x4001165a
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_CFG27
CYREG_B1_P3_U0_CFG27 EQU 0x4001165b
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_CFG28
CYREG_B1_P3_U0_CFG28 EQU 0x4001165c
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_CFG29
CYREG_B1_P3_U0_CFG29 EQU 0x4001165d
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_CFG30
CYREG_B1_P3_U0_CFG30 EQU 0x4001165e
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_CFG31
CYREG_B1_P3_U0_CFG31 EQU 0x4001165f
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_DCFG0
CYREG_B1_P3_U0_DCFG0 EQU 0x40011660
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_DCFG1
CYREG_B1_P3_U0_DCFG1 EQU 0x40011662
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_DCFG2
CYREG_B1_P3_U0_DCFG2 EQU 0x40011664
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_DCFG3
CYREG_B1_P3_U0_DCFG3 EQU 0x40011666
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_DCFG4
CYREG_B1_P3_U0_DCFG4 EQU 0x40011668
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_DCFG5
CYREG_B1_P3_U0_DCFG5 EQU 0x4001166a
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_DCFG6
CYREG_B1_P3_U0_DCFG6 EQU 0x4001166c
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U0_DCFG7
CYREG_B1_P3_U0_DCFG7 EQU 0x4001166e
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P3_U1_BASE
CYDEV_UCFG_B1_P3_U1_BASE EQU 0x40011680
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P3_U1_SIZE
CYDEV_UCFG_B1_P3_U1_SIZE EQU 0x00000070
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_PLD_IT0
CYREG_B1_P3_U1_PLD_IT0 EQU 0x40011680
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_PLD_IT1
CYREG_B1_P3_U1_PLD_IT1 EQU 0x40011684
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_PLD_IT2
CYREG_B1_P3_U1_PLD_IT2 EQU 0x40011688
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_PLD_IT3
CYREG_B1_P3_U1_PLD_IT3 EQU 0x4001168c
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_PLD_IT4
CYREG_B1_P3_U1_PLD_IT4 EQU 0x40011690
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_PLD_IT5
CYREG_B1_P3_U1_PLD_IT5 EQU 0x40011694
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_PLD_IT6
CYREG_B1_P3_U1_PLD_IT6 EQU 0x40011698
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_PLD_IT7
CYREG_B1_P3_U1_PLD_IT7 EQU 0x4001169c
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_PLD_IT8
CYREG_B1_P3_U1_PLD_IT8 EQU 0x400116a0
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_PLD_IT9
CYREG_B1_P3_U1_PLD_IT9 EQU 0x400116a4
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_PLD_IT10
CYREG_B1_P3_U1_PLD_IT10 EQU 0x400116a8
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_PLD_IT11
CYREG_B1_P3_U1_PLD_IT11 EQU 0x400116ac
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_PLD_ORT0
CYREG_B1_P3_U1_PLD_ORT0 EQU 0x400116b0
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_PLD_ORT1
CYREG_B1_P3_U1_PLD_ORT1 EQU 0x400116b2
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_PLD_ORT2
CYREG_B1_P3_U1_PLD_ORT2 EQU 0x400116b4
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_PLD_ORT3
CYREG_B1_P3_U1_PLD_ORT3 EQU 0x400116b6
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_MC_CFG_CEN_CONST
CYREG_B1_P3_U1_MC_CFG_CEN_CONST EQU 0x400116b8
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_MC_CFG_XORFB
CYREG_B1_P3_U1_MC_CFG_XORFB EQU 0x400116ba
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_MC_CFG_SET_RESET
CYREG_B1_P3_U1_MC_CFG_SET_RESET EQU 0x400116bc
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_MC_CFG_BYPASS
CYREG_B1_P3_U1_MC_CFG_BYPASS EQU 0x400116be
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_CFG0
CYREG_B1_P3_U1_CFG0 EQU 0x400116c0
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_CFG1
CYREG_B1_P3_U1_CFG1 EQU 0x400116c1
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_CFG2
CYREG_B1_P3_U1_CFG2 EQU 0x400116c2
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_CFG3
CYREG_B1_P3_U1_CFG3 EQU 0x400116c3
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_CFG4
CYREG_B1_P3_U1_CFG4 EQU 0x400116c4
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_CFG5
CYREG_B1_P3_U1_CFG5 EQU 0x400116c5
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_CFG6
CYREG_B1_P3_U1_CFG6 EQU 0x400116c6
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_CFG7
CYREG_B1_P3_U1_CFG7 EQU 0x400116c7
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_CFG8
CYREG_B1_P3_U1_CFG8 EQU 0x400116c8
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_CFG9
CYREG_B1_P3_U1_CFG9 EQU 0x400116c9
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_CFG10
CYREG_B1_P3_U1_CFG10 EQU 0x400116ca
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_CFG11
CYREG_B1_P3_U1_CFG11 EQU 0x400116cb
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_CFG12
CYREG_B1_P3_U1_CFG12 EQU 0x400116cc
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_CFG13
CYREG_B1_P3_U1_CFG13 EQU 0x400116cd
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_CFG14
CYREG_B1_P3_U1_CFG14 EQU 0x400116ce
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_CFG15
CYREG_B1_P3_U1_CFG15 EQU 0x400116cf
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_CFG16
CYREG_B1_P3_U1_CFG16 EQU 0x400116d0
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_CFG20
CYREG_B1_P3_U1_CFG20 EQU 0x400116d4
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_CFG21
CYREG_B1_P3_U1_CFG21 EQU 0x400116d5
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_CFG22
CYREG_B1_P3_U1_CFG22 EQU 0x400116d6
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_CFG23
CYREG_B1_P3_U1_CFG23 EQU 0x400116d7
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_CFG24
CYREG_B1_P3_U1_CFG24 EQU 0x400116d8
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_CFG25
CYREG_B1_P3_U1_CFG25 EQU 0x400116d9
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_CFG26
CYREG_B1_P3_U1_CFG26 EQU 0x400116da
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_CFG27
CYREG_B1_P3_U1_CFG27 EQU 0x400116db
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_CFG28
CYREG_B1_P3_U1_CFG28 EQU 0x400116dc
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_CFG29
CYREG_B1_P3_U1_CFG29 EQU 0x400116dd
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_CFG30
CYREG_B1_P3_U1_CFG30 EQU 0x400116de
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_CFG31
CYREG_B1_P3_U1_CFG31 EQU 0x400116df
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_DCFG0
CYREG_B1_P3_U1_DCFG0 EQU 0x400116e0
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_DCFG1
CYREG_B1_P3_U1_DCFG1 EQU 0x400116e2
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_DCFG2
CYREG_B1_P3_U1_DCFG2 EQU 0x400116e4
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_DCFG3
CYREG_B1_P3_U1_DCFG3 EQU 0x400116e6
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_DCFG4
CYREG_B1_P3_U1_DCFG4 EQU 0x400116e8
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_DCFG5
CYREG_B1_P3_U1_DCFG5 EQU 0x400116ea
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_DCFG6
CYREG_B1_P3_U1_DCFG6 EQU 0x400116ec
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P3_U1_DCFG7
CYREG_B1_P3_U1_DCFG7 EQU 0x400116ee
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P3_ROUTE_BASE
CYDEV_UCFG_B1_P3_ROUTE_BASE EQU 0x40011700
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P3_ROUTE_SIZE
CYDEV_UCFG_B1_P3_ROUTE_SIZE EQU 0x000000ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P4_BASE
CYDEV_UCFG_B1_P4_BASE EQU 0x40011800
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P4_SIZE
CYDEV_UCFG_B1_P4_SIZE EQU 0x000001ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P4_U0_BASE
CYDEV_UCFG_B1_P4_U0_BASE EQU 0x40011800
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P4_U0_SIZE
CYDEV_UCFG_B1_P4_U0_SIZE EQU 0x00000070
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_PLD_IT0
CYREG_B1_P4_U0_PLD_IT0 EQU 0x40011800
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_PLD_IT1
CYREG_B1_P4_U0_PLD_IT1 EQU 0x40011804
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_PLD_IT2
CYREG_B1_P4_U0_PLD_IT2 EQU 0x40011808
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_PLD_IT3
CYREG_B1_P4_U0_PLD_IT3 EQU 0x4001180c
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_PLD_IT4
CYREG_B1_P4_U0_PLD_IT4 EQU 0x40011810
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_PLD_IT5
CYREG_B1_P4_U0_PLD_IT5 EQU 0x40011814
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_PLD_IT6
CYREG_B1_P4_U0_PLD_IT6 EQU 0x40011818
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_PLD_IT7
CYREG_B1_P4_U0_PLD_IT7 EQU 0x4001181c
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_PLD_IT8
CYREG_B1_P4_U0_PLD_IT8 EQU 0x40011820
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_PLD_IT9
CYREG_B1_P4_U0_PLD_IT9 EQU 0x40011824
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_PLD_IT10
CYREG_B1_P4_U0_PLD_IT10 EQU 0x40011828
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_PLD_IT11
CYREG_B1_P4_U0_PLD_IT11 EQU 0x4001182c
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_PLD_ORT0
CYREG_B1_P4_U0_PLD_ORT0 EQU 0x40011830
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_PLD_ORT1
CYREG_B1_P4_U0_PLD_ORT1 EQU 0x40011832
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_PLD_ORT2
CYREG_B1_P4_U0_PLD_ORT2 EQU 0x40011834
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_PLD_ORT3
CYREG_B1_P4_U0_PLD_ORT3 EQU 0x40011836
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_MC_CFG_CEN_CONST
CYREG_B1_P4_U0_MC_CFG_CEN_CONST EQU 0x40011838
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_MC_CFG_XORFB
CYREG_B1_P4_U0_MC_CFG_XORFB EQU 0x4001183a
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_MC_CFG_SET_RESET
CYREG_B1_P4_U0_MC_CFG_SET_RESET EQU 0x4001183c
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_MC_CFG_BYPASS
CYREG_B1_P4_U0_MC_CFG_BYPASS EQU 0x4001183e
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_CFG0
CYREG_B1_P4_U0_CFG0 EQU 0x40011840
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_CFG1
CYREG_B1_P4_U0_CFG1 EQU 0x40011841
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_CFG2
CYREG_B1_P4_U0_CFG2 EQU 0x40011842
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_CFG3
CYREG_B1_P4_U0_CFG3 EQU 0x40011843
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_CFG4
CYREG_B1_P4_U0_CFG4 EQU 0x40011844
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_CFG5
CYREG_B1_P4_U0_CFG5 EQU 0x40011845
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_CFG6
CYREG_B1_P4_U0_CFG6 EQU 0x40011846
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_CFG7
CYREG_B1_P4_U0_CFG7 EQU 0x40011847
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_CFG8
CYREG_B1_P4_U0_CFG8 EQU 0x40011848
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_CFG9
CYREG_B1_P4_U0_CFG9 EQU 0x40011849
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_CFG10
CYREG_B1_P4_U0_CFG10 EQU 0x4001184a
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_CFG11
CYREG_B1_P4_U0_CFG11 EQU 0x4001184b
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_CFG12
CYREG_B1_P4_U0_CFG12 EQU 0x4001184c
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_CFG13
CYREG_B1_P4_U0_CFG13 EQU 0x4001184d
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_CFG14
CYREG_B1_P4_U0_CFG14 EQU 0x4001184e
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_CFG15
CYREG_B1_P4_U0_CFG15 EQU 0x4001184f
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_CFG16
CYREG_B1_P4_U0_CFG16 EQU 0x40011850
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_CFG20
CYREG_B1_P4_U0_CFG20 EQU 0x40011854
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_CFG21
CYREG_B1_P4_U0_CFG21 EQU 0x40011855
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_CFG22
CYREG_B1_P4_U0_CFG22 EQU 0x40011856
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_CFG23
CYREG_B1_P4_U0_CFG23 EQU 0x40011857
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_CFG24
CYREG_B1_P4_U0_CFG24 EQU 0x40011858
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_CFG25
CYREG_B1_P4_U0_CFG25 EQU 0x40011859
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_CFG26
CYREG_B1_P4_U0_CFG26 EQU 0x4001185a
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_CFG27
CYREG_B1_P4_U0_CFG27 EQU 0x4001185b
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_CFG28
CYREG_B1_P4_U0_CFG28 EQU 0x4001185c
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_CFG29
CYREG_B1_P4_U0_CFG29 EQU 0x4001185d
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_CFG30
CYREG_B1_P4_U0_CFG30 EQU 0x4001185e
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_CFG31
CYREG_B1_P4_U0_CFG31 EQU 0x4001185f
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_DCFG0
CYREG_B1_P4_U0_DCFG0 EQU 0x40011860
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_DCFG1
CYREG_B1_P4_U0_DCFG1 EQU 0x40011862
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_DCFG2
CYREG_B1_P4_U0_DCFG2 EQU 0x40011864
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_DCFG3
CYREG_B1_P4_U0_DCFG3 EQU 0x40011866
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_DCFG4
CYREG_B1_P4_U0_DCFG4 EQU 0x40011868
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_DCFG5
CYREG_B1_P4_U0_DCFG5 EQU 0x4001186a
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_DCFG6
CYREG_B1_P4_U0_DCFG6 EQU 0x4001186c
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U0_DCFG7
CYREG_B1_P4_U0_DCFG7 EQU 0x4001186e
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P4_U1_BASE
CYDEV_UCFG_B1_P4_U1_BASE EQU 0x40011880
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P4_U1_SIZE
CYDEV_UCFG_B1_P4_U1_SIZE EQU 0x00000070
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_PLD_IT0
CYREG_B1_P4_U1_PLD_IT0 EQU 0x40011880
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_PLD_IT1
CYREG_B1_P4_U1_PLD_IT1 EQU 0x40011884
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_PLD_IT2
CYREG_B1_P4_U1_PLD_IT2 EQU 0x40011888
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_PLD_IT3
CYREG_B1_P4_U1_PLD_IT3 EQU 0x4001188c
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_PLD_IT4
CYREG_B1_P4_U1_PLD_IT4 EQU 0x40011890
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_PLD_IT5
CYREG_B1_P4_U1_PLD_IT5 EQU 0x40011894
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_PLD_IT6
CYREG_B1_P4_U1_PLD_IT6 EQU 0x40011898
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_PLD_IT7
CYREG_B1_P4_U1_PLD_IT7 EQU 0x4001189c
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_PLD_IT8
CYREG_B1_P4_U1_PLD_IT8 EQU 0x400118a0
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_PLD_IT9
CYREG_B1_P4_U1_PLD_IT9 EQU 0x400118a4
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_PLD_IT10
CYREG_B1_P4_U1_PLD_IT10 EQU 0x400118a8
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_PLD_IT11
CYREG_B1_P4_U1_PLD_IT11 EQU 0x400118ac
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_PLD_ORT0
CYREG_B1_P4_U1_PLD_ORT0 EQU 0x400118b0
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_PLD_ORT1
CYREG_B1_P4_U1_PLD_ORT1 EQU 0x400118b2
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_PLD_ORT2
CYREG_B1_P4_U1_PLD_ORT2 EQU 0x400118b4
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_PLD_ORT3
CYREG_B1_P4_U1_PLD_ORT3 EQU 0x400118b6
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_MC_CFG_CEN_CONST
CYREG_B1_P4_U1_MC_CFG_CEN_CONST EQU 0x400118b8
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_MC_CFG_XORFB
CYREG_B1_P4_U1_MC_CFG_XORFB EQU 0x400118ba
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_MC_CFG_SET_RESET
CYREG_B1_P4_U1_MC_CFG_SET_RESET EQU 0x400118bc
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_MC_CFG_BYPASS
CYREG_B1_P4_U1_MC_CFG_BYPASS EQU 0x400118be
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_CFG0
CYREG_B1_P4_U1_CFG0 EQU 0x400118c0
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_CFG1
CYREG_B1_P4_U1_CFG1 EQU 0x400118c1
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_CFG2
CYREG_B1_P4_U1_CFG2 EQU 0x400118c2
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_CFG3
CYREG_B1_P4_U1_CFG3 EQU 0x400118c3
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_CFG4
CYREG_B1_P4_U1_CFG4 EQU 0x400118c4
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_CFG5
CYREG_B1_P4_U1_CFG5 EQU 0x400118c5
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_CFG6
CYREG_B1_P4_U1_CFG6 EQU 0x400118c6
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_CFG7
CYREG_B1_P4_U1_CFG7 EQU 0x400118c7
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_CFG8
CYREG_B1_P4_U1_CFG8 EQU 0x400118c8
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_CFG9
CYREG_B1_P4_U1_CFG9 EQU 0x400118c9
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_CFG10
CYREG_B1_P4_U1_CFG10 EQU 0x400118ca
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_CFG11
CYREG_B1_P4_U1_CFG11 EQU 0x400118cb
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_CFG12
CYREG_B1_P4_U1_CFG12 EQU 0x400118cc
