MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cydevicerv_trm.inc
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_CFG13
CYREG_B1_P4_U1_CFG13 EQU 0x400118cd
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_CFG14
CYREG_B1_P4_U1_CFG14 EQU 0x400118ce
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_CFG15
CYREG_B1_P4_U1_CFG15 EQU 0x400118cf
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_CFG16
CYREG_B1_P4_U1_CFG16 EQU 0x400118d0
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_CFG20
CYREG_B1_P4_U1_CFG20 EQU 0x400118d4
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_CFG21
CYREG_B1_P4_U1_CFG21 EQU 0x400118d5
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_CFG22
CYREG_B1_P4_U1_CFG22 EQU 0x400118d6
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_CFG23
CYREG_B1_P4_U1_CFG23 EQU 0x400118d7
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_CFG24
CYREG_B1_P4_U1_CFG24 EQU 0x400118d8
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_CFG25
CYREG_B1_P4_U1_CFG25 EQU 0x400118d9
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_CFG26
CYREG_B1_P4_U1_CFG26 EQU 0x400118da
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_CFG27
CYREG_B1_P4_U1_CFG27 EQU 0x400118db
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_CFG28
CYREG_B1_P4_U1_CFG28 EQU 0x400118dc
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_CFG29
CYREG_B1_P4_U1_CFG29 EQU 0x400118dd
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_CFG30
CYREG_B1_P4_U1_CFG30 EQU 0x400118de
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_CFG31
CYREG_B1_P4_U1_CFG31 EQU 0x400118df
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_DCFG0
CYREG_B1_P4_U1_DCFG0 EQU 0x400118e0
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_DCFG1
CYREG_B1_P4_U1_DCFG1 EQU 0x400118e2
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_DCFG2
CYREG_B1_P4_U1_DCFG2 EQU 0x400118e4
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_DCFG3
CYREG_B1_P4_U1_DCFG3 EQU 0x400118e6
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_DCFG4
CYREG_B1_P4_U1_DCFG4 EQU 0x400118e8
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_DCFG5
CYREG_B1_P4_U1_DCFG5 EQU 0x400118ea
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_DCFG6
CYREG_B1_P4_U1_DCFG6 EQU 0x400118ec
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P4_U1_DCFG7
CYREG_B1_P4_U1_DCFG7 EQU 0x400118ee
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P4_ROUTE_BASE
CYDEV_UCFG_B1_P4_ROUTE_BASE EQU 0x40011900
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P4_ROUTE_SIZE
CYDEV_UCFG_B1_P4_ROUTE_SIZE EQU 0x000000ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_BASE
CYDEV_UCFG_B1_P5_BASE EQU 0x40011a00
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_SIZE
CYDEV_UCFG_B1_P5_SIZE EQU 0x000001ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U0_BASE
CYDEV_UCFG_B1_P5_U0_BASE EQU 0x40011a00
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U0_SIZE
CYDEV_UCFG_B1_P5_U0_SIZE EQU 0x00000070
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_PLD_IT0
CYREG_B1_P5_U0_PLD_IT0 EQU 0x40011a00
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_PLD_IT1
CYREG_B1_P5_U0_PLD_IT1 EQU 0x40011a04
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_PLD_IT2
CYREG_B1_P5_U0_PLD_IT2 EQU 0x40011a08
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_PLD_IT3
CYREG_B1_P5_U0_PLD_IT3 EQU 0x40011a0c
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_PLD_IT4
CYREG_B1_P5_U0_PLD_IT4 EQU 0x40011a10
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_PLD_IT5
CYREG_B1_P5_U0_PLD_IT5 EQU 0x40011a14
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_PLD_IT6
CYREG_B1_P5_U0_PLD_IT6 EQU 0x40011a18
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_PLD_IT7
CYREG_B1_P5_U0_PLD_IT7 EQU 0x40011a1c
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_PLD_IT8
CYREG_B1_P5_U0_PLD_IT8 EQU 0x40011a20
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_PLD_IT9
CYREG_B1_P5_U0_PLD_IT9 EQU 0x40011a24
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_PLD_IT10
CYREG_B1_P5_U0_PLD_IT10 EQU 0x40011a28
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_PLD_IT11
CYREG_B1_P5_U0_PLD_IT11 EQU 0x40011a2c
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_PLD_ORT0
CYREG_B1_P5_U0_PLD_ORT0 EQU 0x40011a30
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_PLD_ORT1
CYREG_B1_P5_U0_PLD_ORT1 EQU 0x40011a32
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_PLD_ORT2
CYREG_B1_P5_U0_PLD_ORT2 EQU 0x40011a34
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_PLD_ORT3
CYREG_B1_P5_U0_PLD_ORT3 EQU 0x40011a36
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_MC_CFG_CEN_CONST
CYREG_B1_P5_U0_MC_CFG_CEN_CONST EQU 0x40011a38
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_MC_CFG_XORFB
CYREG_B1_P5_U0_MC_CFG_XORFB EQU 0x40011a3a
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_MC_CFG_SET_RESET
CYREG_B1_P5_U0_MC_CFG_SET_RESET EQU 0x40011a3c
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_MC_CFG_BYPASS
CYREG_B1_P5_U0_MC_CFG_BYPASS EQU 0x40011a3e
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_CFG0
CYREG_B1_P5_U0_CFG0 EQU 0x40011a40
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_CFG1
CYREG_B1_P5_U0_CFG1 EQU 0x40011a41
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_CFG2
CYREG_B1_P5_U0_CFG2 EQU 0x40011a42
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_CFG3
CYREG_B1_P5_U0_CFG3 EQU 0x40011a43
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_CFG4
CYREG_B1_P5_U0_CFG4 EQU 0x40011a44
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_CFG5
CYREG_B1_P5_U0_CFG5 EQU 0x40011a45
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_CFG6
CYREG_B1_P5_U0_CFG6 EQU 0x40011a46
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_CFG7
CYREG_B1_P5_U0_CFG7 EQU 0x40011a47
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_CFG8
CYREG_B1_P5_U0_CFG8 EQU 0x40011a48
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_CFG9
CYREG_B1_P5_U0_CFG9 EQU 0x40011a49
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_CFG10
CYREG_B1_P5_U0_CFG10 EQU 0x40011a4a
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_CFG11
CYREG_B1_P5_U0_CFG11 EQU 0x40011a4b
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_CFG12
CYREG_B1_P5_U0_CFG12 EQU 0x40011a4c
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_CFG13
CYREG_B1_P5_U0_CFG13 EQU 0x40011a4d
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_CFG14
CYREG_B1_P5_U0_CFG14 EQU 0x40011a4e
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_CFG15
CYREG_B1_P5_U0_CFG15 EQU 0x40011a4f
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_CFG16
CYREG_B1_P5_U0_CFG16 EQU 0x40011a50
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_CFG20
CYREG_B1_P5_U0_CFG20 EQU 0x40011a54
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_CFG21
CYREG_B1_P5_U0_CFG21 EQU 0x40011a55
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_CFG22
CYREG_B1_P5_U0_CFG22 EQU 0x40011a56
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_CFG23
CYREG_B1_P5_U0_CFG23 EQU 0x40011a57
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_CFG24
CYREG_B1_P5_U0_CFG24 EQU 0x40011a58
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_CFG25
CYREG_B1_P5_U0_CFG25 EQU 0x40011a59
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_CFG26
CYREG_B1_P5_U0_CFG26 EQU 0x40011a5a
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_CFG27
CYREG_B1_P5_U0_CFG27 EQU 0x40011a5b
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_CFG28
CYREG_B1_P5_U0_CFG28 EQU 0x40011a5c
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_CFG29
CYREG_B1_P5_U0_CFG29 EQU 0x40011a5d
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_CFG30
CYREG_B1_P5_U0_CFG30 EQU 0x40011a5e
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_CFG31
CYREG_B1_P5_U0_CFG31 EQU 0x40011a5f
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_DCFG0
CYREG_B1_P5_U0_DCFG0 EQU 0x40011a60
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_DCFG1
CYREG_B1_P5_U0_DCFG1 EQU 0x40011a62
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_DCFG2
CYREG_B1_P5_U0_DCFG2 EQU 0x40011a64
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_DCFG3
CYREG_B1_P5_U0_DCFG3 EQU 0x40011a66
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_DCFG4
CYREG_B1_P5_U0_DCFG4 EQU 0x40011a68
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_DCFG5
CYREG_B1_P5_U0_DCFG5 EQU 0x40011a6a
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_DCFG6
CYREG_B1_P5_U0_DCFG6 EQU 0x40011a6c
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U0_DCFG7
CYREG_B1_P5_U0_DCFG7 EQU 0x40011a6e
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_BASE
CYDEV_UCFG_B1_P5_U1_BASE EQU 0x40011a80
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_SIZE
CYDEV_UCFG_B1_P5_U1_SIZE EQU 0x00000070
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_PLD_IT0
CYREG_B1_P5_U1_PLD_IT0 EQU 0x40011a80
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_PLD_IT1
CYREG_B1_P5_U1_PLD_IT1 EQU 0x40011a84
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_PLD_IT2
CYREG_B1_P5_U1_PLD_IT2 EQU 0x40011a88
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_PLD_IT3
CYREG_B1_P5_U1_PLD_IT3 EQU 0x40011a8c
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_PLD_IT4
CYREG_B1_P5_U1_PLD_IT4 EQU 0x40011a90
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_PLD_IT5
CYREG_B1_P5_U1_PLD_IT5 EQU 0x40011a94
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_PLD_IT6
CYREG_B1_P5_U1_PLD_IT6 EQU 0x40011a98
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_PLD_IT7
CYREG_B1_P5_U1_PLD_IT7 EQU 0x40011a9c
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_PLD_IT8
CYREG_B1_P5_U1_PLD_IT8 EQU 0x40011aa0
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_PLD_IT9
CYREG_B1_P5_U1_PLD_IT9 EQU 0x40011aa4
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_PLD_IT10
CYREG_B1_P5_U1_PLD_IT10 EQU 0x40011aa8
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_PLD_IT11
CYREG_B1_P5_U1_PLD_IT11 EQU 0x40011aac
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_PLD_ORT0
CYREG_B1_P5_U1_PLD_ORT0 EQU 0x40011ab0
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_PLD_ORT1
CYREG_B1_P5_U1_PLD_ORT1 EQU 0x40011ab2
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_PLD_ORT2
CYREG_B1_P5_U1_PLD_ORT2 EQU 0x40011ab4
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_PLD_ORT3
CYREG_B1_P5_U1_PLD_ORT3 EQU 0x40011ab6
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_MC_CFG_CEN_CONST
CYREG_B1_P5_U1_MC_CFG_CEN_CONST EQU 0x40011ab8
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_MC_CFG_XORFB
CYREG_B1_P5_U1_MC_CFG_XORFB EQU 0x40011aba
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_MC_CFG_SET_RESET
CYREG_B1_P5_U1_MC_CFG_SET_RESET EQU 0x40011abc
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_MC_CFG_BYPASS
CYREG_B1_P5_U1_MC_CFG_BYPASS EQU 0x40011abe
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_CFG0
CYREG_B1_P5_U1_CFG0 EQU 0x40011ac0
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_CFG1
CYREG_B1_P5_U1_CFG1 EQU 0x40011ac1
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_CFG2
CYREG_B1_P5_U1_CFG2 EQU 0x40011ac2
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_CFG3
CYREG_B1_P5_U1_CFG3 EQU 0x40011ac3
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_CFG4
CYREG_B1_P5_U1_CFG4 EQU 0x40011ac4
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_CFG5
CYREG_B1_P5_U1_CFG5 EQU 0x40011ac5
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_CFG6
CYREG_B1_P5_U1_CFG6 EQU 0x40011ac6
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_CFG7
CYREG_B1_P5_U1_CFG7 EQU 0x40011ac7
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_CFG8
CYREG_B1_P5_U1_CFG8 EQU 0x40011ac8
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_CFG9
CYREG_B1_P5_U1_CFG9 EQU 0x40011ac9
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_CFG10
CYREG_B1_P5_U1_CFG10 EQU 0x40011aca
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_CFG11
CYREG_B1_P5_U1_CFG11 EQU 0x40011acb
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_CFG12
CYREG_B1_P5_U1_CFG12 EQU 0x40011acc
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_CFG13
CYREG_B1_P5_U1_CFG13 EQU 0x40011acd
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_CFG14
CYREG_B1_P5_U1_CFG14 EQU 0x40011ace
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_CFG15
CYREG_B1_P5_U1_CFG15 EQU 0x40011acf
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_CFG16
CYREG_B1_P5_U1_CFG16 EQU 0x40011ad0
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_CFG20
CYREG_B1_P5_U1_CFG20 EQU 0x40011ad4
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_CFG21
CYREG_B1_P5_U1_CFG21 EQU 0x40011ad5
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_CFG22
CYREG_B1_P5_U1_CFG22 EQU 0x40011ad6
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_CFG23
CYREG_B1_P5_U1_CFG23 EQU 0x40011ad7
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_CFG24
CYREG_B1_P5_U1_CFG24 EQU 0x40011ad8
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_CFG25
CYREG_B1_P5_U1_CFG25 EQU 0x40011ad9
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_CFG26
CYREG_B1_P5_U1_CFG26 EQU 0x40011ada
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_CFG27
CYREG_B1_P5_U1_CFG27 EQU 0x40011adb
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_CFG28
CYREG_B1_P5_U1_CFG28 EQU 0x40011adc
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_CFG29
CYREG_B1_P5_U1_CFG29 EQU 0x40011add
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_CFG30
CYREG_B1_P5_U1_CFG30 EQU 0x40011ade
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_CFG31
CYREG_B1_P5_U1_CFG31 EQU 0x40011adf
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_DCFG0
CYREG_B1_P5_U1_DCFG0 EQU 0x40011ae0
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_DCFG1
CYREG_B1_P5_U1_DCFG1 EQU 0x40011ae2
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_DCFG2
CYREG_B1_P5_U1_DCFG2 EQU 0x40011ae4
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_DCFG3
CYREG_B1_P5_U1_DCFG3 EQU 0x40011ae6
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_DCFG4
CYREG_B1_P5_U1_DCFG4 EQU 0x40011ae8
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_DCFG5
CYREG_B1_P5_U1_DCFG5 EQU 0x40011aea
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_DCFG6
CYREG_B1_P5_U1_DCFG6 EQU 0x40011aec
    ENDIF
    IF :LNOT::DEF:CYREG_B1_P5_U1_DCFG7
CYREG_B1_P5_U1_DCFG7 EQU 0x40011aee
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_ROUTE_BASE
CYDEV_UCFG_B1_P5_ROUTE_BASE EQU 0x40011b00
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_ROUTE_SIZE
CYDEV_UCFG_B1_P5_ROUTE_SIZE EQU 0x000000ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_DSI0_BASE
CYDEV_UCFG_DSI0_BASE EQU 0x40014000
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_DSI0_SIZE
CYDEV_UCFG_DSI0_SIZE EQU 0x000000ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_DSI1_BASE
CYDEV_UCFG_DSI1_BASE EQU 0x40014100
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_DSI1_SIZE
CYDEV_UCFG_DSI1_SIZE EQU 0x000000ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_DSI2_BASE
CYDEV_UCFG_DSI2_BASE EQU 0x40014200
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_DSI2_SIZE
CYDEV_UCFG_DSI2_SIZE EQU 0x000000ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_DSI3_BASE
CYDEV_UCFG_DSI3_BASE EQU 0x40014300
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_DSI3_SIZE
CYDEV_UCFG_DSI3_SIZE EQU 0x000000ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_DSI4_BASE
CYDEV_UCFG_DSI4_BASE EQU 0x40014400
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_DSI4_SIZE
CYDEV_UCFG_DSI4_SIZE EQU 0x000000ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_DSI5_BASE
CYDEV_UCFG_DSI5_BASE EQU 0x40014500
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_DSI5_SIZE
CYDEV_UCFG_DSI5_SIZE EQU 0x000000ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_DSI6_BASE
CYDEV_UCFG_DSI6_BASE EQU 0x40014600
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_DSI6_SIZE
CYDEV_UCFG_DSI6_SIZE EQU 0x000000ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_DSI7_BASE
CYDEV_UCFG_DSI7_BASE EQU 0x40014700
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_DSI7_SIZE
CYDEV_UCFG_DSI7_SIZE EQU 0x000000ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_DSI8_BASE
CYDEV_UCFG_DSI8_BASE EQU 0x40014800
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_DSI8_SIZE
CYDEV_UCFG_DSI8_SIZE EQU 0x000000ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_DSI9_BASE
CYDEV_UCFG_DSI9_BASE EQU 0x40014900
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_DSI9_SIZE
CYDEV_UCFG_DSI9_SIZE EQU 0x000000ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_DSI12_BASE
CYDEV_UCFG_DSI12_BASE EQU 0x40014c00
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_DSI12_SIZE
CYDEV_UCFG_DSI12_SIZE EQU 0x000000ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_DSI13_BASE
CYDEV_UCFG_DSI13_BASE EQU 0x40014d00
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_DSI13_SIZE
CYDEV_UCFG_DSI13_SIZE EQU 0x000000ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_BCTL0_BASE
CYDEV_UCFG_BCTL0_BASE EQU 0x40015000
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_BCTL0_SIZE
CYDEV_UCFG_BCTL0_SIZE EQU 0x00000010
    ENDIF
    IF :LNOT::DEF:CYREG_BCTL0_MDCLK_EN
CYREG_BCTL0_MDCLK_EN EQU 0x40015000
    ENDIF
    IF :LNOT::DEF:CYREG_BCTL0_MBCLK_EN
CYREG_BCTL0_MBCLK_EN EQU 0x40015001
    ENDIF
    IF :LNOT::DEF:CYREG_BCTL0_WAIT_CFG
CYREG_BCTL0_WAIT_CFG EQU 0x40015002
    ENDIF
    IF :LNOT::DEF:CYREG_BCTL0_BANK_CTL
CYREG_BCTL0_BANK_CTL EQU 0x40015003
    ENDIF
    IF :LNOT::DEF:CYREG_BCTL0_DCLK_EN0
CYREG_BCTL0_DCLK_EN0 EQU 0x40015008
    ENDIF
    IF :LNOT::DEF:CYREG_BCTL0_BCLK_EN0
CYREG_BCTL0_BCLK_EN0 EQU 0x40015009
    ENDIF
    IF :LNOT::DEF:CYREG_BCTL0_DCLK_EN1
CYREG_BCTL0_DCLK_EN1 EQU 0x4001500a
    ENDIF
    IF :LNOT::DEF:CYREG_BCTL0_BCLK_EN1
CYREG_BCTL0_BCLK_EN1 EQU 0x4001500b
    ENDIF
    IF :LNOT::DEF:CYREG_BCTL0_DCLK_EN2
CYREG_BCTL0_DCLK_EN2 EQU 0x4001500c
    ENDIF
    IF :LNOT::DEF:CYREG_BCTL0_BCLK_EN2
CYREG_BCTL0_BCLK_EN2 EQU 0x4001500d
    ENDIF
    IF :LNOT::DEF:CYREG_BCTL0_DCLK_EN3
CYREG_BCTL0_DCLK_EN3 EQU 0x4001500e
    ENDIF
    IF :LNOT::DEF:CYREG_BCTL0_BCLK_EN3
CYREG_BCTL0_BCLK_EN3 EQU 0x4001500f
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_BCTL1_BASE
CYDEV_UCFG_BCTL1_BASE EQU 0x40015010
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_BCTL1_SIZE
CYDEV_UCFG_BCTL1_SIZE EQU 0x00000010
    ENDIF
    IF :LNOT::DEF:CYREG_BCTL1_MDCLK_EN
CYREG_BCTL1_MDCLK_EN EQU 0x40015010
    ENDIF
    IF :LNOT::DEF:CYREG_BCTL1_MBCLK_EN
CYREG_BCTL1_MBCLK_EN EQU 0x40015011
    ENDIF
    IF :LNOT::DEF:CYREG_BCTL1_WAIT_CFG
CYREG_BCTL1_WAIT_CFG EQU 0x40015012
    ENDIF
    IF :LNOT::DEF:CYREG_BCTL1_BANK_CTL
CYREG_BCTL1_BANK_CTL EQU 0x40015013
    ENDIF
    IF :LNOT::DEF:CYREG_BCTL1_DCLK_EN0
CYREG_BCTL1_DCLK_EN0 EQU 0x40015018
    ENDIF
    IF :LNOT::DEF:CYREG_BCTL1_BCLK_EN0
CYREG_BCTL1_BCLK_EN0 EQU 0x40015019
    ENDIF
    IF :LNOT::DEF:CYREG_BCTL1_DCLK_EN1
CYREG_BCTL1_DCLK_EN1 EQU 0x4001501a
    ENDIF
    IF :LNOT::DEF:CYREG_BCTL1_BCLK_EN1
CYREG_BCTL1_BCLK_EN1 EQU 0x4001501b
    ENDIF
    IF :LNOT::DEF:CYREG_BCTL1_DCLK_EN2
CYREG_BCTL1_DCLK_EN2 EQU 0x4001501c
    ENDIF
    IF :LNOT::DEF:CYREG_BCTL1_BCLK_EN2
CYREG_BCTL1_BCLK_EN2 EQU 0x4001501d
    ENDIF
    IF :LNOT::DEF:CYREG_BCTL1_DCLK_EN3
CYREG_BCTL1_DCLK_EN3 EQU 0x4001501e
    ENDIF
    IF :LNOT::DEF:CYREG_BCTL1_BCLK_EN3
CYREG_BCTL1_BCLK_EN3 EQU 0x4001501f
    ENDIF
    IF :LNOT::DEF:CYDEV_IDMUX_BASE
CYDEV_IDMUX_BASE EQU 0x40015100
    ENDIF
    IF :LNOT::DEF:CYDEV_IDMUX_SIZE
CYDEV_IDMUX_SIZE EQU 0x00000016
    ENDIF
    IF :LNOT::DEF:CYREG_IDMUX_IRQ_CTL0
CYREG_IDMUX_IRQ_CTL0 EQU 0x40015100
    ENDIF
    IF :LNOT::DEF:CYREG_IDMUX_IRQ_CTL1
CYREG_IDMUX_IRQ_CTL1 EQU 0x40015101
    ENDIF
    IF :LNOT::DEF:CYREG_IDMUX_IRQ_CTL2
CYREG_IDMUX_IRQ_CTL2 EQU 0x40015102
    ENDIF
    IF :LNOT::DEF:CYREG_IDMUX_IRQ_CTL3
CYREG_IDMUX_IRQ_CTL3 EQU 0x40015103
    ENDIF
    IF :LNOT::DEF:CYREG_IDMUX_IRQ_CTL4
CYREG_IDMUX_IRQ_CTL4 EQU 0x40015104
    ENDIF
    IF :LNOT::DEF:CYREG_IDMUX_IRQ_CTL5
CYREG_IDMUX_IRQ_CTL5 EQU 0x40015105
    ENDIF
    IF :LNOT::DEF:CYREG_IDMUX_IRQ_CTL6
CYREG_IDMUX_IRQ_CTL6 EQU 0x40015106
    ENDIF
    IF :LNOT::DEF:CYREG_IDMUX_IRQ_CTL7
CYREG_IDMUX_IRQ_CTL7 EQU 0x40015107
    ENDIF
    IF :LNOT::DEF:CYREG_IDMUX_DRQ_CTL0
CYREG_IDMUX_DRQ_CTL0 EQU 0x40015110
    ENDIF
    IF :LNOT::DEF:CYREG_IDMUX_DRQ_CTL1
CYREG_IDMUX_DRQ_CTL1 EQU 0x40015111
    ENDIF
    IF :LNOT::DEF:CYREG_IDMUX_DRQ_CTL2
CYREG_IDMUX_DRQ_CTL2 EQU 0x40015112
    ENDIF
    IF :LNOT::DEF:CYREG_IDMUX_DRQ_CTL3
CYREG_IDMUX_DRQ_CTL3 EQU 0x40015113
    ENDIF
    IF :LNOT::DEF:CYREG_IDMUX_DRQ_CTL4
CYREG_IDMUX_DRQ_CTL4 EQU 0x40015114
    ENDIF
    IF :LNOT::DEF:CYREG_IDMUX_DRQ_CTL5
CYREG_IDMUX_DRQ_CTL5 EQU 0x40015115
    ENDIF
    IF :LNOT::DEF:CYDEV_P3BA_BASE
CYDEV_P3BA_BASE EQU 0x40050300
    ENDIF
    IF :LNOT::DEF:CYDEV_P3BA_SIZE
CYDEV_P3BA_SIZE EQU 0x0000002b
    ENDIF
    IF :LNOT::DEF:CYREG_P3BA_Y_START
CYREG_P3BA_Y_START EQU 0x40050300
    ENDIF
    IF :LNOT::DEF:CYREG_P3BA_YROLL
CYREG_P3BA_YROLL EQU 0x40050301
    ENDIF
    IF :LNOT::DEF:CYREG_P3BA_YCFG
CYREG_P3BA_YCFG EQU 0x40050302
    ENDIF
    IF :LNOT::DEF:CYREG_P3BA_X_START1
CYREG_P3BA_X_START1 EQU 0x40050303
    ENDIF
    IF :LNOT::DEF:CYREG_P3BA_X_START2
CYREG_P3BA_X_START2 EQU 0x40050304
    ENDIF
    IF :LNOT::DEF:CYREG_P3BA_XROLL1
CYREG_P3BA_XROLL1 EQU 0x40050305
    ENDIF
    IF :LNOT::DEF:CYREG_P3BA_XROLL2
CYREG_P3BA_XROLL2 EQU 0x40050306
    ENDIF
    IF :LNOT::DEF:CYREG_P3BA_XINC
CYREG_P3BA_XINC EQU 0x40050307
    ENDIF
    IF :LNOT::DEF:CYREG_P3BA_XCFG
CYREG_P3BA_XCFG EQU 0x40050308
    ENDIF
    IF :LNOT::DEF:CYREG_P3BA_OFFSETADDR1
CYREG_P3BA_OFFSETADDR1 EQU 0x40050309
    ENDIF
    IF :LNOT::DEF:CYREG_P3BA_OFFSETADDR2
CYREG_P3BA_OFFSETADDR2 EQU 0x4005030a
    ENDIF
    IF :LNOT::DEF:CYREG_P3BA_OFFSETADDR3
CYREG_P3BA_OFFSETADDR3 EQU 0x4005030b
    ENDIF
    IF :LNOT::DEF:CYREG_P3BA_ABSADDR1
CYREG_P3BA_ABSADDR1 EQU 0x4005030c
    ENDIF
    IF :LNOT::DEF:CYREG_P3BA_ABSADDR2
CYREG_P3BA_ABSADDR2 EQU 0x4005030d
    ENDIF
    IF :LNOT::DEF:CYREG_P3BA_ABSADDR3
CYREG_P3BA_ABSADDR3 EQU 0x4005030e
    ENDIF
    IF :LNOT::DEF:CYREG_P3BA_ABSADDR4
CYREG_P3BA_ABSADDR4 EQU 0x4005030f
    ENDIF
    IF :LNOT::DEF:CYREG_P3BA_DATCFG1
CYREG_P3BA_DATCFG1 EQU 0x40050310
    ENDIF
    IF :LNOT::DEF:CYREG_P3BA_DATCFG2
CYREG_P3BA_DATCFG2 EQU 0x40050311
    ENDIF
    IF :LNOT::DEF:CYREG_P3BA_CMP_RSLT1
CYREG_P3BA_CMP_RSLT1 EQU 0x40050314
    ENDIF
    IF :LNOT::DEF:CYREG_P3BA_CMP_RSLT2
CYREG_P3BA_CMP_RSLT2 EQU 0x40050315
    ENDIF
    IF :LNOT::DEF:CYREG_P3BA_CMP_RSLT3
CYREG_P3BA_CMP_RSLT3 EQU 0x40050316
    ENDIF
    IF :LNOT::DEF:CYREG_P3BA_CMP_RSLT4
CYREG_P3BA_CMP_RSLT4 EQU 0x40050317
    ENDIF
    IF :LNOT::DEF:CYREG_P3BA_DATA_REG1
CYREG_P3BA_DATA_REG1 EQU 0x40050318
    ENDIF
    IF :LNOT::DEF:CYREG_P3BA_DATA_REG2
CYREG_P3BA_DATA_REG2 EQU 0x40050319
    ENDIF
    IF :LNOT::DEF:CYREG_P3BA_DATA_REG3
CYREG_P3BA_DATA_REG3 EQU 0x4005031a
    ENDIF
    IF :LNOT::DEF:CYREG_P3BA_DATA_REG4
CYREG_P3BA_DATA_REG4 EQU 0x4005031b
    ENDIF
    IF :LNOT::DEF:CYREG_P3BA_EXP_DATA1
CYREG_P3BA_EXP_DATA1 EQU 0x4005031c
    ENDIF
    IF :LNOT::DEF:CYREG_P3BA_EXP_DATA2
CYREG_P3BA_EXP_DATA2 EQU 0x4005031d
    ENDIF
    IF :LNOT::DEF:CYREG_P3BA_EXP_DATA3
CYREG_P3BA_EXP_DATA3 EQU 0x4005031e
    ENDIF
    IF :LNOT::DEF:CYREG_P3BA_EXP_DATA4
CYREG_P3BA_EXP_DATA4 EQU 0x4005031f
    ENDIF
    IF :LNOT::DEF:CYREG_P3BA_MSTR_HRDATA1
CYREG_P3BA_MSTR_HRDATA1 EQU 0x40050320
    ENDIF
    IF :LNOT::DEF:CYREG_P3BA_MSTR_HRDATA2
CYREG_P3BA_MSTR_HRDATA2 EQU 0x40050321
    ENDIF
    IF :LNOT::DEF:CYREG_P3BA_MSTR_HRDATA3
CYREG_P3BA_MSTR_HRDATA3 EQU 0x40050322
    ENDIF
    IF :LNOT::DEF:CYREG_P3BA_MSTR_HRDATA4
CYREG_P3BA_MSTR_HRDATA4 EQU 0x40050323
    ENDIF
    IF :LNOT::DEF:CYREG_P3BA_BIST_EN
CYREG_P3BA_BIST_EN EQU 0x40050324
    ENDIF
    IF :LNOT::DEF:CYREG_P3BA_PHUB_MASTER_SSR
CYREG_P3BA_PHUB_MASTER_SSR EQU 0x40050325
    ENDIF
    IF :LNOT::DEF:CYREG_P3BA_SEQCFG1
CYREG_P3BA_SEQCFG1 EQU 0x40050326
    ENDIF
    IF :LNOT::DEF:CYREG_P3BA_SEQCFG2
CYREG_P3BA_SEQCFG2 EQU 0x40050327
    ENDIF
    IF :LNOT::DEF:CYREG_P3BA_Y_CURR
CYREG_P3BA_Y_CURR EQU 0x40050328
    ENDIF
    IF :LNOT::DEF:CYREG_P3BA_X_CURR1
CYREG_P3BA_X_CURR1 EQU 0x40050329
    ENDIF
    IF :LNOT::DEF:CYREG_P3BA_X_CURR2
CYREG_P3BA_X_CURR2 EQU 0x4005032a
    ENDIF
    IF :LNOT::DEF:CYDEV_PANTHER_BASE
CYDEV_PANTHER_BASE EQU 0x40080000
    ENDIF
    IF :LNOT::DEF:CYDEV_PANTHER_SIZE
CYDEV_PANTHER_SIZE EQU 0x00000018
    ENDIF
    IF :LNOT::DEF:CYREG_PANTHER_STCALIB_CFG
CYREG_PANTHER_STCALIB_CFG EQU 0x40080000
    ENDIF
    IF :LNOT::DEF:CYREG_PANTHER_WAITPIPE
CYREG_PANTHER_WAITPIPE EQU 0x40080004
    ENDIF
    IF :LNOT::DEF:CYREG_PANTHER_TRACE_CFG
CYREG_PANTHER_TRACE_CFG EQU 0x40080008
    ENDIF
    IF :LNOT::DEF:CYREG_PANTHER_ETMFIFO
CYREG_PANTHER_ETMFIFO EQU 0x4008000c
    ENDIF
    IF :LNOT::DEF:CYREG_PANTHER_PVTCFG1
CYREG_PANTHER_PVTCFG1 EQU 0x40080010
    ENDIF
    IF :LNOT::DEF:CYREG_PANTHER_PVTCFG2
CYREG_PANTHER_PVTCFG2 EQU 0x40080014
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSECC_BASE
CYDEV_FLSECC_BASE EQU 0x48000000
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSECC_SIZE
CYDEV_FLSECC_SIZE EQU 0x00008000
    ENDIF
